[
	{
		"id": "270b0d87-191d-4a3c-8e44-0a38519ddfb8",
		"name": "",
		"content": {
			"en": "‘Alqamah bin Waqqāṣ al-Laythi narrated, he said: I heard ‘Umar bin al-Khaṭṭāb – may AlLāh be pleased with him – say on the pulpit: I heard the Messenger of AlLāh say:\n“Actions are judged by intentions, and every person will be rewarded according to what he has intended. Thus, the person whose migration was for worldly benefits or for a woman (that he intended) to marry, his migration will be for what he migrated for.”\n[Aṭrāfuhu fī: ḥadīth no: 54, 2529, 3898, 5070, 6689 and 6953]",
			"ms": "1 – Al-Humaydi ‘Abdullah bin al-Zubayr menyampaikan kepada kami, katanya Sufyan menyampaikan kepada kami, katanya Yahya bin Sa‘id al-Anshari menyampaikan kepada kami, katanya Muhammad bin Ibrahim al-Taymi mengkhabarkan kepadaku, bahawa dia pernah mendengar ‘Alqamah bin Waqqash al-Laytsi berkata, saya telah mendengar ‘Umar bin al-Khaththab berkata di atas mimbar, saya mendengar Rasulullah bersabda, “Setiap perbuatan itu hanya dikira berdasarkan niatnya. Setiap orang hanya akan mendapatkan balasan daripada apa yang dia niatkan sahaja. Oleh itu, sesiapa yang berhijrah dengan tujuan dunia atau kerana wanita yang ingin dia nikahinya, maka hijrahnya tadi dikira untuk tujuannya itu.” ",
			"ar": "حَدَّثَنَا الْحُمَيْدِيُّ عَبْدُ اللَّهِ بْنُ الزُّبَيْرِ، قَالَ: حَدَّثَنَا سُفْيَانُ، قَالَ: حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْأَنْصَارِيُّ، قَالَ: أَخْبَرَنِي مُحَمَّدُ بْنُ إِبْرَاهِيمَ التَّيْمِيُّ، أَنَّهُ سَمِعَ عَلْقَمَةَ بْنَ وَقَّاصٍ اللَّيْثِيَّ، يَقُولُ: سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ ـ رضى الله عنه ـ عَلَى الْمِنْبَرِ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ يَقُولُ: \"إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ، وَإِنَّمَا لِكُلِّ امْرِئٍ مَا نَوَى، فَمَنْ كَانَتْ هِجْرَتُهُ إِلَى دُنْيَا يُصِيبُهَا أَوْ إِلَى امْرَأَةٍ يَنْكِحُهَا فَهِجْرَتُهُ إِلَى مَا هَاجَرَ إِلَيْهِ.\""
		},
		"chapter_id": "1cfedcd5-2108-4557-9661-90f8602435de",
		"chapter_name": "first_chapter",
		"title": {
			"en": "How was the Divine Revelation initially revealed to AlLāh’s Messenger (peace and blessings be upon him) ",
			"ms": "Bagaimana Permulaan Datangnya Wahyu Kepada Rasulullah SAW",
			"ar": "باب كَيْفَ كَانَ بَدْءُ الْوَحْىِ إِلَى رسول الله"
		},
		"category_id": "7bae1d78-1524-4633-b12a-c713e6bcfd15",
		"category_name": "",
		"category_title": {
			"en": "Book of the Beginning of Revelation ",
			"ms": "Kitab Permulaan Wahyu",
			"ar": "كتاب بدء الوحى"
		},
		"book_name": "sahih_bukhari",
		"book_title": "Sahih Bukhari",
		"book_id": "ad6a2cc8-f34b-476b-9b7e-6756a3b7d43e"
	},
	{
		"id": "04b4e298-4ca5-449b-994a-079170f186f8",
		"name": "",
		"content": {
			"en": "‘Ā-ishah (binti Abī Bakr), the mother of the believers, -may AlLāh be pleased with her – narrated that al-Ḥārith bin Hishām asked AlLāh’s Messenger: “O AlLāh’s Messenger! How is the Divine Revelation revealed to you?” The Messenger of AlLāh replied, “Sometimes it is (revealed) like the ringing of a bell, this form of Revelation is the heaviest of all on me, and then this state leaves me after I have memorised what is revealed. Sometimes, the Angel (i.e. Jibrīl - Gabriel) comes in the form of a man and talks to me, and I remember whatever he says.”",
			"ms": "2 – ‘Abdullah bin Yusuf telah menyampaikan kepada kami, katanya Malik telah mengkhabarkan kepada kami, daripada Hisyam bin ‘Urwah, daripada ayahnya, daripada ‘A’isyah Umm al-Mukminin i, bahawa al-Harits bin Hisyam h pernah bertanya kepada Rasulullah, “Wahai Rasulullah, bagaimanakah wahyu turun kepadamu?” Rasulullah  menjawab, “Wahyu datang kepadaku kadangkala seperti dentang suara loceng, dan cara inilah yang paling berat untukku. Kedatangan wahyu itu selesai dalam keadaan saya telah pun memahami dan ingat apa yang disampaikan. Kadangkala malaikat yang datang kepadaku menyerupai seorang lelaki, lalu dia berbicara dengan saya. Lantas, saya memahami dan ingat apa yang diucapkannya.”\n\n ‘A’isyah bercerita, “Sungguh, saya pernah melihat wahyu diturunkan kepada baginda pada suatu hari yang sangat sejuk. Sebaik sahaja ia selesai, saya melihat dahi baginda bercucuran peluh.”",
			"ar": " -حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ: أَخْبَرَنَا مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ أُمِّ المُؤْمِنِينَ رَضِيَ اللَّهُ عَنْهَا، أَنَّ الحَارِثَ بْنَ هِشَامٍ رَضِيَ اللَّهُ عَنْهُ سَأَلَ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: يَا رَسُولَ اللَّهِ، كَيْفَ يَأْتِيكَ الوَحْيُ؟ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَحْيَانًا يَأْتِينِي مِثْلَ صَلْصَلَةِ الجَرَسِ، وَهُوَ أَشَدُّهُ عَلَيَّ، فَيُفْصَمُ عَنِّي وَقَدْ وَعَيْتُ عَنْهُ مَا قَالَ، وَأَحْيَانًا يَتَمَثَّلُ لِيَ المَلَكُ رَجُلًا فَيُكَلِّمُنِي فَأَعِي مَا يَقُولُ» قَالَتْ عَائِشَةُ رَضِيَ اللَّهُ عَنْهَا: وَلَقَدْ رَأَيْتُهُ يَنْزِلُ عَلَيْهِ الوَحْيُ فِي اليَوْمِ الشَّدِيدِ البَرْدِ، فَيَفْصِمُ عَنْهُ وَإِنَّ جَبِينَهُ لَيَتَفَصَّدُ عَرَقًا"
		},
		"chapter_id": "1cfedcd5-2108-4557-9661-90f8602435de",
		"chapter_name": "first_chapter",
		"title": {
			"en": "How was the Divine Revelation initially revealed to AlLāh’s Messenger (peace and blessings be upon him) ",
			"ms": "Bagaimana Permulaan Datangnya Wahyu Kepada Rasulullah SAW",
			"ar": "باب كَيْفَ كَانَ بَدْءُ الْوَحْىِ إِلَى رسول الله"
		},
		"category_id": "7bae1d78-1524-4633-b12a-c713e6bcfd15",
		"category_name": "",
		"category_title": {
			"en": "Book of the Beginning of Revelation ",
			"ms": "Kitab Permulaan Wahyu",
			"ar": "كتاب بدء الوحى"
		},
		"book_name": "sahih_bukhari",
		"book_title": "Sahih Bukhari",
		"book_id": "ad6a2cc8-f34b-476b-9b7e-6756a3b7d43e"
	},
	{
		"id": "fc579f71-d7c9-496b-be84-deea0c1b6692",
		"name": "",
		"content": {
			"en": "‘Ā-ishah, the mother of the believers, – may AlLāh be pleased with her – said: The Divine Revelation to AlLāh’s Messenger first came in the form of good dreams which came like bright daybreak or sunrise (meaning very clear dreams), and then the love of seclusion was bestowed upon him. He used to go in seclusion in the cave of Ḥirā’ where he used to do at-Taḥannuth (i.e to abstain himself from sinful acts which his people indulged themselves in and devote himself to worship AlLāh following Prophet Ibrāhīm’s teachings), which went on for many nights before he returned to his family. He used to take provisions with him for the stay, and then come back to (his wife) Khadījah to take more provisions until the Truth (i.e. the Qur’ān) descended upon him while he was in the cave of Ḥirā’.\nThe angel came to him and said to him, “Read!” The Prophet replied, “I do not know how to read.” The Prophet added, “The angel caught me (forcefully) in an embrace and pressed me so hard until I could not bear it. Then, he released me and again asked me to read, and I replied, “I do not know how to read.” Then, he caught me again and pressed me in an embrace until I could not bear it. He then released me and again asked me to read but again I replied, “I do not know how to read!” He caught me for the third time and pressed me in an embrace, and then released me and said, {Read in the name of your Lord, who has created (all that exists), (He Who) created man from a clot. Read! And your Lord is the Most Generous.} \nThen AlLāh’s Messenger returned with the Revelation and with his heart beating rapidly and went to Khadījah binti Khuwaylid – may AlLāh be pleased with her – and said, “Wrap me! Wrap me!” She wrapped him with a blanket until his fear was over, and he told her everything that had happened and said, “I fear that something (bad) may happen to me.” Khadījah replied, “Never! By AlLāh, AlLāh will never disgrace you. You keep good relations with your kith and kin, help the poor and the destitute, serve your guests generously and aid those afflicted with calamities.\" \nKhadījah then accompanied him to her paternal cousin Waraqah bin Naufal bin Asad bin ‘Abd al-‘Uzzā, who was a Christian during the Age of Ignorance and used to write in Hebrew. He would write from the Gospel in Hebrew as much as AlLāh wished him to write. He was an old man who had lost his eyesight. Khadījah said to Waraqah, “Listen to the story of your nephew O cousin!” Waraqah asked, “O my nephew! What did you see?” AlLāh’s Messenger described to Waraqah whatever he had seen. Waraqah said, “This is Nāmūs the angel who keeps the secrets, (i.e. Jibrīl/Gabriel) whom AlLāh had sent to Mūsā (Moses). Oh, if only I were young and could still be alive when your people expel you.” AlLāh’s Messenger asked, “Will they expel me?” Waraqah replied, “Yes. Never came a man with the likes of what you have brought except he is met with hostilities; and if I should remain alive till the day when you will be expelled, I would support you strongly.” But after a few days Waraqah died, and the Divine Revelation was also paused for a while.\n[Aṭrāfuhu fī: ḥadīth no: 3392, 4953, 4955, 4956, 4957 and 6982]",
			"ms": "3 – Yahya bin Bukayr menyampaikan kepada kami, katanya al-Layts menyampaikan kepada kami, daripada ‘Uqayl, daripada Ibn Syihab, daripada ‘Urwah bin al-Zubayr, daripada ‘A’isyah Umm al-Mukminin, beliau berkata, “Wahyu pertama yang datang kepada Rasulullah adalah berupa mimpi yang benar. Mimpi baginda itu tidak lain tidak bukan adalah seperti cahaya pagi. Kemudian baginda suka menyendiri di Gua Hira’ untuk ber-tahannuts; iaitu beribadah beberapa malam. Lalu baginda berkeinginan untuk pulang ke rumahnya untuk berjumpa dengan keluarga baginda di samping menyediakan bekalan untuk ber-tahannuts kembali. Setelah itu, baginda pulang lagi menemui Khadijah untuk mengambil bekalan seperti sebelumnya. Sehinggalah akhirnya datanglah kebenaran (wahyu) ketika baginda berada di Gua Hira’. Malaikat datang kepada baginda lalu berkata, “Bacalah!” Baginda menjawab, “Saya tidak boleh membaca.” Baginda bercerita, “Malaikat itu memegang dan mendakapku dengan sangat kuat. Kemudian dia melepaskanku lalu berkata lagi “Bacalah!” Baginda menjawab, “Saya tidak boleh membaca.” Malaikat itu kembali mendakapku dengan sangat kuat buat kali kedua, kemudian melepaskanku lantas berkata, “Bacalah!” Baginda menjawab “Saya tidak boleh membaca.” Malaikat mendakapku lagi untuk kali ketiga dengan sangat kuat dan melepaskanku seraya berkata, “Bacalah dengan menyebut nama Tuhanmu yang menciptakan, Dia telah menciptakan manusia daripada segumpal darah. Bacalah, dan Tuhanmu itu Tuhan yang Maha Mulia.”\n\n Rasulullah pulang ke pangkuan keluarganya dengan membawa wahyu itu dalam keadaan ketakutan. Baginda menemui Khadijah binti Khuwaylid dan berkata, “Selimutilah saya, selimutilah saya!” Beliau pun menyelimuti baginda sehingga hingga hilang rasa takut baginda. Lalu baginda menceritakan peristiwa yang terjadi tadi kepada Khadijah, lalu mengadu “Saya risaukan diri saya.” Khadijah berkata, “Demi Allah, Allah pasti tidak akan menghinakanmu selamanya. Engkau adalah orang yang suka menghubungkan tali silaturahim, menanggung kesulitan orang susah, membantu fakir miskin, memuliakan tetamu dan membantu meringankan penderitaan ketika berlakunya bencana.” Khadijah kemudian membawa baginda bertemu dengan Waraqah bin Naufal bin Asad bin ‘Abdul ‘Uzza, sepupu Khadijah. Beliau dahulunya beragama Nasrani ketika jahiliah. Waraqah pandai menulis dalam bahasa Ibrani, beliau juga mampu menulis Injil dalam bahasa Ibrani dengan baik. Ketika itu, Waraqah sudah pun tua dan matanya buta. Khadijah berkata, “Wahai sepupuku, dengarkanlah cerita anak saudaramu ini.” Waraqah berkata, “Anak saudaraku, apakah yang engkau alami?” Rasulullah menceritakan peristiwa yang dialaminya. Waraqah berkata “Ia adalah Namus (Jibril) yang pernah diutus oleh Allah kepada Musa. Aduhai, kalaulah saya masih muda dan saya masih hidup ketika engkau diusir oleh kaummu nanti.” Rasulullah bertanya, “Adakah saya akan diusir oleh mereka?” Waraqah menjawab “Ya. Tiada seorang pun yang datang membawa wahyu seperti yang engkau bawa ini, melainkan dia pasti akan dimusuhi. Seandainya saya masih ada saat peristiwa itu, pasti saya akan menolong kamu dengan sepenuh kemampuan saya.”\n\nTidak lama kemudian, Waraqah pun meninggal ketika fatrah.",
			"ar": "-حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ: حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ أُمِّ المُؤْمِنِينَ أَنَّهَا قَالَتْ: أَوَّلُ مَا بُدِئَ بِهِ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِنَ الوَحْيِ الرُّؤْيَا الصَّالِحَةُ فِي النَّوْمِ، فَكَانَ لاَ يَرَى رُؤْيَا إِلَّا جَاءَتْ مِثْلَ فَلَقِ الصُّبْحِ، ثُمَّ حُبِّبَ إِلَيْهِ الخَلاَءُ، وَكَانَ يَخْلُو بِغَارِ حِرَاءٍ فَيَتَحَنَّثُ فِيهِ - وَهُوَ التَّعَبُّدُ - اللَّيَالِيَ ذَوَاتِ العَدَدِ قَبْلَ أَنْ يَنْزِعَ إِلَى أَهْلِهِ، وَيَتَزَوَّدُ لِذَلِكَ، ثُمَّ يَرْجِعُ إِلَى خَدِيجَةَ فَيَتَزَوَّدُ لِمِثْلِهَا، حَتَّى جَاءَهُ الحَقُّ وَهُوَ فِي غَارِ حِرَاءٍ، فَجَاءَهُ المَلَكُ فَقَالَ: اقْرَأْ، قَالَ: مَا أَنَا بِقَارِئٍ، قَالَ: \"فَأَخَذَنِي فَغَطَّنِي حَتَّى بَلَغَ مِنِّي الجَهْدَ ثُمَّ أَرْسَلَنِي، فَقَالَ: اقْرَأْ، قُلْتُ: مَا أَنَا بِقَارِئٍ، فَأَخَذَنِي فَغَطَّنِي الثَّانِيَةَ حَتَّى بَلَغَ مِنِّي الجَهْدَ ثُمَّ أَرْسَلَنِي، فَقَالَ: اقْرَأْ، فَقُلْتُ: مَا أَنَا بِقَارِئٍ، فَأَخَذَنِي فَغَطَّنِي الثَّالِثَةَ ثُمَّ أَرْسَلَنِي، فَقَالَ:  {اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ. خَلَقَ الإِنْسَانَ مِنْ عَلَقٍ. اقْرَأْ وَرَبُّكَ الأَكْرَمُ} [العلق:5] فَرَجَعَ بِهَا رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَرْجُفُ فُؤَادُهُ، فَدَخَلَ عَلَى خَدِيجَةَ بِنْتِ خُوَيْلِدٍ رَضِيَ اللَّهُ عَنْهَا، فَقَالَ: «زَمِّلُونِي زَمِّلُونِي« فَزَمَّلُوهُ حَتَّى ذَهَبَ عَنْهُ الرَّوْعُ، فَقَالَ لِخَدِيجَةَ وَأَخْبَرَهَا الخَبَرَ: «لَقَدْ خَشِيتُ عَلَى نَفْسِي» فَقَالَتْ خَدِيجَةُ: كَلَّا وَاللَّهِ مَا يُخْزِيكَ اللَّهُ أَبَدًا، إِنَّكَ لَتَصِلُ الرَّحِمَ، وَتَحْمِلُ الكَلَّ، وَتَكْسِبُ المَعْدُومَ، وَتَقْرِي الضَّيْفَ، وَتُعِينُ عَلَى نَوَائِبِ الحَقِّ، فَانْطَلَقَتْ بِهِ خَدِيجَةُ حَتَّى أَتَتْ بِهِ وَرَقَةَ بْنَ نَوْفَلِ بْنِ أَسَدِ بْنِ عَبْدِ العُزَّى ابْنَ عَمِّ خَدِيجَةَ وَكَانَ امْرَأً تَنَصَّرَ فِي الجَاهِلِيَّةِ، وَكَانَ يَكْتُبُ الكِتَابَ العِبْرَانِيَّ، فَيَكْتُبُ مِنَ الإِنْجِيلِ بِالعِبْرَانِيَّةِ مَا شَاءَ اللَّهُ أَنْ يَكْتُبَ، وَكَانَ شَيْخًا كَبِيرًا قَدْ عَمِيَ، فَقَالَتْ لَهُ خَدِيجَةُ: يَا ابْنَ عَمِّ، اسْمَعْ مِنَ ابْنِ أَخِيكَ، فَقَالَ لَهُ وَرَقَةُ: يَا ابْنَ أَخِي مَاذَا تَرَى؟ فَأَخْبَرَهُ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ خَبَرَ مَا رَأَى، فَقَالَ لَهُ وَرَقَةُ: هَذَا النَّامُوسُ الَّذِي نَزَّلَ اللَّهُ عَلَى مُوسَى، يَا لَيْتَنِي فِيهَا جَذَعًا، لَيْتَنِي أَكُونُ حَيًّا إِذْ يُخْرِجُكَ قَوْمُكَ، فَقَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: « أَوَ مُخْرِجِيَّ هُمْ »، قَالَ: نَعَمْ، لَمْ يَأْتِ رَجُلٌ قَطُّ بِمِثْلِ مَا جِئْتَ بِهِ إِلَّا عُودِيَ، وَإِنْ يُدْرِكْنِي يَوْمُكَ أَنْصُرْكَ نَصْرًا مُؤَزَّرًا. ثُمَّ لَمْ يَنْشَبْ وَرَقَةُ أَنْ تُوُفِّيَ، وَفَتَرَ الوَحْيُ"
		},
		"chapter_id": "1cfedcd5-2108-4557-9661-90f8602435de",
		"chapter_name": "first_chapter",
		"title": {
			"en": "How was the Divine Revelation initially revealed to AlLāh’s Messenger (peace and blessings be upon him) ",
			"ms": "Bagaimana Permulaan Datangnya Wahyu Kepada Rasulullah SAW",
			"ar": "باب كَيْفَ كَانَ بَدْءُ الْوَحْىِ إِلَى رسول الله"
		},
		"category_id": "7bae1d78-1524-4633-b12a-c713e6bcfd15",
		"category_name": "",
		"category_title": {
			"en": "Book of the Beginning of Revelation ",
			"ms": "Kitab Permulaan Wahyu",
			"ar": "كتاب بدء الوحى"
		},
		"book_name": "sahih_bukhari",
		"book_title": "Sahih Bukhari",
		"book_id": "ad6a2cc8-f34b-476b-9b7e-6756a3b7d43e"
	},
	{
		"id": "8b3d979a-0b6a-4aad-8b5b-6f05214fc9f2",
		"name": "",
		"content": {
			"en": "Jābir bin ‘Abdillāh al-Anṣārī – may AlLāh be pleased with them both – said while talking about the period of pause in Revelation, that AlLāh’s Messenger said:\n“I was walking when suddenly I heard a voice from the sky. I looked up and saw the same angel who had visited me at the cave of Ḥirā’ sitting on a chair between the sky and the earth. I became afraid of him and rushed home and said, “Wrap me (in blankets)!” Then AlLāh revealed the following Verses: {O you who is wrapped up in blankets (i.e. Muḥammad)! Arise and warn (the people about AlLāh’s Punishment)!} up to the Verse {and abandon the idols.}. After this, the revelation started coming frequently and regularly.”\n[Aṭrāfuhu fī: ḥadīth no: 3238, 4922, 4923, 4924, 4925, 4926, 4954 and 6214]",
			"ms": "4 – Ibn Syihab berkata, Abu Salamah bin ‘Abdul Rahman juga mengkhabarkan kepada saya bahawa Jabir bin ‘Abdullah al-Anshari berkata ketika beliau sedang bercerita tentang tempoh terputusnya wahyu. Rasulullah  bersabda, “Ketika saya sedang berjalan, tiba-tiba saya terdengar suara daripada langit. Lalu saya mendongak ke arah suara itu, rupa-rupanya ia adalah Jibril yang pernah datang kepada saya di Gua Hira’ dahulu, beliau sedang duduk di atas kerusi yang berada di antara langit dan bumi. Saya pun jadi ketakutan dan segera pulang lalu saya meminta, “Selimutilah saya! Selimutilah saya!” Allah  pun menurunkan ayat “Wahai orang yang berselimut! Bangunlah dan berilah peringatan. Dan hanya kepada Tuhanmu, agungkan dan besarkanlah Dia! Dan pakaianmu, hendaklah engkau bersihkannya. Dan segala kejahatan, hendaklah engkau jauhi.”  Sejak waktu itu, wahyu terus menerus turun.”\n\nHadits ini juga diriwayatkan oleh ‘Abdullah bin Yusuf dan Abu Shalih. Ia juga diriwayatkan dalam jalur yang lain oleh Hilal bin Raddad daripada al-Zuhri. Menurut Yunus dan Ma‘mar, mereka menyebutkan بَوَادِرُهُ di tempat perkataan فُؤَادُهُ.",
			"ar": "قَالَ ابْنُ شِهَابٍ: وَأَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ الأَنْصَارِيَّ، قَالَ: \"وَهُوَ يُحَدِّثُ عَنْ فَتْرَةِ الوَحْيِ فَقَالَ فِي حَدِيثِهِ\": بَيْنَا أَنَا أَمْشِي إِذْ سَمِعْتُ صَوْتًا مِنَ السَّمَاءِ، فَرَفَعْتُ بَصَرِي، فَإِذَا المَلَكُ الَّذِي جَاءَنِي بِحِرَاءٍ جَالِسٌ عَلَى كُرْسِيٍّ بَيْنَ السَّمَاءِ وَالأَرْضِ، فَرُعِبْتُ مِنْهُ، فَرَجَعْتُ فَقُلْتُ: \"زَمِّلُونِي\" فَأَنْزَلَ اللَّهُ تَعَالَى {يَا أَيُّهَا المُدَّثِّرُ. قُمْ فَأَنْذِرْ} [المدثر: 2] إِلَى -[8]- قَوْلِهِ {وَالرُّجْزَ فَاهْجُرْ} [المدثر: 5]. فَحَمِيَ الوَحْيُ وَتَتَابَعَ تَابَعَهُ عَبْدُ اللَّهِ بْنُ يُوسُفَ، وَأَبُو صَالِحٍ، وَتَابَعَهُ هِلاَلُ بْنُ رَدَّادٍ، عَنِ الزُّهْرِيِّ، وَقَالَ يُونُسُ، وَمَعْمَرٌ بَوَادِرُهُ"
		},
		"chapter_id": "1cfedcd5-2108-4557-9661-90f8602435de",
		"chapter_name": "first_chapter",
		"title": {
			"en": "How was the Divine Revelation initially revealed to AlLāh’s Messenger (peace and blessings be upon him) ",
			"ms": "Bagaimana Permulaan Datangnya Wahyu Kepada Rasulullah SAW",
			"ar": "باب كَيْفَ كَانَ بَدْءُ الْوَحْىِ إِلَى رسول الله"
		},
		"category_id": "7bae1d78-1524-4633-b12a-c713e6bcfd15",
		"category_name": "",
		"category_title": {
			"en": "Book of the Beginning of Revelation ",
			"ms": "Kitab Permulaan Wahyu",
			"ar": "كتاب بدء الوحى"
		},
		"book_name": "sahih_bukhari",
		"book_title": "Sahih Bukhari",
		"book_id": "ad6a2cc8-f34b-476b-9b7e-6756a3b7d43e"
	},
	{
		"id": "ec89e8da-cfcb-4f5c-8236-44c710ce220f",
		"name": "",
		"content": {
			"en": "Sa‘īd ibn Jubayr narrated from Ibn ‘Abbās – may AlLāh be pleased with them both – regarding the Verse: {Move not your tongue (O Muhammad) to make haste with recitation of the Qur’ān.}, he said: “AlLāh’s Messenger used to bear the Revelation with great trouble and used to move his lips (heavily) with the Revelation.” Ibn ‘Abbās then moved his lips while saying, “I am moving my lips in front of you as how AlLāh’s Messenger used to move his.” Then, Sa‘īd moved his lips while saying: “I am moving my lips, as how I saw Ibn ‘Abbās moved his.” So, AlLāh revealed: {Move not your tongue (O Muhammad) to make haste with recitation of the Qur’ān. Indeed, upon Us is its collection (in your heart) and (to make possible) it’s recitation}. Ibn ‘Abbās said, “(Meaning): That AlLāh will compile the Qur’ān for you (O Muhammad) in your heart and (make it possible) for you to recite it.” {And when We have recited it (through Jibrīl (Gabriel), then you follow its recitation}. Ibn ‘Abbās said, “(Meaning): Listen to it and be silent.” {Then upon Us is its clarification (to you)}. Ibn ‘Abbās said, “(Meaning): Then it is upon Us (i.e. AlLāh) to make you recite it (and its meaning will be revealed).” Afterwards, AlLāh’s Messenger would listen intently to Jibrīl (Gabriel) whenever he came, and after Jibrīl’s (Gabriel’s) departure he would recite it as how Jibrīl (Gabriel) had recited it.”\n[Aṭrāfuhu fī: ḥadīth no: 4927, 4928, 4929, 5044 and 7524]\n",
			"ms": "5 – Musa bin Isma‘il menyampaikan kepada kami, katanya Abu ‘Awanah menyampaikan kepada kami, daripada Musa bin Abu ‘A’isyah, daripada Sa‘id bin Jubayr, daripada Ibn ‘Abbas berkenaan firman Allah ,  “Janganlah engkau (wahai Muhammad) tergesa menggerakkan lidahmu kerana hendak segera menghafalnya (al-Quran yang diturunkan kepadamu).” Ibn ‘Abbas memberitahu bahawa Rasulullah  mengalami kesukaran ketika menerima Al-Quran. Baginda seringkali menggerak-gerakkan kedua bibirnya. Lalu Ibn ‘Abbas berkata, “Saya menggerakkan kedua bibir saya (untuk membacakannya) kepadamu sebagaimana Rasulullah  menggerakkan kedua bibirnya.” Sa‘id berkata, “Saya menggerakkan kedua bibir saya sebagaimana saya melihat Ibn ‘Abbas melakukannya.”\n\nKetika Nabi  menggerakkan kedua bibirnya, turunlah firman Allah , “Janganlah engkau (wahai Muhammad) tergesa menggerakkan lidahmu kerana hendak segera menghafalnya (al-Quran yang diturunkan kepadamu). Sesungguhnya Kami-lah yang menjamin akan mengumpulkannya dan membacakannya.” Maksudnya, Allah mengumpulkannya di dalam dadamu dan kemudian engkau mampu membacanya. “Oleh itu, apabila Kami telah selesaikan bacaannya (kepadamu), ikutilah bacaannya itu.” Maksudnya, “Dengarkan baik-baik dan diamlah.” “Kemudian, sesungguhnya tanggungjawab Kami-lah untuk menjelaskan isi kandungannya itu.” Maksudnya, “kewajipan Kami untuk membacakannya.” Sejak saat itu, jika Jibril datang kepada Rasulullah , baginda mendengarkannya dahulu. Setelah Jibril beransur, barulah baginda membacanya sebagAimana Jibril membaca kepada baginda tadi.",
			"ar": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ: حَدَّثَنَا أَبُو عَوَانَةَ، قَالَ: حَدَّثَنَا مُوسَى بْنُ أَبِي عَائِشَةَ، قَالَ: حَدَّثَنَا سَعِيدُ بْنُ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ فِي قَوْلِهِ تَعَالَى: {لاَ تُحَرِّكْ بِهِ لِسَانَكَ لِتَعْجَلَ بِهِ} [القيامة: 16] قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُعَالِجُ مِنَ التَّنْزِيلِ شِدَّةً، وَكَانَ مِمَّا يُحَرِّكُ شَفَتَيْهِ - فَقَالَ ابْنُ عَبَّاسٍ: فَأَنَا أُحَرِّكُهُمَا لَكُمْ كَمَا كَانَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُحَرِّكُهُمَا، وَقَالَ سَعِيدٌ: أَنَا أُحَرِّكُهُمَا كَمَا رَأَيْتُ ابْنَ عَبَّاسٍ يُحَرِّكُهُمَا، فَحَرَّكَ شَفَتَيْهِ - فَأَنْزَلَ اللَّهُ تَعَالَى :{لاَ تُحَرِّكْ بِهِ لِسَانَكَ لِتَعْجَلَ بِهِ إِنَّ عَلَيْنَا جَمْعَهُ وَقُرْآنَهُ} [القيامة: 17] قَالَ: جَمْعُهُ لَهُ فِي صَدْرِكَ وَتَقْرَأَهُ: {فَإِذَا قَرَأْنَاهُ فَاتَّبِعْ قُرْآنَهُ} [القيامة: 18] قَالَ: فَاسْتَمِعْ لَهُ وَأَنْصِتْ: {ثُمَّ إِنَّ عَلَيْنَا بَيَانَهُ} [القيامة: 19] ثُمَّ إِنَّ عَلَيْنَا أَنْ تَقْرَأَهُ، فَكَانَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بَعْدَ ذَلِكَ إِذَا أَتَاهُ جِبْرِيلُ اسْتَمَعَ فَإِذَا انْطَلَقَ جِبْرِيلُ قَرَأَهُ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَمَا قَرَأَهُ"
		},
		"chapter_id": "1cfedcd5-2108-4557-9661-90f8602435de",
		"chapter_name": "first_chapter",
		"title": {
			"en": "How was the Divine Revelation initially revealed to AlLāh’s Messenger (peace and blessings be upon him) ",
			"ms": "Bagaimana Permulaan Datangnya Wahyu Kepada Rasulullah SAW",
			"ar": "باب كَيْفَ كَانَ بَدْءُ الْوَحْىِ إِلَى رسول الله"
		},
		"category_id": "7bae1d78-1524-4633-b12a-c713e6bcfd15",
		"category_name": "",
		"category_title": {
			"en": "Book of the Beginning of Revelation ",
			"ms": "Kitab Permulaan Wahyu",
			"ar": "كتاب بدء الوحى"
		},
		"book_name": "sahih_bukhari",
		"book_title": "Sahih Bukhari",
		"book_id": "ad6a2cc8-f34b-476b-9b7e-6756a3b7d43e"
	},
	{
		"id": "13cfe4be-2b79-4484-a906-9b9b8dc71c7d",
		"name": "",
		"content": {
			"en": "Ibn ‘Abbās – may AlLāh be pleased with him – said: “AlLāh’s Messenger is the most generous of men, and he used to reach the peak in generosity during Ramaḍān when Jibrīl (Gabriel) met him. Jibrīl (Gabriel) used to meet him every night of Ramaḍān to teach him the Qur’ān. AlLāh’s Messenger is the most generous person, even more generous than the rain-bearing wind.”\n[Aṭrāfuhu fī: ḥadīth no: 1902, 3220, 3554, and 4997]",
			"ms": "6 – ‘Abdan menyampaikan kepada kami, katanya ‘Abdullah mengkhabarkan kepada kami, katanya Yunus mengkhabarkan kepada kami, daripada al-Zuhri; dalam sanad yang lain, Bisyir bin Muhammad menyampaikan kepada kami, katanya ‘Abdullah mengkhabarkan kepada kami, katanya Yunus dan Ma‘mar mengkhabarkan kepada kami, daripada al-Zuhri, hadis yang semakna dengan hadis yang sebelumnya. Katanya ‘Ubaydullah bin ‘Abdullah mengkhabarkan kepadaku daripada Ibn ‘Abbas, beliau berkata “Rasulullah merupakan orang yang paling pemurah, lebih-lebih lagi pada bulan Ramadan ketika Jibril menemuinya. Jibril akan menemui baginda dan mengajarkannya Al-Quran pada setiap malam. Sungguh, Rasulullah  lebih pemurah daripada angin yang bertiup.",
			"ar": "حَدَّثَنَا عَبْدَانُ، قَالَ: أَخْبَرَنَا عَبْدُ اللَّهِ قَالَ: أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، ح وحَدَّثَنَا بِشْرُ بْنُ مُحَمَّدٍ، قَالَ: أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ: أَخْبَرَنَا يُونُسُ، وَمَعْمَرٌ، عَنِ الزُّهْرِيِّ، نَحْوَهُ قَالَ: أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ: «كَانَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَجْوَدَ النَّاسِ، وَكَانَ أَجْوَدُ مَا يَكُونُ فِي رَمَضَانَ حِينَ يَلْقَاهُ جِبْرِيلُ، وَكَانَ يَلْقَاهُ فِي كُلِّ لَيْلَةٍ مِنْ رَمَضَانَ فَيُدَارِسُهُ القُرْآنَ، فَلَرَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَجْوَدُ بِالخَيْرِ مِنَ الرِّيحِ المُرْسَلَةِ«"
		},
		"chapter_id": "1cfedcd5-2108-4557-9661-90f8602435de",
		"chapter_name": "first_chapter",
		"title": {
			"en": "How was the Divine Revelation initially revealed to AlLāh’s Messenger (peace and blessings be upon him) ",
			"ms": "Bagaimana Permulaan Datangnya Wahyu Kepada Rasulullah SAW",
			"ar": "باب كَيْفَ كَانَ بَدْءُ الْوَحْىِ إِلَى رسول الله"
		},
		"category_id": "7bae1d78-1524-4633-b12a-c713e6bcfd15",
		"category_name": "",
		"category_title": {
			"en": "Book of the Beginning of Revelation ",
			"ms": "Kitab Permulaan Wahyu",
			"ar": "كتاب بدء الوحى"
		},
		"book_name": "sahih_bukhari",
		"book_title": "Sahih Bukhari",
		"book_id": "ad6a2cc8-f34b-476b-9b7e-6756a3b7d43e"
	},
	{
		"id": "dc9e93b0-d914-43b6-957c-6b01b044eeb2",
		"name": "",
		"content": {
			"en": "‘UbaydulLāh bin ‘Abdillāh bin ‘Utbah bin Mas‘ūd narrated that Ibn ‘Abbās – may AlLāh be pleased with both of them – informed him, that Abū Sufyān bin Ḥarb – may AlLāh be pleased with him – informed him, that Heraclius had sent a messenger to him (Abū Sufyān) while he had been accompanying a caravan from Quraysh – they were merchants doing business in the Levant (present-day Syria, Palestine, Lebanon and Jordan) – at the time when AlLāh’s Messenger had a truce with Abū Sufyān and the Quraysh infidels. So, they went to Heraclius at Īliyā’ (Jerusalem). Heraclius called them into his court while the senior Roman (i.e. Byzantine) dignitaries were around him. Then, he called them (to him) and called for his translator and then said to them (through his translator), “Who amongst you is the closest in blood relation to the man who claims to be a Prophet?” Abū Sufyān said: I replied, “I am the closest to him in blood relation (amongst the group).”\nHeraclius said, “Bring him (Abū Sufyān) close to me and make his companions stand behind him.” Then, Heraclius said to his translator, “Tell them (i.e Abū Sufyān’s companions) that I want to ask him regarding that man (i.e Muḥammad) and that if he tells a lie, they should contradict him.” Abū Sufyān added, “By AlLāh! Had I not been afraid that my companions would label me a liar, I would have lied about him (the Prophet).\nThe first question he asked me about him was: “How noble is his lineage amongst you?”\nI replied, “He is of noble ancestry amongst us.”\nHeraclius asked, “Has anybody amongst you ever claimed the same (i.e. to be a Prophet) before him?”\nI replied, “No.”\nHe said, “Was anyone amongst his ancestors a king?”\nI replied, “No.”\nHeraclius asked, “Do the nobles or the weak follow him?”\nI replied, “It is the weak who follow him.”\nHe asked, “Are his followers increasing or decreasing?”\nI replied, “They are increasing.”\nHe asked, “Does anyone who embraced his religion renounce it afterwards due to displeasure?”\nI replied, “No.”\nHeraclius said, “Have you ever accused him of telling lies before his claim (to be a Prophet)?”\nI replied, “No.”\nHeraclius said, “Has he ever broken his promises?”\nI replied, “No. We are in a truce with him but we do not know what he will do in it.” I could not find any opportunity to say anything against him except that.\nHeraclius asked, “Have you ever waged war against him?”\nI replied, “Yes.”\nThen he said, “What was the outcome of the battles?”\nI replied, “Sometimes he was victorious and sometimes we were victorious.”\nHeraclius said, “What does he command you to do?”\nI replied, “He tells us to worship AlLāh alone and not to associate anything with Him in worship, and to renounce what our ancestors had said, and he orders us to pray, to speak the truth, to be chaste, and to keep good relations with our kith and kin.”\nHeraclius said to his translator, “Tell him (Abū Sufyān) the following: I asked you about his ancestry and your reply was that he is of noble lineage. That is how all the Messengers were; they come from noble families amongst their respective peoples. I questioned you whether anybody else amongst you had ever claimed such a thing, you said no. If the answer had been in the affirmative, I would have said that this man was merely following the previous man’s statement. Then I asked you whether any of his ancestors was a king. You said no, and if it had been in the affirmative, I would have said that this man only sought the kingship of his ancestors.\nI asked you whether he was ever accused of telling lies before he said what he said (regarding his Prophethood), and you said no. And I know that a person who does not tell lies about others could never lie about AlLāh. And I asked you whether the noblemen followed him or the weak. You replied that it was the weak who followed him. This class of people has always been the followers of all Messengers. Then I asked you whether his followers were increasing or decreasing. You replied that they were increasing, and in fact this is the way of true faith, until it is complete in all aspects. And I asked you whether there was anyone, who became displeased and discarded his religion after embracing it. You said no, and this shows true faith when its delight has blended into the hearts. I asked you whether he had ever betrayed. You replied no, and indeed the Messengers would never betray. Then I asked you what he commanded you to do. You replied that he ordered you to worship AlLāh alone and not to associate anything with Him in worship, and forbade you from worshipping idols, and commanded you to pray, to speak the truth and to be chaste. If what you have said is true, very soon he will occupy this place underneath my feet. I knew it (from the Holy Scriptures) that he was going to appear but I did not know that he would be from your people, and if I could reach him, I would go immediately to meet him and if I were with him, I would certainly wash his feet (as a sign of respect).”\nHeraclius then asked for the letter addressed by AlLāh’s Messenger which was delivered by Diḥyah to the Governor of Buṣrā, who sent it to Heraclius to read. The contents of the letter were as follows: “In the name of AlLāh the Beneficent, the Merciful. (This letter is) from Muḥammad the slave of AlLāh and His Messenger to Heraclius the emperor of Byzantine. Peace be upon him who follows the Guidance. To proceed, I invite you to Islam. If you become a Muslim you will be safe, and AlLāh will double your reward, and if you reject this invitation of Islam the burden of the sins of your subjects will be upon you and, {O People of the Scripture! Come to a word common to you and us – that we worship none but AlLāh and do not associate anything in worship with Him, and not take one another as lords beside AlLāh. But if they turn away, then say: Bear witness that we are Muslims (submitting to AlLāh)}.”\nAbū Sufyān added, “When Heraclius had finished his speech and read the letter, there was pandemonium in the Royal Court and voices were raised. We were ejected out of the Court. I said to my companions: “The matter of Ibn Abī Kabshah (i.e. Prophet Muḥammad) has become so prominent that even the Emperor of the Fair Skinned (i.e Byzantine) is afraid of him.” Then I started to become convinced that he (the Prophet) would be the conqueror until AlLāh guided me to Islam.”\n(Ibn ‘Abbās said): Ibn an-Nāẓūr was the Governor of Īliyā’ (Jerusalem) and Heraclius was the head of the Christians of the Levant. Ibn an-Nāẓūr narrates that there was a time when Heraclius visited Īliyā’ and he got up in the morning feeling disturbed. Some of his priests asked him: Why do you look disturbed? Heraclius was a foreteller who practised astrology. He replied to them, “During night-time when I gazed at the stars, I saw that the leader of those who practice circumcision had appeared (to become the conqueror). Who amongst the people today practice circumcision?” The priests replied, “Nobody other than the Jews, and you need not be afraid of them (Jews). Just issue orders to kill every Jew present in your empire.”\nWhile they were discussing it, a messenger who was sent by the king of the Ghassanids to Heraclius to convey the news of AlLāh’s Messenger was brought in. Upon hearing the news, Heraclius ordered some people to go and see if the messenger of Ghassān was circumcised. After seeing him, the people told Heraclius that he (i.e. the messenger) was circumcised. Heraclius then asked him about the Arabs. The messenger replied, “Arabs also practice circumcision.”\n(Upon hearing that) Heraclius remarked, “The sovereign of the people has appeared.” Heraclius then wrote a letter to his friend in Rome who was as knowledgeable as Heraclius and left for Homs (a city in present-day Syria) and stayed there until he received the reply of his letter from his friend who agreed with him in his opinion regarding the emergence of the Prophet and the fact that he is a Prophet. Then, Heraclius invited all the Byzantine nobility to assemble in his palace at Homs. When they had assembled, he ordered that the doors of his palace be closed. Then he came out and said, “O Byzantines! If you desire success and guidance, and want your empire to remain then give your pledge of allegiance to this Prophet (i.e. embrace Islam).”\n(Upon hearing the speech of Heraclius), those noblemen ran away in disgust like wild donkeys towards the gates of the palace but found them to be closed. When Heraclius saw their hatred of Islam and had lost hope that they will embrace Islam, he ordered, “Bring them back to me!”\n(When they returned), he said, “What I said previously was just to test the strength of your conviction upon your religion (i.e. Christianity) and I have seen it.” Those noblemen then prostrated before him and became pleased with him, and that was the end of Heraclius’s story (regarding his faith).\n[Aṭrāfuhu fī: ḥadīth no: 51, 2681, 2804, 2941, 2978, 3174, 4553, 5680, 6260, 7196, and 7541]",
			"ms": "Abu al-Yaman al-Hakam bin Nafi‘ menyampaikan kepada kami, katanya Syu’ayb mengkhabarkan kepada kami, daripada al-Zuhri, katanya ‘Ubaydullah bin ‘Abdullah bin ‘Utbah bin Mas‘ud mengkhabarkan kepada saya, bahawa ‘Abdullah bin ‘Abbas pernah mengkhabarkan kepadanya, bahawa Abu Sufyan bin Harb pernah mengkhabarkan kepada Ibn ‘Abbas bahawa Heraklius pernah menjemput rombongan dagangan Quraisy yang sedang mengadakan ekspedisi dagang ke negeri Syam pada waktu berlakunya perjanjian damai di antara Nabi dengan Abu Sufyan dan orang-orang kafir Quraisy. Mereka memenuhi undangan Heraklius di majlisnya ketika singgah di Elia. Ketika itu, pembesar-pembesar Rom ada bersama Heraklius. Heraklius berbicara dengan mereka melalui juru bahasanya, beliau bertanya “Siapakah di antara kamu yang paling dekat hubungan kekeluargaannya dengan orang yang mengaku sebagai Nabi itu?” Abu Sufyan menjawab, “Saya orang yang paling dekat hubungan kekeluargaan dengan dia.” \nHeraklius bertitah, “Suruh dia mendekat kepada saya, dan biarkan rombongannya itu berada di belakang.” Lalu Heraklius bertanya melalui penterjemahnya, “Katakan kepadanya bahawa saya akan bertanya tentang lelaki yang mengaku sebagai Nabi itu. Jika dia berdusta kepada saya, maka kamu harus katakan dia berdusta.” Abu Sufyan berkata, “Demi Allah, kalau bukan kerana takutkan tuduhan pendusta yang akan mereka lontarkan kepada saya, nescaya saya akan berdusta kepadanya.” \nPerkara pertama yang ditanyakan kepadaku tentang Rasulullah  ialah “Bagaimana keturunannya dalam kalangan kamu?” Saya (Abu Sufyan) menjawab, “Dia daripada keturunan yang mulia.” “Adakah ada orang lain sebelumnya yang pernah mendakwa sebegini?” “Tidak ada.” “Adakah di antara nenek moyangnya itu berketurunan raja?” “Tidak ada.” “Adakah orang-orang yang mengikuti dia itu orang-orang yang mulia atau orang-orang yang lemah?” “Hanya orang-orang yang lemah sahaja.” “Adakah pengikutnya bertambah atau berkurang?” “Bertambah.” “Adakah ada orang yang murtad kerana kecewa terhadap agamanya?” “Tidak ada.” “Adakah kamu pernah mendapatinya berdusta sebelum dia menyampaikan apa yang dikatakannya itu?” “Tidak pernah.” “Adakah dia pernah berkhianat?” “Tidak pernah. Ketika kami bergaul dengannya, dia tidak pernah melakukannya.” Abu Sufyan melanjutkan, “Tiada ruang yang saya berpeluang untuk mengata beliau, melainkan ketika ini sahaja.” Heraklius melanjutkan pertanyaan, “Adakah kamu memeranginya?” “Ya.” “Bagaimana cara kamu memeranginya?” “Perang di antara kami sering berlaku. Kadangkala dia mengalahkan kami, kadangkala kami pula yang mengalahkannya.” “Apa yang dia perintahkan kepada kamu?” “Dia memerintahkan kami beribadah kepada Allah dan jangan menyekutukan-Nya dengan apa pun serta tinggalkan apa yang dikatakan oleh nenek moyang. Dia juga memerintahkan kami untuk mendirikan solat, bercakap jujur, saling memaafkan dan menghubungkan tali silaturrahim.” Heraklius berkata kepada penterjemahnya, “Katakan kepadanya bahawa saya telah bertanya kepadamu tentang keturunan orang itu, kamu katakan bahawa orang itu daripada keturunan mulia. Begitu juga para rasul terdahulu, mereka diutus daripada kalangan mulia. Saya juga bertanya kepadamu, adakah ada orang sebelumnya yang mengatakan seperti apa yang dia katakan, kamu menjawab tidak. Seandainya ada, tentu saya akan anggap orang ini meniru orang yang sebelumnya yang pernah mengatakan perkara yang sama. Saya tanyakan juga kepadamu adakah nenek moyangnya ada yang menjadi raja, kamu menjawab tidak. Seandainya ada, tentu orang ini sedang menuntut kerajaan nenek moyangnya. Saya tanyakan juga kepadamu, adakah kamu pernah mendapati dia berdusta, kamu menjawab tidak. Sungguh saya mengetahui, kalau kepada manusia pun dia tidak berani berdusta, apatah lagi berdusta kepada Allah?! Saya juga bertanya tadi kepadamu adakah yang mengikuti dia itu, orang-orang yang mulia atau orang-orang yang lemah? Kamu menjawab orang-orang yang lemah. Memang mereka itulah yang menjadi para pengikut rasul. Saya juga bertanya kepadamu adakah pengikutnya bertambah atau berkurang. Kamu menjawab bertambah. Memang begitulah juga urusan keimanan, sehinggalah ia menjadi sempurna. Saya juga bertanya kepadamu adakah ada yang murtad kerana kecewa terhadap agamanya. Kamu menjawab tidak ada. Memang begitulah urusan iman, apabila ia telah meresap ke dalam sanubari sehingga menembus lubuk hati. Saya juga bertanya kepadamu adakah dia pernah berkhianat. Kamu menjawab tidak pernah. Memang begitulah para rasul, mereka tidak mungkin khianat. Saya juga bertanya kepadamu apakah yang dia perintahkan kepada kamu. Kamu menjawab bahawa dia memerintahkan kamu utntuk beribadah kepada Allah dan tidak menyekutukan-Nya dengan apa pun, dia melarang kamu untuk menyembah berhala, dia juga memerintahkan kamu untuk mendirikan solat, bercakap jujur, saling memaafkan dan menghubungkan tali silaturrahim. Seandainya semua yang kamu katakan ini benar, pasti dia akan menguasai kerajaan yang saya miliki ini. Memang sebenarnya saya yakin dia akan muncul, tapi saya tidak sangka dia akan muncul dalam kalangan kamu. Seandainya memungkinkan untuk saya bertemu dengannya, tentu saya akan berusaha keras menemuinya, hingga apabila saya sudah berada di sisinya, pasti saya akan membasuh kedua kakinya.” Kemudian Heraklius meminta surat Rasulullah yang dibawa oleh Dihyah untuk para penguasa negeri Bosra. Surat itu pun diberikan kepada Heraklius. \nHeraklius pun membaca, di dalamnya tercatat, “Bismillahi al-Rahmani al-Rahim (dengan nama Allah, yang Maha Pengasih lagi Maha Mengasihani). Daripada Muhammad, hamba Allah dan utusan-Nya, untuk Heraklius; penguasa Rom. Sejahteralah bagi orang yang mengikuti petuntuk. Sesungguhnya saya mengajakmu mengikuti ajaran Islam. Peluklahlah agama Islam, nescaya engkau akan selamat. Allah akan memberimu pahala dua kali ganda. Sebaliknya jika engkau berpaling, engkau pasti akan menanggung dosa rakyatmu.\n“Wahai Ahli Kitab, kemarilah menuju kepada satu pegangan yang sama di antara kita, bahawa kita semua tidak beribadah melainkan hanya kepada Allah, dan kita tidak sekutukan-Nya dengan sesuatu pun; kita juga tidak akan saling mengambil sebahagian yang lain untuk dijadikan tuhan-tuhan selain daripadapada Allah. Kemudian jika mereka (Ahli Kitab itu) barpaling (enggan menerimanya), maka katakanlah kepada mereka: \"Bersaksilah, sesungguhnya kami adalah orang-orang Islam.” \nAbu Sufyan berkata, “Setelah Heraklius bersoal jawab dan selesai membaca surat tersebut, keadaan menjadi riuh rendah dan suara membumbung tinggi. Kami pun dibawa keluar. Saya berkata kepada teman-teman saya setelah kami keluar, “Sungguh hebat Ibn Abu Kabsyah (Nabi Muhammad) ini, Raja orang-orang berkulit kuning langsat (Rom) pun takut kepadanya.” Sejak itulah saya yakini bahawa Muhammad akan berjaya sehingga akhirnya Allah memberi saya hidayah untuk masuk Islam.” \nIbn al-Nazhur; pembesar Iliya’ dan Heraklius itu merupakan ketua paderi Kristian di Syam. Dia menceritakan bahawa ketika Heraklius mengunjungi Iliya’, dia kelihatan muram. Salah seorang menterinya bertanya, “Tuanku tidak kelihatan seperti biasa?” Ibn al-Nadzur berkata, “Heraklius adalah seorang ahli nujum yang selalu memerhatikan perjalanan bintang-bintang. Dia menjawab kepada menterinya ketika mereka bertanya kepadanya tadi, “Sungguh, malam tadi ketika memerhati bintang-bintang, saya melihat raja khitan telah muncul. Siapakah di antara umat ini yang dikhatan?” Para menteri itu menjawab, “Yang berkhatan hanyalah orang-orang Yahudi, tapi janganlah engkau risau terhadap orang-orang Yahudi itu. Perintahkan sahaja ke seluruh negeri dalam kerajaanmu supaya orang-orang Yahudi di negeri masing-masing dibunuh.”\nKetika mereka sedang berbual, seorang utusan Raja Ghassan yang dapat menceritakan tentang Rasulullah  dibawa menghadap kepada Heraklius. Setelah Heraklius mendengar cerita utusan itu (lalu dia pun beredar), Heraklius memerintahkan agar dia diperiksa; adakah dia dikhatan atau tidak. Setelah diperiksa, ternyata dia dikhatan. Lalu Heraklius bertanya kepada utusan itu tentang orang-orang arab, “Adakah mereka dikhatan atau tidak?” Dia menjawab, “Semua orang arab dikhatan.” Heraklius berkata, “Dialah raja umat ini. Sungguh dia telah lahir.” Kemudian Heraklius mengirim surat kepada sahabatnya di Rom yang ilmunya setara dengannya. Sementara itu, Heraklius memulakan perjalanannya ke Homs. Belum sempat tiba di Homs, balasan surat daripada sahabatnya itu telah pun tiba terlebih dahulu. Sahabatnya itu bersetuju dengan pendapat Heraklius bahawa Muhammad telah lahir dan bahawa beliau adalah seorang nabi. Lalu Heraklius mengundang para pembesar Rom supaya datang ke tempatnya di Homs. (Setelah semua hadir di majlisnya), Heraklius memerintahkan supaya semua pintu dikunci. Kemudian dia berkata, “Wahai bangsa Rom, adakah kamu mahu mendapatkan kemenangan dan petunjuk, serta kerajaan yang tetap utuh nan kukuh di tangan kita? Kalau mahu, baiatlah kepada Nabi ini!” Mendengarkan ucapan itu, mereka lari bagaikan keldai liar menuju ke pintu. Namun, mereka dapati semua pintu telah terkunci. Melihat keadaan begitu, Heraklius menjadi putus harapan atas keimanan mereka (terhadap kenabian Muhammad). Lantas Heraklius menyuruh mereka kembali menghadapnya dan berkata, “Sungguh, saya berkata demikian hanyalah untuk menguji keteguhan hati kamu atas agama kamu. Kini saya telah melihat keteguhan itu.” Lalu mereka sujud di hadapan Heraklius dan kembali puas hati kepadanya. Demikianlah akhir kisah Heraklius. \nShalih bin Kaysan telah meriwayatkan hadis ini. Demikian juga Yunus dan Ma‘mar daripadapada al-Zuhri.",
			"ar": "حَدَّثَنَا أَبُو اليَمَانِ الحَكَمُ بْنُ نَافِعٍ قَالَ: أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ قَالَ: أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، أَخْبَرَهُ أَنَّ أَبَا سُفْيَانَ بْنَ حَرْبٍ أَخْبَرَهُ: أَنَّ هِرَقْلَ أَرْسَلَ إِلَيْهِ فِي رَكْبٍ مِنْ قُرَيْشٍ، وَكَانُوا تُجَّارًا بِالشَّأْمِ فِي المُدَّةِ الَّتِي كَانَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مَادَّ فِيهَا أَبَا سُفْيَانَ وَكُفَّارَ قُرَيْشٍ، فَأَتَوْهُ وَهُمْ بِإِيلِيَاءَ، فَدَعَاهُمْ فِي مَجْلِسِهِ، وَحَوْلَهُ عُظَمَاءُ الرُّومِ، ثُمَّ دَعَاهُمْ وَدَعَا بِتَرْجُمَانِهِ، فَقَالَ: أَيُّكُمْ أَقْرَبُ نَسَبًا بِهَذَا الرَّجُلِ الَّذِي يَزْعُمُ أَنَّهُ نَبِيٌّ؟ فَقَالَ أَبُو سُفْيَانَ: فَقُلْتُ أَنَا أَقْرَبُهُمْ نَسَبًا، فَقَالَ: أَدْنُوهُ مِنِّي، وَقَرِّبُوا أَصْحَابَهُ فَاجْعَلُوهُمْ عِنْدَ ظَهْرِهِ، ثُمَّ قَالَ لِتَرْجُمَانِهِ: قُلْ لَهُمْ إِنِّي سَائِلٌ هَذَا عَنْ هَذَا الرَّجُلِ، فَإِنْ كَذَبَنِي فَكَذِّبُوهُ. فَوَاللَّهِ لَوْلاَ الحَيَاءُ مِنْ أَنْ يَأْثِرُوا عَلَيَّ كَذِبًا لَكَذَبْتُ عَنْهُ. ثُمَّ كَانَ أَوَّلَ مَا سَأَلَنِي عَنْهُ أَنْ قَالَ: كَيْفَ نَسَبُهُ فِيكُمْ؟ قُلْتُ: هُوَ فِينَا ذُو نَسَبٍ، قَالَ: فَهَلْ قَالَ هَذَا القَوْلَ مِنْكُمْ أَحَدٌ قَطُّ قَبْلَهُ؟ قُلْتُ: لاَ. قَالَ: فَهَلْ كَانَ مِنْ آبَائِهِ مِنْ مَلِكٍ؟ قُلْتُ: لاَ قَالَ: فَأَشْرَافُ النَّاسِ يَتَّبِعُونَهُ أَمْ ضُعَفَاؤُهُمْ؟ فَقُلْتُ بَلْ ضُعَفَاؤُهُمْ. قَالَ: أَيَزِيدُونَ أَمْ يَنْقُصُونَ؟ قُلْتُ: بَلْ يَزِيدُونَ. قَالَ: فَهَلْ يَرْتَدُّ أَحَدٌ مِنْهُمْ سَخْطَةً لِدِينِهِ بَعْدَ أَنْ يَدْخُلَ فِيهِ؟ قُلْتُ: لاَ. قَالَ: فَهَلْ كُنْتُمْ تَتَّهِمُونَهُ بِالكَذِبِ قَبْلَ أَنْ يَقُولَ مَا قَالَ؟ قُلْتُ: لاَ. قَالَ: فَهَلْ يَغْدِرُ؟ قُلْتُ: لاَ، وَنَحْنُ مِنْهُ فِي مُدَّةٍ لاَ نَدْرِي مَا هُوَ فَاعِلٌ فِيهَا، قَالَ: وَلَمْ تُمْكِنِّي كَلِمَةٌ أُدْخِلُ فِيهَا شَيْئًا غَيْرُ هَذِهِ الكَلِمَةِ، قَالَ: فَهَلْ قَاتَلْتُمُوهُ؟ قُلْتُ: نَعَمْ. قَالَ: فَكَيْفَ كَانَ قِتَالُكُمْ إِيَّاهُ؟ قُلْتُ: الحَرْبُ بَيْنَنَا وَبَيْنَهُ سِجَالٌ، يَنَالُ مِنَّا وَنَنَالُ مِنْهُ. قَالَ: مَاذَا يَأْمُرُكُمْ؟ قُلْتُ: يَقُولُ: اعْبُدُوا اللَّهَ وَحْدَهُ وَلاَ تُشْرِكُوا بِهِ شَيْئًا، وَاتْرُكُوا مَا يَقُولُ آبَاؤُكُمْ، وَيَأْمُرُنَا بِالصَّلاَةِ وَالصِّدْقِ وَالعَفَافِ وَالصِّلَةِ. فَقَالَ لِلتَّرْجُمَانِ: قُلْ لَهُ: سَأَلْتُكَ عَنْ نَسَبِهِ فَذَكَرْتَ أَنَّهُ فِيكُمْ ذُو نَسَبٍ، فَكَذَلِكَ الرُّسُلُ تُبْعَثُ فِي نَسَبِ قَوْمِهَا. وَسَأَلْتُكَ هَلْ قَالَ أَحَدٌ مِنْكُمْ هَذَا القَوْلَ، فَذَكَرْتَ أَنْ لاَ، فَقُلْتُ: لَوْ كَانَ أَحَدٌ قَالَ هَذَا القَوْلَ قَبْلَهُ، لَقُلْتُ رَجُلٌ يَأْتَسِي بِقَوْلٍ قِيلَ قَبْلَهُ. وَسَأَلْتُكَ هَلْ كَانَ مِنْ آبَائِهِ مِنْ مَلِكٍ، فَذَكَرْتَ أَنْ لاَ، قُلْتُ فَلَوْ كَانَ مِنْ آبَائِهِ مِنْ مَلِكٍ، قُلْتُ رَجُلٌ يَطْلُبُ مُلْكَ أَبِيهِ، وَسَأَلْتُكَ، هَلْ كُنْتُمْ تَتَّهِمُونَهُ بِالكَذِبِ قَبْلَ أَنْ يَقُولَ مَا قَالَ، فَذَكَرْتَ أَنْ لاَ، فَقَدْ أَعْرِفُ أَنَّهُ لَمْ يَكُنْ لِيَذَرَ الكَذِبَ عَلَى النَّاسِ وَيَكْذِبَ عَلَى اللَّهِ. وَسَأَلْتُكَ أَشْرَافُ النَّاسِ اتَّبَعُوهُ أَمْ ضُعَفَاؤُهُمْ، فَذَكَرْتَ أَنَّ ضُعَفَاءَهُمُ اتَّبَعُوهُ، وَهُمْ أَتْبَاعُ الرُّسُلِ. وَسَأَلْتُكَ أَيَزِيدُونَ أَمْ يَنْقُصُونَ، فَذَكَرْتَ أَنَّهُمْ يَزِيدُونَ، وَكَذَلِكَ أَمْرُ الإِيمَانِ حَتَّى يَتِمَّ. وَسَأَلْتُكَ أَيَرْتَدُّ أَحَدٌ سَخْطَةً لِدِينِهِ بَعْدَ أَنْ يَدْخُلَ فِيهِ، فَذَكَرْتَ أَنْ لاَ، وَكَذَلِكَ الإِيمَانُ حِينَ تُخَالِطُ بَشَاشَتُهُ القُلُوبَ. وَسَأَلْتُكَ هَلْ يَغْدِرُ، فَذَكَرْتَ أَنْ لاَ، وَكَذَلِكَ الرُّسُلُ لاَ تَغْدِرُ. وَسَأَلْتُكَ بِمَا يَأْمُرُكُمْ، فَذَكَرْتَ أَنَّهُ يَأْمُرُكُمْ أَنْ تَعْبُدُوا اللَّهَ وَلاَ تُشْرِكُوا بِهِ شَيْئًا، وَيَنْهَاكُمْ عَنْ عِبَادَةِ الأَوْثَانِ، وَيَأْمُرُكُمْ بِالصَّلاَةِ وَالصِّدْقِ وَالعَفَافِ، فَإِنْ كَانَ مَا تَقُولُ حَقًّا فَسَيَمْلِكُ مَوْضِعَ قَدَمَيَّ هَاتَيْنِ، وَقَدْ كُنْتُ أَعْلَمُ أَنَّهُ خَارِجٌ، لَمْ أَكُنْ أَظُنُّ أَنَّهُ مِنْكُمْ، فَلَوْ أَنِّي أَعْلَمُ أَنِّي أَخْلُصُ إِلَيْهِ لَتَجَشَّمْتُ لِقَاءَهُ، وَلَوْ كُنْتُ عِنْدَهُ لَغَسَلْتُ عَنْ قَدَمِهِ. ثُمَّ دَعَا بِكِتَابِ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ الَّذِي بَعَثَ بِهِ دِحْيَةُ إِلَى عَظِيمِ بُصْرَى، فَدَفَعَهُ إِلَى هِرَقْلَ، فَقَرَأَهُ فَإِذَا فِيهِ \" بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ، مِنْ مُحَمَّدٍ عَبْدِ اللَّهِ وَرَسُولِهِ إِلَى هِرَقْلَ عَظِيمِ الرُّومِ: سَلاَمٌ عَلَى مَنِ اتَّبَعَ الهُدَى، أَمَّا بَعْدُ، فَإِنِّي أَدْعُوكَ بِدِعَايَةِ الإِسْلاَمِ، أَسْلِمْ تَسْلَمْ، يُؤْتِكَ اللَّهُ أَجْرَكَ مَرَّتَيْنِ، فَإِنْ تَوَلَّيْتَ فَإِنَّ عَلَيْكَ إِثْمَ الأَرِيسِيِّينَ \"وَ {يَا أَهْلَ الكِتَابِ تَعَالَوْا إِلَى كَلِمَةٍ سَوَاءٍ بَيْنَنَا وَبَيْنَكُمْ أَنْ لاَ نَعْبُدَ إِلَّا اللَّهَ وَلاَ نُشْرِكَ بِهِ شَيْئًا وَلاَ يَتَّخِذَ بَعْضُنَا بَعْضًا أَرْبَابًا مِنْ دُونِ اللَّهِ فَإِنْ تَوَلَّوْا فَقُولُوا اشْهَدُوا بِأَنَّا مُسْلِمُونَ} قَالَ أَبُو سُفْيَانَ: فَلَمَّا قَالَ مَا قَالَ، وَفَرَغَ مِنْ قِرَاءَةِ الكِتَابِ، كَثُرَ عِنْدَهُ الصَّخَبُ وَارْتَفَعَتِ الأَصْوَاتُ وَأُخْرِجْنَا، فَقُلْتُ لِأَصْحَابِي حِينَ أُخْرِجْنَا: لَقَدْ أَمِرَ أَمْرُ ابْنِ أَبِي كَبْشَةَ، إِنَّهُ يَخَافُهُ مَلِكُ بَنِي الأَصْفَرِ. فَمَا زِلْتُ مُوقِنًا أَنَّهُ سَيَظْهَرُ حَتَّى أَدْخَلَ اللَّهُ عَلَيَّ الإِسْلاَمَ. وَكَانَ ابْنُ النَّاظُورِ، صَاحِبُ إِيلِيَاءَ وَهِرَقْلَ، سُقُفًّا عَلَى نَصَارَى الشَّأْمِ يُحَدِّثُ أَنَّ هِرَقْلَ حِينَ قَدِمَ إِيلِيَاءَ، أَصْبَحَ يَوْمًا خَبِيثَ النَّفْسِ، فَقَالَ بَعْضُ بَطَارِقَتِهِ: قَدِ اسْتَنْكَرْنَا هَيْئَتَكَ، قَالَ ابْنُ النَّاظُورِ: وَكَانَ هِرَقْلُ حَزَّاءً يَنْظُرُ فِي النُّجُومِ، فَقَالَ لَهُمْ حِينَ سَأَلُوهُ: إِنِّي رَأَيْتُ اللَّيْلَةَ حِينَ نَظَرْتُ فِي النُّجُومِ مَلِكَ الخِتَانِ قَدْ ظَهَرَ، فَمَنْ يَخْتَتِنُ مِنْ هَذِهِ الأُمَّةِ؟ قَالُوا: لَيْسَ يَخْتَتِنُ إِلَّا اليَهُودُ، فَلاَ يُهِمَّنَّكَ شَأْنُهُمْ، وَاكْتُبْ إِلَى مَدَايِنِ مُلْكِكَ، فَيَقْتُلُوا مَنْ فِيهِمْ مِنَ اليَهُودِ. فَبَيْنَمَا هُمْ عَلَى أَمْرِهِمْ، أُتِيَ هِرَقْلُ بِرَجُلٍ أَرْسَلَ بِهِ مَلِكُ غَسَّانَ يُخْبِرُ عَنْ خَبَرِ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَلَمَّا اسْتَخْبَرَهُ هِرَقْلُ قَالَ: اذْهَبُوا فَانْظُرُوا أَمُخْتَتِنٌ هُوَ أَمْ لاَ، فَنَظَرُوا إِلَيْهِ، فَحَدَّثُوهُ أَنَّهُ مُخْتَتِنٌ، وَسَأَلَهُ عَنِ العَرَبِ، فَقَالَ: هُمْ يَخْتَتِنُونَ، فَقَالَ هِرَقْلُ: هَذَا مُلْكُ هَذِهِ الأُمَّةِ قَدْ ظَهَرَ. ثُمَّ كَتَبَ هِرَقْلُ إِلَى صَاحِبٍ لَهُ بِرُومِيَةَ، وَكَانَ نَظِيرَهُ فِي العِلْمِ، وَسَارَ هِرَقْلُ إِلَى حِمْصَ، فَلَمْ يَرِمْ حِمْصَ حَتَّى أَتَاهُ كِتَابٌ مِنْ صَاحِبِهِ يُوَافِقُ رَأْيَ هِرَقْلَ عَلَى خُرُوجِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَأَنَّهُ نَبِيٌّ، فَأَذِنَ هِرَقْلُ لِعُظَمَاءِ الرُّومِ فِي دَسْكَرَةٍ لَهُ بِحِمْصَ، ثُمَّ أَمَرَ بِأَبْوَابِهَا فَغُلِّقَتْ، ثُمَّ اطَّلَعَ فَقَالَ: يَا مَعْشَرَ الرُّومِ، هَلْ لَكُمْ فِي الفَلاَحِ وَالرُّشْدِ، وَأَنْ يَثْبُتَ مُلْكُكُمْ، فَتُبَايِعُوا هَذَا النَّبِيَّ؟ فَحَاصُوا حَيْصَةَ حُمُرِ الوَحْشِ إِلَى الأَبْوَابِ، فَوَجَدُوهَا قَدْ غُلِّقَتْ، فَلَمَّا رَأَى هِرَقْلُ نَفْرَتَهُمْ، وَأَيِسَ مِنَ الإِيمَانِ، قَالَ: رُدُّوهُمْ عَلَيَّ، وَقَالَ: إِنِّي قُلْتُ مَقَالَتِي آنِفًا أَخْتَبِرُ بِهَا شِدَّتَكُمْ عَلَى دِينِكُمْ، فَقَدْ رَأَيْتُ، فَسَجَدُوا لَهُ وَرَضُوا عَنْهُ، فَكَانَ ذَلِكَ آخِرَ شَأْنِ هِرَقْلَ رَوَاهُ صَالِحُ بْنُ كَيْسَانَ، وَيُونُسُ، وَمَعْمَرٌ، عَنِ الزُّهْرِيِّ"
		},
		"chapter_id": "1cfedcd5-2108-4557-9661-90f8602435de",
		"chapter_name": "first_chapter",
		"title": {
			"en": "How was the Divine Revelation initially revealed to AlLāh’s Messenger (peace and blessings be upon him) ",
			"ms": "Bagaimana Permulaan Datangnya Wahyu Kepada Rasulullah SAW",
			"ar": "باب كَيْفَ كَانَ بَدْءُ الْوَحْىِ إِلَى رسول الله"
		},
		"category_id": "7bae1d78-1524-4633-b12a-c713e6bcfd15",
		"category_name": "",
		"category_title": {
			"en": "Book of the Beginning of Revelation ",
			"ms": "Kitab Permulaan Wahyu",
			"ar": "كتاب بدء الوحى"
		},
		"book_name": "sahih_bukhari",
		"book_title": "Sahih Bukhari",
		"book_id": "ad6a2cc8-f34b-476b-9b7e-6756a3b7d43e"
	},
	{
		"id": "1a130678-196f-4fd5-93ab-8a423faf9bec",
		"name": "",
		"content": {
			"en": "Īmān (Faith) is speech and actions, it increases and decreases.\n\nAlLāh the Most Exalted said: {so that they would increase in faith along with their (present) faith}.\n\n{And We increased them in guidance}.\n\n{And AlLāh increases those who were guided, in guidance}.\n\n{And those who are guided, He increases them in guidance and gives them their piety}.\n\n{and those who have believed will increase in faith}.\n\nAnd His Speech: {“Which of you has increased in faith due to this?” As for those who believed, it has increased them in faith}.\n\nAnd He whose mention is exalted said: {“So fear them.” But it (merely) increased them in faith}.\n\nAlLāh, whose mention is exalted, said: {And it increased them only in faith and acceptance}.\n\nLoving and hating for the sake of AlLāh is part of Faith.\n\n‘Umar bin ‘Abd al-‘Azīz wrote a letter to ‘Adiy bin ‘Adiy, “Indeed Faith has (its) obligations, laws, boundaries, and recommended actions; whosoever completes them has completed his faith, and whosoever has not completed them has not completed his faith. If I live long enough, I will explain it all to you so that you put it into practice. If I die, I am not eager to remain amongst you.”\n\nIbrāhīm (Abraham) – may peace be upon him – said: {but (I ask) only so that my heart may be satisfied.}\n\nMu‘ādz (bin Jabal) – may AlLāh be pleased with him – said, “Sit with us, and renew our faith (by doing remembrance of AlLāh) for a moment.”\n\n(‘AbdulLāh) ibn Mas‘ūd() – may AlLāh be pleased with him – said, “Conviction is faith in its entirety.”\n\n(‘AbdulLāh) ibn ‘Umar() – may AlLāh be pleased with them both – said, “A servant of AlLāh will not reach the essence of righteousness until he leaves that which rankles in the heart and makes it uncomfortable.”\n\nMujāhid said, “AlLāh said: {He has ordained for you}, which meant: O Muḥammad! We commanded you and him (i.e. Prophet Nūh/Noah) with the one and same religion.”\n\n(‘Abdullāh) ibn ‘Abbās() – may AlLāh be pleased with them both – said, “AlLāh said: {a law and a method}, which meant: a path and a custom.”",
			"ms": "Iman itu merangkumi ucapan dan perbuatan, ia boleh bertambah dan berkurang. \nFirman Allah c, “…agar mereka bertambah iman dan keyakinan beserta dengan iman dan keyakinan mereka yang sedia ada...”, “…dan Kami tambahkan petunjuk kepada mereka…”, “Dan Allah akan menambahkan petunjuk bagi orang-orang yang menurut jalan petunjuk..”, “Dan orang-orang yang mengikuti petunjuk (ke jalan yang benar), Allah menambahkan petunjuk kepada mereka, serta memberi mereka (dorongan) untuk mereka bertaqwa.”, “Dan supaya orang-orang yang beriman bertambah imannya…”, “\"Siapakah di antara kamu yang imannya bertambah disebabkan oleh surah ini? Adapun orang-orang yang beriman, maka surah itu dapat menambahkan iman mereka…”, “\"(Orang munafik berkata) hendaklah kamu gerun kepadanya (kaum musyrikin). Maka berita itu makin menambahkan iman mereka…”, “Dan tentera musuh (yang kamu lihat) itu tidak memberi sebarang kesan kepada mereka selain daripadapada penambahan iman dan penyerahan diri mereka bulat-bulat kepada Allah.”\n\nCinta kerana Allah dan benci kerana Allah itu sebahagian daripada iman. ‘Umar bin ‘Abdul Aziz pernah menulis surat kepada ‘Adi bin ‘Adi, “Iman itu memiliki beberapa kewajipan, syariat, batasan, dan perkara-perkara sunnah. Orang yang dapat memenuhi kesemua itu, sempurnalah imannya. Sebaliknya, orang yang tidak dapat memenuhinya, bererti imannya tidak sempurna. Jika saya masih hidup, saya akan terus menjelaskannya kepada kamu sehingga kamu dapat mengamalkannya. Namun, jika saya mati, saya pun tidaklah mahu sangat bersama denganmu (di dunia ini).”\n\nIbrahim berkata, “akan tetapi, supaya hati saya tenteram...” Mu‘adz berkata, “Duduklah bersama kami sebentar untuk menyegarkan iman kembali.” Ibn Mas‘ud berkata, “Keyakinan adalah tunjang keimanan.” Ibn ‘Umar berkata, “Seorang hamba itu tidak akan capai hakikat takwa selama mana masih ada keraguan di dalam hatinya.” Mengenai ayat, “Allah telah mensyariatkan…” Mujahid menafsirkannya, “Muhammad, Aku wasiatkan kepadamu dan kepada Nuh satu agama yang sama.” Mengenai dua perkataan di dalam ayat, “…suatu syariat dan jalan agama…” Ibn ‘Abbas menafsirkannya dengan, “Jalan dan cara.”",
			"ar": "وَهُوَ قَوْلٌ وَفِعْلٌ، وَيَزِيدُ وَيَنْقُصُ، قَالَ اللَّهُ تَعَالَى {لِيَزْدَادُوا إِيمَانًا مَعَ إِيمَانِهِمْ} [الفتح: 4] {وَزِدْنَاهُمْ هُدًى} [الكهف: 13] {وَيَزِيدُ اللَّهُ الَّذِينَ اهْتَدَوْا هُدًى} [مريم: 76] {وَالَّذِينَ اهْتَدَوْا زَادَهُمْ هُدًى وَآتَاهُمْ تَقْوَاهُمْ} [محمد: 17] وَقَوْلُهُ: {وَيَزْدَادَ الَّذِينَ آمَنُوا إِيمَانًا} [المدثر: 31] وَقَوْلُهُ: {أَيُّكُمْ زَادَتْهُ هَذِهِ إِيمَانًا فَأَمَّا -[11]- الَّذِينَ آمَنُوا فَزَادَتْهُمْ إِيمَانًا} [التوبة: 124] وَقَوْلُهُ جَلَّ ذِكْرُهُ: {فَاخْشَوْهُمْ فَزَادَهُمْ إِيمَانًا} [آل عمران: 173] وَقَوْلُهُ تَعَالَى: {وَمَا زَادَهُمْ إِلَّا إِيمَانًا وَتَسْلِيمًا} [الأحزاب: 22] وَالحُبُّ فِي اللَّهِ وَالبُغْضُ فِي اللَّهِ مِنَ الإِيمَانِ\" وَكَتَبَ عُمَرُ بْنُ عَبْدِ العَزِيزِ إِلَى عَدِيِّ بْنِ عَدِيٍّ: «إِنَّ لِلْإِيمَانِ فَرَائِضَ، وَشَرَائِعَ، وَحُدُودًا، وَسُنَنًا، فَمَنِ اسْتَكْمَلَهَا اسْتَكْمَلَ الإِيمَانَ، وَمَنْ لَمْ يَسْتَكْمِلْهَا لَمْ يَسْتَكْمِلِ الإِيمَانَ، فَإِنْ أَعِشْ فَسَأُبَيِّنُهَا لَكُمْ حَتَّى تَعْمَلُوا بِهَا، وَإِنْ أَمُتْ فَمَا أَنَا عَلَى صُحْبَتِكُمْ بِحَرِيصٍ» وَقَالَ إِبْرَاهِيمُ: «وَلَكِنْ لِيَطْمَئِنَّ قَلْبِي« وَقَالَ مُعَاذُ بْنُ جَبَلٍ: «اجْلِسْ بِنَا نُؤْمِنْ سَاعَةً« وَقَالَ ابْنُ مَسْعُودٍ: «اليَقِينُ الإِيمَانُ كُلُّهُ« وَقَالَ ابْنُ عُمَرَ: «لاَ يَبْلُغُ العَبْدُ حَقِيقَةَ التَّقْوَى حَتَّى يَدَعَ مَا حَاكَ فِي الصَّدْرِ« وَقَالَ مُجَاهِدٌ: «شَرَعَ لَكُمْ مِنَ الدِّينِ أَوْصَيْنَاكَ يَا مُحَمَّدُ وَإِيَّاهُ دِينًا وَاحِدًا» وَقَالَ ابْنُ عَبَّاسٍ: «شِرْعَةً وَمِنْهَاجًا« سَبِيلًا وَسُنَّةً"
		},
		"chapter_id": "f439e744-9acf-4005-bf25-6ddac4439dc3",
		"chapter_name": "faith_chapter",
		"title": {
			"en": "Faith and the saying of the Prophet (peace and blessings be upon him): “Islam is built on five principles",
			"ms": "Bab Sabda Nabi , “Islam Dibina Di Atas Lima Asas.”",
			"ar": "بَابُ قَوْلِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: « بُنِيَ الإِسْلاَمُ عَلَى خَمْسٍ"
		},
		"category_id": "997978b2-59d1-48ea-9ca6-0b047aa24434",
		"category_name": "",
		"category_title": {
			"en": "Book of Faith",
			"ms": "Kitab Iman",
			"ar": "كتاب الإيمان"
		},
		"book_name": "sahih_bukhari",
		"book_title": "Sahih Bukhari",
		"book_id": "ad6a2cc8-f34b-476b-9b7e-6756a3b7d43e"
	},
	{
		"id": "6e880f7d-2745-42eb-b774-c7d6f97f3600",
		"name": "",
		"content": {
			"en": "Ibn ‘Umar – may AlLāh be pleased with them both – said: AlLāh’s Messenger said:\n“Islam is based on five (principles): (1) to testify that none has the right to be worshipped except AlLāh, and that Muḥammad is AlLāh’s Messenger, (2) to establish the prayers, (3) to pay Zakāh (compulsory alms), (4) to perform Ḥajj (pilgrimage), and (5) to observe the fast in Ramaḍān.”",
			"ms": "‘Abdullah bin Musa menyampaikan kepada kami, katanya Hanzhalah bin Abu Sufyan mengkhabarkan kepada kami, katanya, daripada Ikrimah bin Khalid, daripada Ibn ‘Umar, beliau berkata Rasulullah g bersabda, “Islam dibina di atas lima asas; persaksian bahawa tiada tuhan yang berhak diibadahi selain Allah dan Muhammad itu adalah utusan Allah, mendirikan solat, menunaikan zakat, melaksanakan haji, dan berpuasa pada bulan Ramadhan.”",
			"ar": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، قَالَ أَخْبَرَنَا حَنْظَلَةُ بْنُ أَبِي سُفْيَانَ، عَنْ عِكْرِمَةَ بْنِ خَالِدٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ: قَالَ رَسُولُ اللَّهِ: \"بُنِيَ الإِسْلاَمُ عَلَى خَمْسٍ شَهَادَةِ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، وَإِقَامِ الصَّلاَةِ، وَإِيتَاءِ الزَّكَاةِ، وَالْحَجِّ، وَصَوْمِ رَمَضَانَ.‏\""
		},
		"chapter_id": "47ae24f8-eb8b-45fc-a95d-a0a1e903ec90",
		"chapter_name": "supplication_chapter",
		"title": {
			"en": "Your supplications is your faith",
			"ms": "Bab Doa Kamu Adalah Iman Kamu",
			"ar": "باب دُعَاؤُكُمْ إِيمَانُكُمْ"
		},
		"category_id": "997978b2-59d1-48ea-9ca6-0b047aa24434",
		"category_name": "",
		"category_title": {
			"en": "Book of Faith",
			"ms": "Kitab Iman",
			"ar": "كتاب الإيمان"
		},
		"book_name": "sahih_bukhari",
		"book_title": "Sahih Bukhari",
		"book_id": "ad6a2cc8-f34b-476b-9b7e-6756a3b7d43e"
	},
	{
		"id": "41c95bd0-a693-4865-a0f8-969333851026",
		"name": "",
		"content": {
			"en": "AlLāh the Most Exalted said: {Righteousness is not in turning your faces towards the East or the West; rather, (true) righteousness is in those who believe in AlLāh, the Last Day, the angels, the Books, and the Prophets; and (those who) give out wealth in spite of their love for it to relatives, orphans, the destitute, (needy) travellers, beggars, and for freeing captives; and (those who) establish the prayer, pay zakāh (compulsory alms), and fulfil the promises they make; and (those who) are patient in times of suffering, adversity, and during battle. It is they who are true (in their faith), and it is they who are righteous}. And He said: {Certainly, the believers are successful}.",
			"ms": "Firman Allah c, “Kebajikan itu bukanlah kamu menghadapkan mukamu ke arah timur dan barat, akan tetapi kebajikan itu adalah iman seseorang kepada Allah, hari akhirat, para malaikat, buku-buku dan sekalian Nabi; mendermakan hartanya kepada kaum kerabat, anak-anak yatim, orang-orang miskin, orang musafir juga kepada orang-orang yang meminta; memerdekakan hamba-hamba; mendirikan solat serta mengeluarkan zakat dan menyempurnakan janji apabila membuat perjanjian; bersabar ketika kesempitan, derita, dan ketika perang. Mereka itulah orang-orang yang benar (terhadap iman mereka); dan mereka itulah juga orang-orang yang bertaqwa.”, “Sungguh, berjayalah orang-orang yang beriman.”",
			"ar": "وَقَوْلِ اللَّهِ تَعَالَى: {لَيْسَ الْبِرَّ أَنْ تُوَلُّوا وُجُوهَكُمْ قِبَلَ الْمَشْرِقِ وَالْمَغْرِبِ وَلَكِنَّ الْبِرَّ مَنْ آمَنَ بِاللَّهِ وَالْيَوْمِ الآخِرِ وَالْمَلاَئِكَةِ وَالْكِتَابِ وَالنَّبِيِّينَ وَآتَى الْمَالَ عَلَى حُبِّهِ ذَوِي الْقُرْبَى وَالْيَتَامَى وَالْمَسَاكِينَ وَابْنَ السَّبِيلِ وَالسَّائِلِينَ وَفِي الرِّقَابِ وَأَقَامَ الصَّلاَةَ وَآتَى الزَّكَاةَ وَالْمُوفُونَ بِعَهْدِهِمْ إِذَا عَاهَدُوا وَالصَّابِرِينَ فِي الْبَأْسَاءِ وَالضَّرَّاءِ وَحِينَ الْبَأْسِ أُولَئِكَ الَّذِينَ صَدَقُوا وَأُولَئِكَ هُمُ الْمُتَّقُونَ}. وَقَوْلِهِ: {قَدْ أَفْلَحَ الْمُؤْمِنُونَ} الآيَةَ."
		},
		"chapter_id": "4fe986f5-8b39-490f-8ca5-8dc13c6d1842",
		"chapter_name": "matters_faith_chapter",
		"title": {
			"en": "Matters of faith",
			"ms": "Bab Perkara-Perkara Yang Berkaitan Dengan Iman",
			"ar": "باب أُمُورِ الإِيمَانِْ"
		},
		"category_id": "997978b2-59d1-48ea-9ca6-0b047aa24434",
		"category_name": "",
		"category_title": {
			"en": "Book of Faith",
			"ms": "Kitab Iman",
			"ar": "كتاب الإيمان"
		},
		"book_name": "sahih_bukhari",
		"book_title": "Sahih Bukhari",
		"book_id": "ad6a2cc8-f34b-476b-9b7e-6756a3b7d43e"
	},
	{
		"id": "98f3eb0f-0508-44f4-84c1-e2e0880f76ba",
		"name": "",
		"content": {
			"en": "Abū Hurayrah – may AlLāh be pleased with him – narrated: the Prophet said:\n“Faith consists of sixty-odd branches. And modesty is a branch of faith.”",
			"ms": "‘Abdullah bin Muhammad menyampaikan kepada kami, katanya Abu ‘Amir al-‘Aqadi menyampaikan kepada kami, katanya Sulayman bin Bilal menyampaikan kepada kami, daripada ‘Abdullah bin Dinar, daripada Abu Shalih, daripada Abu Hurayrah, daripada Nabi g, baginda bersabda, “Iman itu memiliki lebih daripada 60 bahagian. Sifat malu itu merupakan sebahagian daripada iman.”",
			"ar": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا أَبُو عَامِرٍ الْعَقَدِيُّ، قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ قَالَ: \"الإِيمَانُ بِضْعٌ وَسِتُّونَ شُعْبَةً، وَالْحَيَاءُ شُعْبَةٌ مِنَ الإِيمَانِ.\""
		},
		"chapter_id": "4fe986f5-8b39-490f-8ca5-8dc13c6d1842",
		"chapter_name": "matters_faith_chapter",
		"title": {
			"en": "Matters of faith",
			"ms": "Bab Perkara-Perkara Yang Berkaitan Dengan Iman",
			"ar": "باب أُمُورِ الإِيمَانِْ"
		},
		"category_id": "997978b2-59d1-48ea-9ca6-0b047aa24434",
		"category_name": "",
		"category_title": {
			"en": "Book of Faith",
			"ms": "Kitab Iman",
			"ar": "كتاب الإيمان"
		},
		"book_name": "sahih_bukhari",
		"book_title": "Sahih Bukhari",
		"book_id": "ad6a2cc8-f34b-476b-9b7e-6756a3b7d43e"
	},
	{
		"id": "87b4eacd-716b-4c5f-a4c1-7b91b4ee1c9b",
		"name": "",
		"content": {
			"en": "‘AbdulLāh bin ‘Amr (bin al-‘Āṣ) – may AlLāh be pleased with them both – narrated: the Prophet said:\n“A (true) Muslim is the one whom other Muslims are safe from being verbally and physically hurt. And a (true) Muhājir (migrant) is the one who abandons all that AlLāh has forbidden.”",
			"ms": "Adam bin Abu Iyas menyampaikan kepada kami, katanya Syu‘bah menyampaikan kepada kami, daripada ‘Abdullah bin Abu al-Safar dan Isma‘il, daripada al-Sya‘bi, daripada ‘Abdullah bin ‘Amr, daripada Nabi g, baginda bersabda, “Seorang muslim yang sejati itu adalah orang muslim yang lain selamat daripada gangguan lidah dan tangannya. Orang yang berhijrah itu pula adalah orang yang meninggalkan segala perkara yang dilarang oleh Allah.”",
			"ar": "حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي السَّفَرِ، وَإِسْمَاعِيلَ، عَنِ الشَّعْبِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو ـ رضى الله عنهما ـ عَنِ النَّبِيِّ قَالَ: \"الْمُسْلِمُ مَنْ سَلِمَ الْمُسْلِمُونَ مِنْ لِسَانِهِ وَيَدِهِ، وَالْمُهَاجِرُ مَنْ هَجَرَ مَا نَهَى اللَّهُ عَنْهُ.\""
		},
		"chapter_id": "f7d8b150-11b0-4b4a-990c-0d2999707423",
		"chapter_name": "true_muslim_chapter",
		"title": {
			"en": "A (true) Muslim is one whom other Muslims are safe from being verbally and physically hurt",
			"ms": "Bab Seorang Muslim Yang Sejati Itu Adalah Orang Muslim Yang Lain Selamat Daripada Gangguan Lidah Dan Tangannya",
			"ar": "باب الْمُسْلِمُ مَنْ سَلِمَ الْمُسْلِمُونَ مِنْ لِسَانِهِ وَيَدِهِ"
		},
		"category_id": "997978b2-59d1-48ea-9ca6-0b047aa24434",
		"category_name": "",
		"category_title": {
			"en": "Book of Faith",
			"ms": "Kitab Iman",
			"ar": "كتاب الإيمان"
		},
		"book_name": "sahih_bukhari",
		"book_title": "Sahih Bukhari",
		"book_id": "ad6a2cc8-f34b-476b-9b7e-6756a3b7d43e"
	},
	{
		"id": "2266d164-4658-4307-8456-c73fe62d61c0",
		"name": "",
		"content": {
			"en": "",
			"ms": "1- (1614) Yahya bin Yahya, Abu Bakr bin Abu Shaibah dan Ishaq bin Ibrahim menyampaikan kepada kami dan lafaz tersebut adalah milik Yahya. Yahya berkata: Ibn ‘Uyainah telah mengkhabarkan kepada kami, manakala dua orang lagi berkata: Ibn ‘Uyainah menyampaikan kepada kami, daripada al-Zuhri, daripada ‘Ali bin Husain, daripada ‘Amr bin Uthman, daripada Usamah bin Zaid, bahawa Nabi ﷺ bersabda: “Muslim tidak mewarisi kafir dan kafir tidak mewarisi Muslim”.",
			"ar": "1 - (1614) حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَاللَّفْظُ لِيَحْيَى، قَالَ يَحْيَى: أَخْبَرَنَا، وقَالَ الْآخَرَانِ: حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عَلِيِّ بْنِ حُسَيْنٍ، عَنْ عَمْرِو بْنِ عُثْمَانَ، عَنْ أُسَامَةَ بْنِ زَيْدٍ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: لَا يَرِثُ الْمُسْلِمُ الْكَافِرَ، وَلَا يَرِثُ الْكَافِرُ الْمُسْلِمَ."
		},
		"chapter_id": "2ff8d114-8e6c-4eba-8196-ac10099f856d",
		"chapter_name": "faraid_chapter",
		"title": {
			"en": "",
			"ms": "Bab berikanlah faraid kepada ahlinya, lalu bakinya adalah untuk lelaki yang paling rapat",
			"ar": "بَابُ أَلْحِقُوا الْفَرَائِضَ بِأَهْلِهَا، فَمَا بَقِيَ فَلِأَوْلَى رَجُلٍ ذَكَرٍ"
		},
		"category_id": "e745872a-99ab-4e12-a649-3569b7b4986d",
		"category_name": "",
		"category_title": {
			"en": "Faraid Book",
			"ms": "Kitab Faraid",
			"ar": "كتاب الإيمان"
		},
		"book_name": "sahih_muslim",
		"book_title": "Sahih Muslim",
		"book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7"
	},
	{
		"id": "91199cbe-357a-4f7c-ad0d-a539611c8449",
		"name": "",
		"content": {
			"en": "",
			"ms": "2- (1615) ‘Abd al-A’la bin Hammad dan dia adalah al-Narsi, menyampaikan kepada kami, dia berkata: Wuhaib menyampaikan kepada kami, daripada Ibn Tawus, daripada bapanya, daripada Ibn ‘Abbas, dia berkata: Rasulullah ﷺ bersabda: “Berikanlah faraid kepada ahlinya, lalu bakinya adalah untuk lelaki yang paling rapat”.",
			"ar": "2- (1615) حَدَّثَنَا عَبْدُ الْأَعْلَى بْنُ حَمَّادٍ وَهُوَ النَّرْسِيُّ، حَدَّثَنَا وُهَيْبٌ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: أَلْحِقُوا الْفَرَائِضَ بِأَهْلِهَا، فَمَا بَقِيَ فَهُوَ لِأَوْلَى رَجُلٍ ذَكَرٍ."
		},
		"chapter_id": "2ff8d114-8e6c-4eba-8196-ac10099f856d",
		"chapter_name": "faraid_chapter",
		"title": {
			"en": "",
			"ms": "Bab berikanlah faraid kepada ahlinya, lalu bakinya adalah untuk lelaki yang paling rapat",
			"ar": "بَابُ أَلْحِقُوا الْفَرَائِضَ بِأَهْلِهَا، فَمَا بَقِيَ فَلِأَوْلَى رَجُلٍ ذَكَرٍ"
		},
		"category_id": "e745872a-99ab-4e12-a649-3569b7b4986d",
		"category_name": "",
		"category_title": {
			"en": "Faraid Book",
			"ms": "Kitab Faraid",
			"ar": "كتاب الإيمان"
		},
		"book_name": "sahih_muslim",
		"book_title": "Sahih Muslim",
		"book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7"
	},
	{
		"id": "dcfb4e3f-28dc-4e49-8801-273cec284945",
		"name": "",
		"content": {
			"en": "",
			"ms": "3- (…) Umayyah bin Bistam al-‘Aishi menyampaikan kepada kami, dia berkata: Yazid bin Zurai‘ menyampaikan kepada kami, dia berkata: Rauh bin al-Qasim menyampaikan kepada kami, daripada ‘Abdullah bin Tawus, daripada bapanya, daripada Ibn ‘Abbas, daripada Rasulullah ﷺ, Baginda bersabda: “Berikanlah faraid kepada ahlinya, lalu apa yang faraid tinggalkan adalah untuk lelaki yang paling rapat”.",
			"ar": "3- (...) حَدَّثَنَا أُمَيَّةُ بْنُ بِسْطَامَ الْعَيْشِيُّ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا رَوْحُ بْنُ الْقَاسِمِ، عَنْ عَبْدِ اللهِ بْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أَلْحِقُوا الْفَرَائِضَ بِأَهْلِهَا، فَمَا تَرَكَتِ الْفَرَائِضُ فَلِأَوْلَى رَجُلٍ ذَكَرٍ»"
		},
		"chapter_id": "2ff8d114-8e6c-4eba-8196-ac10099f856d",
		"chapter_name": "faraid_chapter",
		"title": {
			"en": "",
			"ms": "Bab berikanlah faraid kepada ahlinya, lalu bakinya adalah untuk lelaki yang paling rapat",
			"ar": "بَابُ أَلْحِقُوا الْفَرَائِضَ بِأَهْلِهَا، فَمَا بَقِيَ فَلِأَوْلَى رَجُلٍ ذَكَرٍ"
		},
		"category_id": "e745872a-99ab-4e12-a649-3569b7b4986d",
		"category_name": "",
		"category_title": {
			"en": "Faraid Book",
			"ms": "Kitab Faraid",
			"ar": "كتاب الإيمان"
		},
		"book_name": "sahih_muslim",
		"book_title": "Sahih Muslim",
		"book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7"
	},
	{
		"id": "973a5b9c-6d34-4427-ab36-97860cbb87e1",
		"name": "",
		"content": {
			"en": "",
			"ms": "4- (…) Ishaq bin Ibrahim, Muhammad bin Rafi‘ dan ‘Abd bin Humaid menyampaikan kepada kami, dan lafaz tersebut adalah milik Ibn Rafi‘. Ishaq berkata: ‘Abd al-Razzaq telah menyampaikan kepada kami, manakala dua orang lagi berkata: ‘Abd al-Razzaq telah mengkhabarkan kepada kami, dia berkata: Ma‘mar mengkhabarkan kepada kami, daripada Ibn Tawus, daripada bapanya, daripada Ibn ‘Abbas, beliau berkata: Rasulullah ﷺ bersabda: “Bahagikanlah harta di antara ahli faraid mengikut Kitab Allah, lalu apa yang faraid tinggalkan adalah untuk lelaki yang paling rapat”.",
			"ar": "4- (...) حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَمُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، وَاللَّفْظُ لِابْنِ رَافِعٍ، قَالَ إِسْحَاقُ: حَدَّثَنَا، وَقَالَ الْآخَرَانِ: أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: اقْسِمُوا الْمَالَ بَيْنَ أَهْلِ الْفَرَائِضِ عَلَى كِتَابِ اللهِ، فَمَا تَرَكَتِ الْفَرَائِضُ فَلِأَوْلَى رَجُلٍ ذَكَرٍ"
		},
		"chapter_id": "2ff8d114-8e6c-4eba-8196-ac10099f856d",
		"chapter_name": "faraid_chapter",
		"title": {
			"en": "",
			"ms": "Bab berikanlah faraid kepada ahlinya, lalu bakinya adalah untuk lelaki yang paling rapat",
			"ar": "بَابُ أَلْحِقُوا الْفَرَائِضَ بِأَهْلِهَا، فَمَا بَقِيَ فَلِأَوْلَى رَجُلٍ ذَكَرٍ"
		},
		"category_id": "e745872a-99ab-4e12-a649-3569b7b4986d",
		"category_name": "",
		"category_title": {
			"en": "Faraid Book",
			"ms": "Kitab Faraid",
			"ar": "كتاب الإيمان"
		},
		"book_name": "sahih_muslim",
		"book_title": "Sahih Muslim",
		"book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7"
	},
	{
		"id": "65f1e5ea-3b94-4c62-91e2-e08b6ef9a76f",
		"name": "",
		"content": {
			"en": "",
			"ms": "5- (1616) ‘Amr bin Muhammad bin Bukair al-Naqid menyampaikan kepada kami, dia berkata: Sufyan bin ‘Uyainah menyampaikan kepada kami, daripada Muhammad bin al-Munkadir, dia mendengar Jabir bin ‘Abdullah, beliau berkata: “Saya telah sakit, lalu Rasulullah ﷺ dan Abu Bakr datang menziarahi saya dengan berjalan kaki, lalu saya pengsan. Lalu Baginda berwuduk kemudian baginda menuangkan daripada air wuduknya ke atas saya lantas saya tersedar, saya berkata: “Wahai Rasulullah! Bagaimana saya tentukan berkenaan harta saya?” Lalu Baginda tidak menjawab saya sedikitpun sehingga turun ayat pewarisan: {Mereka (orang-orang Islam umatmu) meminta fatwa kepadamu (Wahai Muhammad mengenai masalah al-Kalalah). Katakanlah: “Allah memberi fatwa kepada kamu di dalam perkara al-Kalalah itu”}. (al-Nisa’: 176).",
			"ar": "5- (1616) حَدَّثَنَا عَمْرُو بْنُ مُحَمَّدِ بْنِ بُكَيْرٍ النَّاقِدُ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، سَمِعَ جَابِرَ بْنَ عَبْدِ اللهِ، قَالَ: مَرِضْتُ فَأَتَانِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَأَبُو بَكْرٍ يَعُودَانِي مَاشِيَيْنِ، فَأُغْمِيَ عَلَيَّ، فَتَوَضَّأَ، ثُمَّ صَبَّ عَلَيَّ مِنْ وَضُوئِهِ، فَأَفَقْتُ، قُلْتُ: \" يَا رَسُولَ اللهِ، كَيْفَ أَقْضِي فِي مَالِي؟ فَلَمْ يَرُدَّ عَلَيَّ شَيْئًا، حَتَّى نَزَلَتْ آيَةُ الْمِيرَاثِ: {يَسْتَفْتُونَكَ قُلِ اللهُ يُفْتِيكُمْ فِي الْكَلَالَةِ} [النساء: 176]"
		},
		"chapter_id": "03b05631-d969-4223-bfff-ec0d346d98ed",
		"chapter_name": "",
		"title": {
			"en": "",
			"ms": "Bab pewarisan al-kalalah",
			"ar": "بَابُ مِيرَاثِ الْكَلَالَةِ"
		},
		"category_id": "e745872a-99ab-4e12-a649-3569b7b4986d",
		"category_name": "",
		"category_title": {
			"en": "Faraid Book",
			"ms": "Kitab Faraid",
			"ar": "كتاب الإيمان"
		},
		"book_name": "sahih_muslim",
		"book_title": "Sahih Muslim",
		"book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7"
	},
	{
		"id": "61820805-c7e0-4ee5-92ba-6bb197f7a1f7",
		"name": "",
		"content": {
			"en": "",
			"ms": "6- (…) Muhammad bin Hatim bin Maimun menyampaikan kepada saya, dia berkata: Hajjaj bin Muhammad menyampaikan kepada kami, dia berkata: Ibn Juraij menyampaikan kepada kami, dia berkata: Ibn al-Munkadir mengkhabarkan kepada saya, daripada Jabir bin ‘Abdullah, beliau berkata: “Nabi ﷺ dan Abu Bakr telah menziarahi saya di kampung Bani Salimah, mereka berdua berjalan kaki, lalu Baginda mendapati saya tidak sedar. Lalu Baginda meminta air, lantas berwuduk, kemudian Baginda memercikkan kepada saya daripadanya, lalu saya tersedar. Lantas saya berkata: “Bagaimana saya buat berkenaan harta saya wahai Rasulullah?” Lalu turunlah: {Allah perintahkan kamu mengenai (pembahagian harta pusaka untuk) anak-anak kamu, iaitu bahagian seorang anak lelaki menyamai bahagian dua orang anak perempuan}. (al-Nisa’; 11).",
			"ar": "6- (...) حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمِ بْنِ مَيْمُونٍ، حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، حَدَّثَنَا ابْنُ جُرَيْجٍ، قَالَ: أَخْبَرَنِي ابْنُ الْمُنْكَدِرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، قَالَ: عَادَنِي النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَأَبُو بَكْرٍ فِي بَنِي سَلِمَةَ يَمْشِيَانِ، فَوَجَدَنِي لَا أَعْقِلُ، فَدَعَا بِمَاءٍ فَتَوَضَّأَ، ثُمَّ رَشَّ عَلَيَّ مِنْهُ، فَأَفَقْتُ، فَقُلْتُ: \" كَيْفَ أَصْنَعُ فِي مَالِي يَا رَسُولَ اللهِ؟ فَنَزَلَتْ: {يُوصِيكُمُ اللهُ فِي أَوْلَادِكُمْ لِلذَّكَرِ مِثْلُ حَظِّ الْأُنْثَيَيْنِ} [النساء: 11]ٍ"
		},
		"chapter_id": "03b05631-d969-4223-bfff-ec0d346d98ed",
		"chapter_name": "",
		"title": {
			"en": "",
			"ms": "Bab pewarisan al-kalalah",
			"ar": "بَابُ مِيرَاثِ الْكَلَالَةِ"
		},
		"category_id": "e745872a-99ab-4e12-a649-3569b7b4986d",
		"category_name": "",
		"category_title": {
			"en": "Faraid Book",
			"ms": "Kitab Faraid",
			"ar": "كتاب الإيمان"
		},
		"book_name": "sahih_muslim",
		"book_title": "Sahih Muslim",
		"book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7"
	},
	{
		"id": "9fadf2cb-9d13-49a8-bcc9-e6d2d180be78",
		"name": "",
		"content": {
			"en": "",
			"ms": "7- (…) ‘Ubaidullah bin ‘Umar al-Qawaririyy telah menyampaikan kepada kami, dia berkata: ‘Abd al-Rahman -yakni Ibn Mahdi- telah menyampaikan kepada kami, dia berkata: Sufyan telah menyampaikan kepada kami, dia berkata: Saya mendengar Muhammad bin al-Munkadir berkata: Saya mendengar Jabir bin ‘Abdullah berkata: “Rasulullah ﷺ telah menziarahi saya ketika saya sakit, dan bersama baginda Abu Bakr, dengan berjalan kaki. Lalu Baginda mendapati saya telah pengsan, lalu Rasulullah ﷺ berwuduk. Kemudian baginda menuangkan ke atas saya daripada air wuduknya, lalu saya sedar. Tiba-tiba ada Rasulullah ﷺ. Lalu saya berkata: “Wahai Rasulullah! Bagaimana saya buat berkenaan harta saya?” Lalu Baginda tidak menjawab saya sedikitpun sehingga turunlah ayat pewarisan”.",
			"ar": "7- (...) حَدَّثَنَا عُبَيْدُ اللهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ يَعْنِي ابْنَ مَهْدِيٍّ، حَدَّثَنَا سُفْيَانُ، قَالَ: سَمِعْتُ مُحَمَّدَ بْنَ الْمُنْكَدِرِ، قَالَ: سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللهِ، يَقُولُ: عَادَنِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَأَنَا مَرِيضٌ، وَمَعَهُ أَبُو بَكْرٍ مَاشِيَيْنِ، فَوَجَدَنِي قَدْ أُغْمِيَ عَلَيَّ، فَتَوَضَّأَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، ثُمَّ صَبَّ عَلَيَّ مِنْ وَضُوئِهِ، فَأَفَقْتُ، فَإِذَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقُلْتُ: يَا رَسُولَ اللهِ، كَيْفَ أَصْنَعُ فِي مَالِي؟ فَلَمْ يَرُدَّ عَلَيَّ شَيْئًا حَتَّى نَزَلَتْ آيَةُ الْمِيرَاثِ.ٍ"
		},
		"chapter_id": "03b05631-d969-4223-bfff-ec0d346d98ed",
		"chapter_name": "",
		"title": {
			"en": "",
			"ms": "Bab pewarisan al-kalalah",
			"ar": "بَابُ مِيرَاثِ الْكَلَالَةِ"
		},
		"category_id": "e745872a-99ab-4e12-a649-3569b7b4986d",
		"category_name": "",
		"category_title": {
			"en": "Faraid Book",
			"ms": "Kitab Faraid",
			"ar": "كتاب الإيمان"
		},
		"book_name": "sahih_muslim",
		"book_title": "Sahih Muslim",
		"book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7"
	},
	{
		"id": "c66c1c36-61bd-4a0c-b531-705a7158c190",
		"name": "",
		"content": {
			"en": "",
			"ms": "8- (…) Muhammad bin Hatim menyampaikan kepada saya, dia berkata: Bahz menyampaikan kepada kami, dia berkata: Shu‘bah menyampaikan kepada kami, dia berkata: Muhammad bin al-Munkadir mengkhabarkan kepada saya, dia berkata: Saya mendengar Jabir bin ‘Abdullah berkata: “Rasulullah ﷺ masuk menemui saya ketika saya sakit tidak sedar. Lalu Baginda berwuduk lantas mereka menuangkan ke atas saya daripada air wuduknya, lalu saya sedar. Lantas saya berkata: “Wahai Rasulullah! Sesungguhnya yang mewarisi saya hanyalah kalalah. Lalu turunlah ayat pewarisan. Maka saya (Shu‘bah) bertanya kepada Muhammad bin al-Munkadir: {Mereka (orang-orang Islam umatmu) meminta fatwa kepadamu (Wahai Muhammad mengenai masalah al-Kalalah). Katakanlah: Allah memberi fatwa kepada kamu di dalam perkara al-Kalalah itu}. (al-Nisa’: 176). Dia menjawab: “Seperti ini ia diturunkan”.",
			"ar": "8- (...) حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا بَهْزٌ، حَدَّثَنَا شُعْبَةُ، أَخْبَرَنِي مُحَمَّدُ بْنُ الْمُنْكَدِرِ، قَالَ: سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللهِ، يَقُولُ: دَخَلَ عَلَيَّ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَأَنَا مَرِيضٌ لَا أَعْقِلُ، فَتَوَضَّأَ، فَصَبُّوا عَلَيَّ مِنْ وَضُوئِهِ، فَعَقَلْتُ، فَقُلْتُ: يَا رَسُولَ اللهِ، إِنَّمَا يَرِثُنِي كَلَالَةٌ، فَنَزَلَتْ آيَةُ الْمِيرَاثِ، فَقُلْتُ لِمُحَمَّدِ بْنِ الْمُنْكَدِرِ: {يَسْتَفْتُونَكَ قُلِ اللهُ يُفْتِيكُمْ فِي الْكَلَالَةِ} [النساء: 176] ، قَالَ: هَكَذَا أُنْزِلَتْ."
		},
		"chapter_id": "03b05631-d969-4223-bfff-ec0d346d98ed",
		"chapter_name": "",
		"title": {
			"en": "",
			"ms": "Bab pewarisan al-kalalah",
			"ar": "بَابُ مِيرَاثِ الْكَلَالَةِ"
		},
		"category_id": "e745872a-99ab-4e12-a649-3569b7b4986d",
		"category_name": "",
		"category_title": {
			"en": "Faraid Book",
			"ms": "Kitab Faraid",
			"ar": "كتاب الإيمان"
		},
		"book_name": "sahih_muslim",
		"book_title": "Sahih Muslim",
		"book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7"
	},
	{
		"id": "2d647ccd-10e2-4617-8007-a3276d68e2ae",
		"name": "",
		"content": {
			"en": "",
			"ms": "(…) Ishaq bin Ibrahim menyampaikan kepada kami, dia berkata: al-Nadr bin Shumail dan Abu Amir al-‘Aqadi mengkhabarkan kepada kami. \n(ح) Dan Muhammad bin al-Muthanna menyampaikan kepada kami, dia berkata: Wahb bin Jarir menyampaikan kepada kami, kesemua mereka daripada Shu‘bah dengan sanad ini, dalam hadis Wahb bin Jarir: “Lalu turun ayat faraid”, sedangkan dalam hadis al-Nadr dan al-‘Aqadi: “Lalu turun ayat al-fard”. Dan tiada dalam riwayat salah seorang pun daripada mereka pertanyaan Shu‘bah kepada Ibn al-Munkadir.",
			"ar": "(...) حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا النَّضْرُ بْنُ شُمَيْلٍ، وَأَبُو عَامِرٍ الْعَقَدِيُّ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، كُلُّهُمْ عَنْ شُعْبَةَ، بِهَذَا الْإِسْنَادِ، فِي حَدِيثِ وَهْبِ بْنِ جَرِيرٍ: فَنَزَلَتْ آيَةُ الْفَرَائِضِ، وَفِي حَدِيثِ النَّضْرِ، وَالْعَقَدِيِّ: فَنَزَلَتْ آيَةُ الْفَرْضِ، وَلَيْسَ فِي رِوَايَةِ أَحَدٍ مِنْهُمْ قَوْلُ شُعْبَةَ لِابْنِ الْمُنْكَدِرِ."
		},
		"chapter_id": "03b05631-d969-4223-bfff-ec0d346d98ed",
		"chapter_name": "",
		"title": {
			"en": "",
			"ms": "Bab pewarisan al-kalalah",
			"ar": "بَابُ مِيرَاثِ الْكَلَالَةِ"
		},
		"category_id": "e745872a-99ab-4e12-a649-3569b7b4986d",
		"category_name": "",
		"category_title": {
			"en": "Faraid Book",
			"ms": "Kitab Faraid",
			"ar": "كتاب الإيمان"
		},
		"book_name": "sahih_muslim",
		"book_title": "Sahih Muslim",
		"book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7"
	},
	{
		"id": "d88db1fc-41df-4fa5-9ecc-a3c2aa89d5b5",
		"name": "",
		"content": {
			"en": "",
			"ms": "9- (1617) Muhammad bin Abu Bakr al-Muqaddami dan Muhammad bin al-Muthanna menyampaikan kepada kami, dan lafaz tersebut adalah milik Ibn al-Muthanna, kedua-dua mereka berkata: Yahya bin Sa‘id menyampaikan kepada kami, dia berkata: Hisham menyampaikan kepada kami, dia berkata: Qatadah menyampaikan kepada kami, daripada Salim bin Abu al-Ja‘d, daripada Ma‘dan bin Abu Talhah bahawa ‘Umar bin al-Khattab berkhutbah pada hari Jumaat. Lalu beliau menyebut Nabi Allah ﷺ dan menyebut Abu Bakr, kemudian beliau berkata: “Sesungguhnya saya tidak akan meninggalkan sesuatu selepas (kematian) saya, yang lebih penting bagi saya, daripada al-kalalah. Saya tidak pernah merujuk Rasulullah ﷺ tentang sesuatu perkara, seperti rujukan saya kepada baginda tentang al-kalalah. Baginda juga tidak pernah bersikap keras kepada saya tentang sesuatu perkara seperti sikap keras baginda kepada saya tentangnya sehingga Baginda mencucuk dengan jari baginda pada dada saya sambil bersabda: “Wahai Umar! Belum cukupkah bagimu ayat al-saif yang terdapat di akhir surah al-Nisa’? Dan sesungguhnya saya, sekiranya masih hidup, maka saya akan memutuskan tentangnya dengan satu keputusan, orang yang membaca al-Quran dan orang yang tidak membaca al-Quran pun boleh memutuskan dengannya”.",
			"ar": "9- (1617) حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَاللَّفْظُ لِابْنِ الْمُثَنَّى، قَالَا: حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، حَدَّثَنَا هِشَامٌ، حَدَّثَنَا قَتَادَةُ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ مَعْدَانَ بْنِ أَبِي طَلْحَةَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، خَطَبَ يَوْمَ جُمُعَةٍ، فَذَكَرَ نَبِيَّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَذَكَرَ أَبَا بَكْرٍ، ثُمَّ قَالَ: إِنِّي لَا أَدَعُ بَعْدِي شَيْئًا أَهَمَّ عِنْدِي مِنَ الْكَلَالَةِ، مَا رَاجَعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي شَيْءٍ مَا رَاجَعْتُهُ فِي الْكَلَالَةِ، وَمَا أَغْلَظَ لِي فِي شَيْءٍ مَا أَغْلَظَ لِي فِيهِ، حَتَّى طَعَنَ بِإِصْبَعِهِ فِي صَدْرِي، وَقَالَ: يَا عُمَرُ، أَلَا تَكْفِيكَ آيَةُ الصَّيْفِ الَّتِي فِي آخِرِ سُورَةِ النِّسَاءِ، وَإِنِّي إِنْ أَعِشْ أَقْضِ فِيهَا بِقَضِيَّةٍ يَقْضِي بِهَا مَنْ يَقْرَأُ الْقُرْآنَ، وَمَنْ لَا يَقْرَأُ الْقُرْآنَ."
		},
		"chapter_id": "03b05631-d969-4223-bfff-ec0d346d98ed",
		"chapter_name": "",
		"title": {
			"en": "",
			"ms": "Bab pewarisan al-kalalah",
			"ar": "بَابُ مِيرَاثِ الْكَلَالَةِ"
		},
		"category_id": "e745872a-99ab-4e12-a649-3569b7b4986d",
		"category_name": "",
		"category_title": {
			"en": "Faraid Book",
			"ms": "Kitab Faraid",
			"ar": "كتاب الإيمان"
		},
		"book_name": "sahih_muslim",
		"book_title": "Sahih Muslim",
		"book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7"
	},
	{
		"id": "9ef4ee7d-ae94-4404-aed7-ba2d6a14e826",
		"name": "",
		"content": {
			"en": "",
			"ms": "(…) Abu Bakr bin Abu Shaibah menyampaikan kepada kami, dia berkata: Isma‘il bin ‘Ulayyah menyampaikan kepada kami, daripada Sa‘id bin Abu ‘Arubah. \n\n(ح) Dan Zuhair bin Harb, Ishaq bin Ibrahim serta Ibn Rafi‘ menyampaikan kepada kami, daripada Shababah bin Sawwar, daripada Shu‘bah, kedua-dua mereka daripada Qatadah dengan sanad ini semaknanya.",
			"ar": "(...) وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ، ح وحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَابْنُ رَافِعٍ، عَنْ شَبَابَةَ بْنِ سَوَّارٍ، عَنْ شُعْبَةَ، كِلَاهُمَا عَنْ قَتَادَةَ بِهَذَا الْإِسْنَادِ نَحْوَهُ."
		},
		"chapter_id": "03b05631-d969-4223-bfff-ec0d346d98ed",
		"chapter_name": "",
		"title": {
			"en": "",
			"ms": "Bab pewarisan al-kalalah",
			"ar": "بَابُ مِيرَاثِ الْكَلَالَةِ"
		},
		"category_id": "e745872a-99ab-4e12-a649-3569b7b4986d",
		"category_name": "",
		"category_title": {
			"en": "Faraid Book",
			"ms": "Kitab Faraid",
			"ar": "كتاب الإيمان"
		},
		"book_name": "sahih_muslim",
		"book_title": "Sahih Muslim",
		"book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7"
	},
	{
		"id": "20790c0a-6702-459d-a3fb-b279653743eb",
		"name": "",
		"content": {
			"en": "",
			"ms": "10- (1618) ‘Ali bin Khashram menyampaikan kepada kami, dia berkata: Waki‘ mengkhabarkan kepada kami, daripada Ibn Abu Khalid, daripada Abu Ishaq, daripada al-Bara’, beliau berkata: “Ayat terakhir diturunkan daripada al-Qur’an adalah: {Mereka (orang-orang Islam umatmu) meminta fatwa kepadamu (Wahai Muhammad mengenai masalah al-kalalah). Katakanlah: Allah memberi fatwa kepada kamu di dalam perkara al-Kalalah itu}. (al-Nisa’: 176).",
			"ar": "10- (1618) حَدَّثَنَا عَلِيُّ بْنُ خَشْرَمٍ، أَخْبَرَنَا وَكِيعٌ، عَنِ ابْنِ أَبِي خَالِدٍ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ، قَالَ: آخِرُ آيَةٍ أُنْزِلَتْ مِنَ الْقُرْآنِ: {يَسْتَفْتُونَكَ قُلِ اللهُ يُفْتِيكُمْ فِي الْكَلَالَةِ} [النساء: 176]."
		},
		"chapter_id": "b9e45fc9-1d85-4b82-8a9c-b1fdaf1f764c",
		"chapter_name": "",
		"title": {
			"en": "",
			"ms": "Bab ayat terakhir diturunkan adalah ayat al-kalalah",
			"ar": "بَابُ آخِرُ آيَةٍ أُنْزِلَتْ آيَةُ الْكَلَالَةِ"
		},
		"category_id": "e745872a-99ab-4e12-a649-3569b7b4986d",
		"category_name": "",
		"category_title": {
			"en": "Faraid Book",
			"ms": "Kitab Faraid",
			"ar": "كتاب الإيمان"
		},
		"book_name": "sahih_muslim",
		"book_title": "Sahih Muslim",
		"book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7"
	},
	{
		"id": "8169f3c3-d188-4036-a1b1-435315c87ac2",
		"name": "",
		"content": {
			"en": "",
			"ms": "11- (…) Muhammad bin al-Muthanna dan Ibn Bashshar menyampaikan kepada kami, kedua-dua mereka berkata: Muhammad bin Ja‘far menyampaikan kepada kami, dia berkata: Shu‘bah menyampaikan kepada kami, daripada Abu Ishaq dia berkata: Saya mendengar al-Bara' bin ‘Azib berkata: “Ayat terakhir diturunkan adalah ayat al-kalalah, sedangkan surah terakhir diturunkan adalah surah Bara’ah”. ",
			"ar": "11- (...) حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، قَالَ: سَمِعْتُ الْبَرَاءَ بْنَ عَازِبٍ، يَقُولُ: آخِرُ آيَةٍ أُنْزِلَتْ: آيَةُ الْكَلَالَةِ، وَآخِرُ سُورَةٍ أُنْزِلَتْ: بَرَاءَةُ."
		},
		"chapter_id": "b9e45fc9-1d85-4b82-8a9c-b1fdaf1f764c",
		"chapter_name": "",
		"title": {
			"en": "",
			"ms": "Bab ayat terakhir diturunkan adalah ayat al-kalalah",
			"ar": "بَابُ آخِرُ آيَةٍ أُنْزِلَتْ آيَةُ الْكَلَالَةِ"
		},
		"category_id": "e745872a-99ab-4e12-a649-3569b7b4986d",
		"category_name": "",
		"category_title": {
			"en": "Faraid Book",
			"ms": "Kitab Faraid",
			"ar": "كتاب الإيمان"
		},
		"book_name": "sahih_muslim",
		"book_title": "Sahih Muslim",
		"book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7"
	},
	{
		"id": "6865eace-a2f8-414f-b095-9372b61f1ff7",
		"name": "",
		"content": {
			"en": "",
			"ms": "12- (…) Ishaq bin Ibrahim al-Hanzali menyampaikan kepada kami, dia berkata: ‘Isa -dan dia adalah Ibn Yunus- mengkhabarkan kepada kami, dia berkata: Zakariyya menyampaikan kepada kami, daripada Abu Ishaq, daripada al-Bara’, bahawa surah terakhir diturunkan secara sempurna adalah surat al-Taubah, sedangkan ayat terakhir diturunkan adalah ayat al-Kalalah”.",
			"ar": "12- (...) حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا عِيسَى وَهُوَ ابْنُ يُونُسَ، حَدَّثَنَا زَكَرِيَّا، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ،  أَنَّ آخِرَ سُورَةٍ أُنْزِلَتْ تَامَّةً: سُورَةُ التَّوْبَةِ، وَأَنَّ آخِرَ آيَةٍ أُنْزِلَتْ: آيَةُ الْكَلَالَةِ."
		},
		"chapter_id": "b9e45fc9-1d85-4b82-8a9c-b1fdaf1f764c",
		"chapter_name": "",
		"title": {
			"en": "",
			"ms": "Bab ayat terakhir diturunkan adalah ayat al-kalalah",
			"ar": "بَابُ آخِرُ آيَةٍ أُنْزِلَتْ آيَةُ الْكَلَالَةِ"
		},
		"category_id": "e745872a-99ab-4e12-a649-3569b7b4986d",
		"category_name": "",
		"category_title": {
			"en": "Faraid Book",
			"ms": "Kitab Faraid",
			"ar": "كتاب الإيمان"
		},
		"book_name": "sahih_muslim",
		"book_title": "Sahih Muslim",
		"book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7"
	},
	{
		"id": "f98f7ca3-0212-40cd-84d0-ba13d2722e0d",
		"name": "",
		"content": {
			"en": "",
			"ms": "(…) Abu Kuraib menyampaikan kepada kami, dia berkata: Yahya -yakni Ibn Adam-, menyampaikan kepada kami, dia berkata: ‘Ammar -dan dia adalah Ibn Ruzaiq-, menyampaikan kepada kami, daripada Abu Ishaq, daripada al-Bara’ semisalnya, melainkan dia berkata: “Surah terakhir diturunkan secara lengkap”.",
			"ar": "(...) حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا يَحْيَى يَعْنِي ابْنَ آدَمَ، حَدَّثَنَا عَمَّارٌ وَهُوَ ابْنُ رُزَيْقٍ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ، بِمِثْلِهِ، غَيْرَ أَنَّهُ قَالَ: آخِرُ سُورَةٍ أُنْزِلَتْ كَامِلَةً."
		},
		"chapter_id": "b9e45fc9-1d85-4b82-8a9c-b1fdaf1f764c",
		"chapter_name": "",
		"title": {
			"en": "",
			"ms": "Bab ayat terakhir diturunkan adalah ayat al-kalalah",
			"ar": "بَابُ آخِرُ آيَةٍ أُنْزِلَتْ آيَةُ الْكَلَالَةِ"
		},
		"category_id": "e745872a-99ab-4e12-a649-3569b7b4986d",
		"category_name": "",
		"category_title": {
			"en": "Faraid Book",
			"ms": "Kitab Faraid",
			"ar": "كتاب الإيمان"
		},
		"book_name": "sahih_muslim",
		"book_title": "Sahih Muslim",
		"book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7"
	},
	{
		"id": "79480331-c2ed-4108-8792-509c4af019e5",
		"name": "",
		"content": {
			"en": "",
			"ms": "13- (…) ‘Amr al-Naqid menyampaikan kepada kami, dia berkata: Abu Ahmad al-Zubairi menyampaikan kepada kami, dia berkata: Malik bin Mighwal menyampaikan kepada kami, daripada Abu al-Safar, daripada al-Bara’, beliau berkata: Ayat terakhir diturunkan adalah: {Mereka meminta fatwa kepadamu}.",
			"ar": "13- (...) حَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ، حَدَّثَنَا مَالِكُ بْنُ مِغْوَلٍ، عَنْ أَبِي السَّفَرِ، عَنِ الْبَرَاءِ، قَالَ: آخِرُ آيَةٍ أُنْزِلَتْ: يَسْتَفْتُونَكَ."
		},
		"chapter_id": "b9e45fc9-1d85-4b82-8a9c-b1fdaf1f764c",
		"chapter_name": "",
		"title": {
			"en": "",
			"ms": "Bab ayat terakhir diturunkan adalah ayat al-kalalah",
			"ar": "بَابُ آخِرُ آيَةٍ أُنْزِلَتْ آيَةُ الْكَلَالَةِ"
		},
		"category_id": "e745872a-99ab-4e12-a649-3569b7b4986d",
		"category_name": "",
		"category_title": {
			"en": "Faraid Book",
			"ms": "Kitab Faraid",
			"ar": "كتاب الإيمان"
		},
		"book_name": "sahih_muslim",
		"book_title": "Sahih Muslim",
		"book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7"
	},
	{
		"id": "fbab077b-2cbf-438f-b38c-cc0d0b7f0253",
		"name": "",
		"content": {
			"en": "",
			"ms": "14- (1619) Zuhair bin Harb menyampaikan kepada saya, dia berkata: Abu Safwan al-Umawiyy menyampaikan kepada kami, daripada Yunus al-Aili, \n\n(ح) Dan Harmalah bin Yahya menyampaikan kepada saya dan lafaz tersebut adalah miliknya. Dia berkata: ‘Abdullah bin Wahb mengkhabarkan kepada kami, dia berkata: Yunus mengkhabarkan kepada saya, daripada Ibn Shihab, daripada Abu Salamah bin ‘Abd al-Rahman, daripada Abu Hurairah, bahawa Rasulullah ﷺ pernah dibawakan jenazah seorang lelaki yang berhutang, lalu Baginda bertanya: “Adakah dia telah meninggalkan sesuatu untuk melunaskan hutangnya?” Sekiranya disampaikan bahawa dia meninggalkan harta untuk melunaskan hutang, Baginda akan solat ke atasnya. Namun, jika tidak, Baginda bersabda: “Solatlah ke atas kawan kalian ini”. Tatkala Allah membuka kepada Baginda beberapa pembukaan wilayah, Baginda bersabda: “Saya lebih berhak ke atas orang-orang beriman berbanding diri mereka sendiri. Maka, sesiapa yang meninggal dunia sedangkan dia berhutang, maka tanggungjawab saya pelunasannya dan sesiapa yang meninggalkan harta warisan, maka ia adalah untuk ahli warisnya”.",
			"ar": "14- (1619) وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا أَبُو صَفْوَانَ الْأُمَوِيُّ، عَنْ يُونُسَ الْأَيْلِيِّ، ح وحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، وَاللَّفْظُ لَهُ، قَالَ: أَخْبَرَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، كَانَ يُؤْتَى بِالرَّجُلِ الْمَيِّتِ عَلَيْهِ الدَّيْنُ، فَيَسْأَلُ: هَلْ تَرَكَ لِدَيْنِهِ مِنْ قَضَاءٍ؟ فَإِنْ حُدِّثَ أَنَّهُ تَرَكَ وَفَاءً، صَلَّى عَلَيْهِ، وَإِلَّا، قَالَ: صَلُّوا عَلَى صَاحِبِكُمْ، فَلَمَّا فَتَحَ اللهُ عَلَيْهِ الْفُتُوحَ، قَالَ: أَنَا أَوْلَى بِالْمُؤْمِنِينَ مِنْ أَنْفُسِهِمْ، فَمَنْ تُوُفِّيَ وَعَلَيْهِ دَيْنٌ فَعَلَيَّ قَضَاؤُهُ، وَمَنْ تَرَكَ مَالًا فَهُوَ لِوَرَثَتِهِ."
		},
		"chapter_id": "80eef8fe-6129-4b60-a787-eba032e0e37b",
		"chapter_name": "",
		"title": {
			"en": "",
			"ms": "Bab sesiapa yang meninggalkan harta maka ia adalah untuk ahli warisnya",
			"ar": "بَابُ مَنْ تَرَكَ مَالًا فَلِوَرَثَتِهِ"
		},
		"category_id": "e745872a-99ab-4e12-a649-3569b7b4986d",
		"category_name": "",
		"category_title": {
			"en": "Faraid Book",
			"ms": "Kitab Faraid",
			"ar": "كتاب الإيمان"
		},
		"book_name": "sahih_muslim",
		"book_title": "Sahih Muslim",
		"book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7"
	},
	{
		"id": "d0749f54-230f-4d6d-afeb-3521552dc7a1",
		"name": "",
		"content": {
			"en": "",
			"ms": "(…) ‘Abd al-Malik bin Shu‘aib bin al-Laith menyampaikan kepada kami, dia berkata: bapa saya menyampaikan kepada saya, daripada datuk saya, dia berkata: ‘Uqail menyampaikan kepada saya. \n\n(ح) Dan Zuhair bin Harb menyampaikan kepada saya, dia berkata: Ya‘qub bin Ibrahim menyampaikan kepada kami, dia berkata: Anak saudara saya, Ibn Shihab menyampaikan kepada kami. \n\n(ح) Dan Ibn Numair menyampaikan kepada kami, dia berkata: bapa saya menyampaikan kepada kami, dia berkata: Ibn Abu Zi‘b menyampaikan kepada kami, kesemua mereka daripada al-Zuhri dengan sanad hadis ini.",
			"ar": "(...) حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، حَدَّثَنِي عُقَيْلٌ، ح وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا ابْنُ أَخِي ابْنِ شِهَابٍ، ح وحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، كُلُّهُمْ عَنِ الزُّهْرِيِّ، بِهَذَا الْإِسْنَادِ هَذَا الْحَدِيثَ."
		},
		"chapter_id": "80eef8fe-6129-4b60-a787-eba032e0e37b",
		"chapter_name": "",
		"title": {
			"en": "",
			"ms": "Bab sesiapa yang meninggalkan harta maka ia adalah untuk ahli warisnya",
			"ar": "بَابُ مَنْ تَرَكَ مَالًا فَلِوَرَثَتِهِ"
		},
		"category_id": "e745872a-99ab-4e12-a649-3569b7b4986d",
		"category_name": "",
		"category_title": {
			"en": "Faraid Book",
			"ms": "Kitab Faraid",
			"ar": "كتاب الإيمان"
		},
		"book_name": "sahih_muslim",
		"book_title": "Sahih Muslim",
		"book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7"
	},
	{
		"id": "ac3df0f2-e697-4ea4-a16a-d59833d55516",
		"name": "",
		"content": {
			"en": "",
			"ms": "15- (…) Muhammad bin Rafi‘ menyampaikan kepada saya, dia berkata: Shababah menyampaikan kepada kami, dia berkata: Warqa' menyampaikan kepada saya, daripada Abu al-Zinad, daripada al-A‘raj, daripada Abu Hurairah, daripada Nabi ﷺ, Baginda bersabda: “Demi Zat yang jiwa Muhammad berada di tangan-Nya, tidak ada seorang beriman di atas bumi ini melainkan saya adalah orang yang lebih berhak dengannya. Maka sesiapa sahaja dalam kalangan kalian meninggalkan hutang atau anak yang terabai maka saya adalah walinya. Dan sesiapa sahaja dalam kalangan kalian yang meninggalkan harta, maka ia adalah untuk ahli waris, siapa pun dia”.",
			"ar": "15- (...) حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا شَبَابَةُ، قَالَ: حَدَّثَنِي وَرْقَاءُ، عَنْ أَبِي الزِّنَادِ، عَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ، إِنْ عَلَى الْأَرْضِ مِنْ مُؤْمِنٍ إِلَّا أَنَا أَوْلَى النَّاسِ بِهِ، فَأَيُّكُمْ مَا تَرَكَ دَيْنًا، أَوْ ضَيَاعًا فَأَنَا مَوْلَاهُ، وَأَيُّكُمْ تَرَكَ مَالًا، فَإِلَى الْعَصَبَةِ مَنْ كَانَ."
		},
		"chapter_id": "80eef8fe-6129-4b60-a787-eba032e0e37b",
		"chapter_name": "",
		"title": {
			"en": "",
			"ms": "Bab sesiapa yang meninggalkan harta maka ia adalah untuk ahli warisnya",
			"ar": "بَابُ مَنْ تَرَكَ مَالًا فَلِوَرَثَتِهِ"
		},
		"category_id": "e745872a-99ab-4e12-a649-3569b7b4986d",
		"category_name": "",
		"category_title": {
			"en": "Faraid Book",
			"ms": "Kitab Faraid",
			"ar": "كتاب الإيمان"
		},
		"book_name": "sahih_muslim",
		"book_title": "Sahih Muslim",
		"book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7"
	},
	{
		"id": "11346e62-3fb7-4494-b6e7-b5be8762e36f",
		"name": "",
		"content": {
			"en": "",
			"ms": "16- (…) Muhammad bin Rafi‘ menyampaikan kepada kami, dia berkata: ‘Abd al-Razzaq menyampaikan kepada kami, dia berkata: Ma‘mar menyampaikan kepada kami, daripada Hammam bin Munabbih, dia berkata: Ini apa yang Abu Hurairah sampaikan kepada kami, daripada Rasulullah ﷺ, lalu dia (Hammam) menyebutkan beberapa hadis yang di antaranya adalah, dan Rasulullah ﷺ bersabda: “Saya adalah orang yang paling berhak ke atas diri orang-orang beriman dalam kitab Allah Azzawajalla, maka sesiapa sahaja dalam kalangan kalian meninggalkan hutang atau anak yang terabai maka panggillah saya kerana saya adalah walinya. Dan sesiapa sahaja dalam kalangan kalian meninggalkan harta, maka hendaklah didahulukan dengan hartanya, ahli warisnya, siapa pun dia”.",
			"ar": "16- (...) حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ: هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَذَكَرَ أَحَادِيثَ مِنْهَا، وَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: أَنَا أَوْلَى النَّاسِ بِالْمُؤْمِنِينَ فِي كِتَابِ اللهِ عَزَّ وَجَلَّ، فَأَيُّكُمْ مَا تَرَكَ دَيْنًا، أَوْ ضَيْعَةً، فَادْعُونِي فَأَنَا وَلِيُّهُ، وَأَيُّكُمْ مَا تَرَكَ مَالًا، فَلْيُؤْثَرْ بِمَالِهِ عَصَبَتُهُ مَنْ كَانَ."
		},
		"chapter_id": "80eef8fe-6129-4b60-a787-eba032e0e37b",
		"chapter_name": "",
		"title": {
			"en": "",
			"ms": "Bab sesiapa yang meninggalkan harta maka ia adalah untuk ahli warisnya",
			"ar": "بَابُ مَنْ تَرَكَ مَالًا فَلِوَرَثَتِهِ"
		},
		"category_id": "e745872a-99ab-4e12-a649-3569b7b4986d",
		"category_name": "",
		"category_title": {
			"en": "Faraid Book",
			"ms": "Kitab Faraid",
			"ar": "كتاب الإيمان"
		},
		"book_name": "sahih_muslim",
		"book_title": "Sahih Muslim",
		"book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7"
	},
	{
		"id": "df0e07c9-767c-4385-9eb4-345f61f0461f",
		"name": "",
		"content": {
			"en": "",
			"ms": "17- (…) ‘Ubaidullah bin Mu‘az al-‘Anbari menyampaikan kepada kami, dia berkata: Bapa saya menyampaikan kepada kami, dia berkata: Shu‘bah menyampaikan kepada kami, daripada ‘Adi bahawa: Dia mendengar Abu Hazim, daripada Abu Hurairah, daripada Nabi ﷺ, bahawa Baginda bersabda: “Sesiapa yang meninggalkan harta, maka ia adalah untuk ahli waris dan sesiapa yang meninggalkan keluarga, maka kepada kami”.",
			"ar": "17- (...) حَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ عَدِيٍّ، أَنَّهُ سَمِعَ أَبَا حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: مَنْ تَرَكَ مَالًا فَلِلْوَرَثَةِ، وَمَنْ تَرَكَ كَلًّا فَإِلَيْنَا."
		},
		"chapter_id": "80eef8fe-6129-4b60-a787-eba032e0e37b",
		"chapter_name": "",
		"title": {
			"en": "",
			"ms": "Bab sesiapa yang meninggalkan harta maka ia adalah untuk ahli warisnya",
			"ar": "بَابُ مَنْ تَرَكَ مَالًا فَلِوَرَثَتِهِ"
		},
		"category_id": "e745872a-99ab-4e12-a649-3569b7b4986d",
		"category_name": "",
		"category_title": {
			"en": "Faraid Book",
			"ms": "Kitab Faraid",
			"ar": "كتاب الإيمان"
		},
		"book_name": "sahih_muslim",
		"book_title": "Sahih Muslim",
		"book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7"
	},
	{
		"id": "25466855-4a65-4b58-90b4-c0d20c204f3f",
		"name": "",
		"content": {
			"en": "",
			"ms": "(…) Dan Abu Bakr bin Nafi‘ menyampaikan kepada saya, dia berkata: Ghundar menyampaikan kepada kami. \n\n(ح) Dan Zuhair bin Harb menyampaikan kepada saya, dia berkata: ‘Abd al-Rahman yakni Ibn Mahdi menyampaikan kepada kami, mereka berdua berkata: Shu‘bah menyampaikan kepada kami dengan sanad ini, melainkan dalam hadis Ghundar: “Dan sesiapa yang meninggalkan keluarga, saya telah menjadi walinya”.",
			"ar": "(...) وحَدَّثَنِيهِ أَبُو بَكْرِ بْنُ نَافِعٍ، حَدَّثَنَا غُنْدَرٌ، ح وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ يَعْنِي ابْنَ مَهْدِيٍّ، قَالَا: حَدَّثَنَا شُعْبَةُ، بِهَذَا الْإِسْنَادِ، غَيْرَ أَنَّ فِي حَدِيثِ غُنْدَرٍ: وَمَنْ تَرَكَ كَلًّا وَلِيتُهُ."
		},
		"chapter_id": "80eef8fe-6129-4b60-a787-eba032e0e37b",
		"chapter_name": "",
		"title": {
			"en": "",
			"ms": "Bab sesiapa yang meninggalkan harta maka ia adalah untuk ahli warisnya",
			"ar": "بَابُ مَنْ تَرَكَ مَالًا فَلِوَرَثَتِهِ"
		},
		"category_id": "e745872a-99ab-4e12-a649-3569b7b4986d",
		"category_name": "",
		"category_title": {
			"en": "Faraid Book",
			"ms": "Kitab Faraid",
			"ar": "كتاب الإيمان"
		},
		"book_name": "sahih_muslim",
		"book_title": "Sahih Muslim",
		"book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7"
	},
	{
		"id": "6af9b6f7-4c65-43f1-b48c-c485333dd3fd",
		"name": "",
		"content": {
			"en": "",
			"ms": "1. Abdullah bin Maslamah bin Qa‘nab al-Qa‘nabi menyampaikan kepada kami, beliau berkata: Abdul Aziz bin Muhammad menyampaikan kepada kami, daripada Muhammad bin ‘Amr, daripada Abu Salamah, bahawasanya al-Mughirah bin Syu‘bah h berkata, “Apabila Nabi g hendak buang air besar, baginda akan pergi ke tempat yang jauh.”",
			"ar": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ الْقَعْنَبِيّ، حَدَّثَنَا عَبْدُ الْعَزِيزِ - يَعْنِي ابْنَ مُحَمَّدٍ -، عَن مُحَمَّدٍ - يَعْنِي ابْنَ عَمْرٍو -، عَن أَبِي سَلَمَةَ، عَن الْمُغِيرَةِ بْنِ شُعْبَةَ، أَنَّ النَّبِيّ -صلى الله عليه وسلم- كَانَ إِذَا ذَهَبَ الْمَذْهَبَ أَبْعَدَ."
		},
		"chapter_id": "ff8a4422-be5f-43aa-84d5-320a134ac859",
		"chapter_name": "hajat_Chapter",
		"title": {
			"en": "",
			"ms": "Bab Menjauhi Orang Lain Ketika Menunaikan Hajat ",
			"ar": "باب التَّخَلِّي عِنْدَ قَضَاءِ الْحَاجَةِ"
		},
		"category_id": "0343a0c8-40a1-403f-b96b-dfeaed56985c",
		"category_name": "taharah",
		"category_title": {
			"en": "",
			"ms": "Kitab taharah",
			"ar": "أوَّلُ كِتَابِ الطهارة"
		},
		"book_name": "sunan_abi-daud",
		"book_title": "Sunan Abi Daud",
		"book_id": "52bc6caf-d46c-47e8-bdbb-a1452b721de9"
	},
	{
		"id": "9761945e-97b6-45ce-a869-4cfbdca83777",
		"name": "",
		"content": {
			"en": "",
			"ms": "2. Musaddad bin Musarhad menyampaikan kepada kami, beliau berkata: Isa bin Yunus dan Isma‘il bin Abdul Malik menyampaikan kepada kami, beliau berkata: Abu al-Zubayr mengkhabarkan kepada kami, daripada Jabir bin Abdullah k, beliau berkata, “Jika Nabi g hendak membuang air besar, baginda akan pergi hingga ke suatu tempat yang tiada siapa dapat melihat baginda.”",
			"ar": "حَدَّثَنَا مُسَدَّدُ بْنُ مُسَرْهَدٍ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، أَخْبَرَنَا إِسْمَاعِيلُ بْنُ عَبْدِ الْمَلِكِ، عَن أَبِي الزُّبَيْرِ، عَن جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ النَّبِيّ -صلى الله عليه وسلم- كَانَ إِذَا أَرَادَ الْبَرَازَ انْطَلَقَ حَتَّى لَا يَرَاهُ أَحَدٌ "
		},
		"chapter_id": "ff8a4422-be5f-43aa-84d5-320a134ac859",
		"chapter_name": "hajat_Chapter",
		"title": {
			"en": "",
			"ms": "Bab Menjauhi Orang Lain Ketika Menunaikan Hajat ",
			"ar": "باب التَّخَلِّي عِنْدَ قَضَاءِ الْحَاجَةِ"
		},
		"category_id": "0343a0c8-40a1-403f-b96b-dfeaed56985c",
		"category_name": "taharah",
		"category_title": {
			"en": "",
			"ms": "Kitab taharah",
			"ar": "أوَّلُ كِتَابِ الطهارة"
		},
		"book_name": "sunan_abi-daud",
		"book_title": "Sunan Abi Daud",
		"book_id": "52bc6caf-d46c-47e8-bdbb-a1452b721de9"
	},
	{
		"id": "fc632427-9182-49fd-b7d1-3ea5244c83bb",
		"name": "",
		"content": {
			"en": "",
			"ms": "3. Musa bin Isma‘il menyampaikan kepada kami, beliau berkata: Hammad menyampaikan kepada kami, beliau berkata: Abu al-Tayyah mengkhabarkan kepada kami, bahawa seorang syeikh menyampaikan kepada saya: Ketika Abdullah bin ‘Abbas k datang ke Basrah, diceritakan tentang Abu Musa, Abdullah kemudian menulis surat kepada Abu Musa untuk bertanya beberapa hal. \n\nAbu Musa membalas surat Ibn ‘Abbas yang isinya: Pada suatu hari, saya duduk bersama Rasulullah g. Tiba-tiba baginda ingin membuang air kecil. Baginda pergi ke sebuah tanah lembut dekat lantai dinding, lalu baginda menunaikan hajatnya. Setelah itu, baginda bersabda, “Jika salah seorang kalian ingin buang air kecil, hendaklah beliau mencari tanah yang lembut.”",
			"ar": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ،، أَخْبَرَنَا أَبُو التَّيَّاحِ، حَدَّثَنِي شَيْخٌ، قَالَ: لَمَّا قَدِمَ عَبْدُ اللَّهِ بْنُ عَبَّاسٍ الْبَصْرَةَ فَكَانَ يُحَدَّثُ، عَن أَبِي مُوسَى فَكَتَبَ عَبْدُ اللَّهِ إِلَى أَبِي مُوسَى يَسْأَلُهُ، عَن أَشْيَاءَ فَكَتَبَ إِلَيْهِ أَبُو مُوسَى إِنِّي كُنْتُ مَعَ رَسُولِ اللَّهِ -صلى الله عليه وسلم- ذَاتَ يَوْمٍ فَأَرَادَ أَنْ يَبُولَ فَأَتَى دَمِثًا فِي أَصْلِ جِدَارٍ فَبَالَ ثُمَّ قَالَ -صلى الله عليه وسلم- «إِذَا أَرَادَ أَحَدُكُمْ أَنْ يَبُولَ فَلْيَرْتَدْ لِبَوْلِهِ مَوْضِعًا»."
		},
		"chapter_id": "b3a6f4d3-5359-4c9a-b42a-9c99c9867150",
		"chapter_name": "place_chapter",
		"title": {
			"en": "",
			"ms": "Bab Seseorang Memilih Tempat Buang Air Kecil",
			"ar": "باب الرَّجُلِ يَتَبَوَّأُ لِبَوْلِهِ.ٍ"
		},
		"category_id": "0343a0c8-40a1-403f-b96b-dfeaed56985c",
		"category_name": "taharah",
		"category_title": {
			"en": "",
			"ms": "Kitab taharah",
			"ar": "أوَّلُ كِتَابِ الطهارة"
		},
		"book_name": "sunan_abi-daud",
		"book_title": "Sunan Abi Daud",
		"book_id": "52bc6caf-d46c-47e8-bdbb-a1452b721de9"
	},
	{
		"id": "29503f2c-06e8-468c-8046-f95817d1d4a9",
		"name": "",
		"content": {
			"en": "",
			"ms": "4. Musaddad bin Musarhad menyampaikan kepada kami, beliau berkata: Dari Hammad bin Zayd dan Abdul Warits, daripada Abdul Aziz bin Shuhayb bahawa Anas bin Malik berkata: Ketika Rasulullah g hendak masuk jamban – menurut riwayat Hammad: baginda mengucapkan, “Ya Allah, saya berlindung kepada-Mu...,” sementara menurut riwayat Abdul Warits, baginda mengucapkan, “Saya berlindung kepada Allah dari gangguan syaitan jantan dan syaitan betina.”",
			"ar": "حَدَّثَنَا مُسَدَّدُ بْنُ مُسَرْهَدٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ وَعَبْدُ الْوَارِثِ، عَن عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، عَن أَنَسِ بْنِ مَالِكٍ، قَالَ: كَانَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- إِذَا دَخَلَ الْخَلاَءَ - قَالَ، عَن حَمَّادٍ قَالَ «اللَّهُمَّ إِنِّي أَعُوذُ بِكَ». وَقَالَ، عَن عَبْدِ الْوَارِثِ - قَالَ «أَعُوذُ بِاللَّهِ مِنَ الْخُبُثِ وَالْخَبَائِثِ»."
		},
		"chapter_id": "e7c234cc-fc12-45c3-802d-b7bbedd583c5",
		"chapter_name": "supplication_chapter",
		"title": {
			"en": "",
			"ms": "Bab Doa Yang Dibaca Seseorang Ketika Masuk Jamban ",
			"ar": "باب مَا يَقُولُ الرَّجُلُ إِذَا دَخَلَ الْخَلاَءَ.ٍ"
		},
		"category_id": "0343a0c8-40a1-403f-b96b-dfeaed56985c",
		"category_name": "taharah",
		"category_title": {
			"en": "",
			"ms": "Kitab taharah",
			"ar": "أوَّلُ كِتَابِ الطهارة"
		},
		"book_name": "sunan_abi-daud",
		"book_title": "Sunan Abi Daud",
		"book_id": "52bc6caf-d46c-47e8-bdbb-a1452b721de9"
	},
	{
		"id": "a1af836e-6569-4c26-ac64-70863aae5fd6",
		"name": "",
		"content": {
			"en": "",
			"ms": "5. al-Hasan bin ‘Amr al-Sadusi menyampaikan kepada kami, daripada Waki‘, daripada Syu‘bah, daripada Abdul Aziz bin Shuhayb, daripada Anas tentang hadis ini; ketika Rasulullah g hendak masuk kamar kecil, baginda akan mengucapkan “Ya Allah sungguh saya berlindung kepada-Mu.” Syu‘bah meriwayatkan: Terkadang baginda membaca, “Saya berlindung kepada Allah.”\nWuhayb pula meriwayatkan daripada Abdul ‘Aziz dengan lafaz: Hendaklah orang yang masuk ke tandas memohon perlindungan kepada Allah.",
			"ar": "حَدَّثَنَا الْحَسَنُ بْنُ عَمْرٍو - يَعْنِي السَّدُوسِيّ -، حَدَّثَنَا وَكِيعٌ، عَن شُعْبَةَ، عَن عَبْدِ الْعَزِيزِ - هُوَ ابْنُ صُهَيْبٍ -، عَن أَنَسٍ، بِهَذَا الْحَدِيثِ: قَالَ «اللَّهُمَّ إِنِّي أَعُوذُ بِكَ». وَقَالَ شُعْبَةُ وَقَالَ مَرَّةً «أَعُوذُ بِاللَّهِ». وَقَالَ وُهَيْبٌ، عَن عَبْدِ الْعَزِيزِ «فَلْيَتَعَوَّذْ بِاللَّهِ»."
		},
		"chapter_id": "e7c234cc-fc12-45c3-802d-b7bbedd583c5",
		"chapter_name": "supplication_chapter",
		"title": {
			"en": "",
			"ms": "Bab Doa Yang Dibaca Seseorang Ketika Masuk Jamban ",
			"ar": "باب مَا يَقُولُ الرَّجُلُ إِذَا دَخَلَ الْخَلاَءَ.ٍ"
		},
		"category_id": "0343a0c8-40a1-403f-b96b-dfeaed56985c",
		"category_name": "taharah",
		"category_title": {
			"en": "",
			"ms": "Kitab taharah",
			"ar": "أوَّلُ كِتَابِ الطهارة"
		},
		"book_name": "sunan_abi-daud",
		"book_title": "Sunan Abi Daud",
		"book_id": "52bc6caf-d46c-47e8-bdbb-a1452b721de9"
	},
	{
		"id": "a1af836e-6569-4c26-ac64-70863aae5fd6",
		"name": "",
		"content": {
			"en": "",
			"ms": "6. ‘Amr bin Marzuq menyampaikan kepada kami, beliau berkata: Syu‘bah mengkhabarkan kepada kami, daripada Qatadah, daripada al-Nadhr bin Anas, daripada Zayd bin Arqam, daripada Rasulullah g, baginda bersabda, “Sungguh tempat-tempat buang air ini gemar didatangi syaitan. Maka jika seseorang kalian hendak masuk jamban, hendaklah dia mengucapkan, ‘Saya berlindung kepada Allah daripada gangguan syaitan jantan dan syaitan betina.’",
			"ar": "حَدَّثَنَا عَمْرُو بْنُ مَرْزُوقٍ، أَخْبَرَنَا شُعْبَةُ، عَن قَتَادَةَ، عَن النَّضْرِ بْنِ أَنَسٍ، عَن زَيْدِ بْنِ أَرْقَمَ، عَن رَسُولِ اللَّهِ -صلى الله عليه وسلم- قَالَ «إِنَّ هَذِهِ الْحُشُوشَ مُحْتَضَرَةٌ فَإِذَا أَتَى أَحَدُكُمُ الْخَلاَءَ فَلْيَقُلْ أَعُوذُ بِاللَّهِ مِنَ الْخُبُثِ وَالْخَبَائِثِ»."
		},
		"chapter_id": "e7c234cc-fc12-45c3-802d-b7bbedd583c5",
		"chapter_name": "supplication_chapter",
		"title": {
			"en": "",
			"ms": "Bab Doa Yang Dibaca Seseorang Ketika Masuk Jamban ",
			"ar": "باب مَا يَقُولُ الرَّجُلُ إِذَا دَخَلَ الْخَلاَءَ.ٍ"
		},
		"category_id": "0343a0c8-40a1-403f-b96b-dfeaed56985c",
		"category_name": "taharah",
		"category_title": {
			"en": "",
			"ms": "Kitab taharah",
			"ar": "أوَّلُ كِتَابِ الطهارة"
		},
		"book_name": "sunan_abi-daud",
		"book_title": "Sunan Abi Daud",
		"book_id": "52bc6caf-d46c-47e8-bdbb-a1452b721de9"
	},
	{
		"id": "f6863309-12cb-43fb-ab9f-0b8b77fbde87",
		"name": "",
		"content": {
			"en": "",
			"ms": "8. Abdullah bin Muhammad al-Nufayli menyampaikan kepada kami, beliau berkata: Ibn al-Mubarak menyampaikan kepada kami, daripada Muhammad bin ‘Ajlan, daripada al-Qa‘qa‘ bin Hakim, daripada Abu Shalih, daripada Abu Hurayrah, beliau berkata: Rasulullah g bersabda, “Saya umpama seorang bapa yang mendidik kamu semua. Jika kamu mahu buang air besar, janganlah kamu menghadap atau membelakangi kiblat. Jangan pula kamu beristinjak dengan tangan kanannya.” \nBaginda memerintahkan kami untuk beristinjak menggunakan tiga batu, dan melarang beristinjak dengan tinja binatang dan tulang yang rapuh.",
			"ar": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيّ، حَدَّثَنَا ابْنُ الْمُبَارَكِ، عَن مُحَمَّدِ بْنِ عَجْلاَنَ، عَن الْقَعْقَاعِ بْنِ حَكِيمٍ، عَن أَبِي صَالِحٍ، عَن أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- «إِنَّمَا أَنَا لَكُمْ بِمَنْزِلَةِ الْوَالِدِ أُعَلِّمُكُمْ فَإِذَا أَتَى أَحَدُكُمُ الْغَائِطَ فَلاَ يَسْتَقْبِلِ الْقِبْلَةَ وَلاَ يَسْتَدْبِرْهَا وَلاَ يَسْتَطِبْ بِيَمِينِهِ». وَكَانَ يَأْمُرُ بِثَلاَثَةِ أَحْجَارٍ وَيَنْهَى، عَن الرَّوْثِ وَالرِّمَّةِ."
		},
		"chapter_id": "d88a8b24-2a65-482b-b1ad-b3242db521ba",
		"chapter_name": "forbidden_chapter",
		"title": {
			"en": "",
			"ms": "Bab Larangan Menghadap Kiblat Ketika Buang Hajat",
			"ar": "باب كَرَاهِيَةِ اسْتِقْبَالِ الْقِبْلَةِ عِنْدَ قَضَاءِ الْحَاجَةِ.ٍ"
		},
		"category_id": "0343a0c8-40a1-403f-b96b-dfeaed56985c",
		"category_name": "taharah",
		"category_title": {
			"en": "",
			"ms": "Kitab taharah",
			"ar": "أوَّلُ كِتَابِ الطهارة"
		},
		"book_name": "sunan_abi-daud",
		"book_title": "Sunan Abi Daud",
		"book_id": "52bc6caf-d46c-47e8-bdbb-a1452b721de9"
	},
	{
		"id": "342acfc2-5963-4e98-9bdd-b7e16127b35c",
		"name": "",
		"content": {
			"en": "",
			"ms": "9. Musaddad bin Musarhad menyampaikan kepada kami, beliau berkata: Sufyan menyampaikan kepada kami, daripada al-Zuhri, daripada ‘Atha’ bin Yazid al-Laytsi, daripada Abu Ayyub secara riwayat, beliau berkata, “Jika kalian masuk jamban, usahlah menghadap ke arah kiblat, sama ada untuk buang air besar mahupun air kecil. Hendaklah kalian menghadap ke arah timur atau barat.” \nSuatu hari kami pergi ke Syam, kami dapati jamban-jamban di sana didirikan menghadap ke kiblat. Kami berpaling daripada arah itu dan beristighfar kepada Allah.",
			"ar": "حَدَّثَنَا مُسَدَّدُ بْنُ مُسَرْهَدٍ، حَدَّثَنَا سُفْيَانُ، عَن الزُّهْرِيّ، عَن عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيّ، عَن أَبِي أَيُّوبَ رِوَايَةً قَالَ «إِذَا أَتَيْتُمُ الْغَائِطَ فَلاَ تَسْتَقْبِلُوا الْقِبْلَةَ بِغَائِطٍ وَلاَ بَوْلٍ وَلَكِنْ شَرِّقُوا أَوْ غَرِّبُوا». فَقَدِمْنَا الشَّامَ فَوَجَدْنَا مَرَاحِيضَ قَدْ بُنِيَتْ قِبَلَ الْقِبْلَةِ فَكُنَّا نَنْحَرِفُ، عَنهَا وَنَسْتَغْفِرُ اللَّهَ."
		},
		"chapter_id": "d88a8b24-2a65-482b-b1ad-b3242db521ba",
		"chapter_name": "forbidden_chapter",
		"title": {
			"en": "",
			"ms": "Bab Larangan Menghadap Kiblat Ketika Buang Hajat",
			"ar": "باب كَرَاهِيَةِ اسْتِقْبَالِ الْقِبْلَةِ عِنْدَ قَضَاءِ الْحَاجَةِ.ٍ"
		},
		"category_id": "0343a0c8-40a1-403f-b96b-dfeaed56985c",
		"category_name": "taharah",
		"category_title": {
			"en": "",
			"ms": "Kitab taharah",
			"ar": "أوَّلُ كِتَابِ الطهارة"
		},
		"book_name": "sunan_abi-daud",
		"book_title": "Sunan Abi Daud",
		"book_id": "52bc6caf-d46c-47e8-bdbb-a1452b721de9"
	},
	{
		"id": "f7617d8e-29b1-4783-abd3-a41b82d71e71",
		"name": "",
		"content": {
			"en": "",
			"ms": "10. Musa bin Isma‘il menyampaikan kepada kami, beliau berkata: Wuhayb menyampaikan kepada kami, beliau berkata: ‘Amr bin Yahya menyampaikan kepada kami, daripada Abu Zayd, daripada Ma‘qil bin Abu Ma‘qil al-Asad h, beliau berkata, “Rasulullah g melarang kami daripada buang air kecil atau buang air besar sambil menghadap ke arah dua kiblat (Kaabah dan Baitul Maqdis).” \nAbu Dawud berkata: Abu Zayd adalah maula bani Tsa‘labah.",
			"ar": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا عَمْرُو بْنُ يَحْيَى، عَن أَبِي زَيْدٍ، عَن مَعْقِلِ بْنِ أَبِي مَعْقِلٍ الأَسَدِيّ قَالَ نَهَى رَسُولُ اللَّهِ -صلى الله عليه وسلم- أَنْ نَسْتَقْبِلَ الْقِبْلَتَيْنِ بِبَوْلٍ أَوْ غَائِطٍ. قَالَ أَبُو دَاوُدَ: وَأَبُو زَيْدٍ هُوَ مَوْلَى بَنِي ثَعْلَبَةَ."
		},
		"chapter_id": "d88a8b24-2a65-482b-b1ad-b3242db521ba",
		"chapter_name": "forbidden_chapter",
		"title": {
			"en": "",
			"ms": "Bab Larangan Menghadap Kiblat Ketika Buang Hajat",
			"ar": "باب كَرَاهِيَةِ اسْتِقْبَالِ الْقِبْلَةِ عِنْدَ قَضَاءِ الْحَاجَةِ.ٍ"
		},
		"category_id": "0343a0c8-40a1-403f-b96b-dfeaed56985c",
		"category_name": "taharah",
		"category_title": {
			"en": "",
			"ms": "Kitab taharah",
			"ar": "أوَّلُ كِتَابِ الطهارة"
		},
		"book_name": "sunan_abi-daud",
		"book_title": "Sunan Abi Daud",
		"book_id": "52bc6caf-d46c-47e8-bdbb-a1452b721de9"
	},
	{
		"id": "99686874-7b21-4972-a3ac-a0d78a8e8d1b",
		"name": "",
		"content": {
			"en": "",
			"ms": "Qutaybah bin Sa‘id mengkhabarkan kepada kami, katanya Sufyan menyampaikan kepada kami katanya, daripada al-Zuhri, daripada Abu Salamah, daripada Abu Hurayrah bahawa Nabi g bersabda, “Ketika salah seorang daripada kamu bangun daripada tidur, janganlah dia terus memasukkan tangannya ke dalam bekas air dia berwuduk sehinggalah dia membasuhnya sebanyak tiga kali dahulu, kerana setiap seorang daripada kamu tidak tahu di mana tangannya terletak malam tadi.”",
			"ar": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ: حَدَّثَنَا سُفْيَانُ، عَنْ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صَلَّى اللَّهُمَّ عَلَيْهِ وَسَلَّمَ قَالَ: إِذَا اسْتَيْقَظَ أَحَدُكُمْ مِنْ نَوْمِهِ، فَلَا يَغْمِسْ يَدَهُ فِي وَضُوئِهِ حَتَّى يَغْسِلَهَا ثَلَاثًا، فَإِنَّ أَحَدَكُمْ لَا يَدْرِي أَيْنَ بَاتَتْ يَدُهُ."
		},
		"chapter_id": "c061998e-5ed2-4a3d-af38-aab5c2f2ee5b",
		"chapter_name": "",
		"title": {
			"en": "",
			"ms": "Bab Bersugi Ketika Bangun Malam",
			"ar": "بَابُ السِّوَاكِ إِذَا قَامَ مِنَ اللَّيْلِ"
		},
		"category_id": "2cdae5e5-58d7-4815-af4d-f3c7e9f29fc3",
		"category_name": "taharah",
		"category_title": {
			"en": "",
			"ms": "Kitab bersuci",
			"ar": "كِتَابُ الطَّهَارَةِ"
		},
		"book_name": "sunan_an_nasai",
		"book_title": "Sunan An-Nasa’i",
		"book_id": "6dc30e76-a364-46ba-80a1-ba9713c80938"
	},
	{
		"id": "99ea19d0-85cc-4a3f-a055-08b22681be00",
		"name": "",
		"content": {
			"en": "",
			"ms": "2 – Ishaq bin Ibrahim dan Qutaybah bin Sa‘id mengkhabarkan kepada kami, daripada Jarir, daripada Manshur, daripada Abu Wai’l daripada Hudzayfah, katanya, “Ketika bangun pada waktu malam, Rasulullah g selalu membersihkan mulutnya dengan sugi.”",
			"ar": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ جَرِيرٍ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ حُذَيْفَةَ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِذَا قَامَ مِنَ اللَّيْلِ يَشُوصُ فَاهُ بِالسِّوَاكِ."
		},
		"chapter_id": "c061998e-5ed2-4a3d-af38-aab5c2f2ee5b",
		"chapter_name": "",
		"title": {
			"en": "",
			"ms": "Bab Bersugi Ketika Bangun Malam",
			"ar": "بَابُ السِّوَاكِ إِذَا قَامَ مِنَ اللَّيْلِ"
		},
		"category_id": "2cdae5e5-58d7-4815-af4d-f3c7e9f29fc3",
		"category_name": "taharah",
		"category_title": {
			"en": "",
			"ms": "Kitab bersuci",
			"ar": "كِتَابُ الطَّهَارَةِ"
		},
		"book_name": "sunan_an_nasai",
		"book_title": "Sunan An-Nasa’i",
		"book_id": "6dc30e76-a364-46ba-80a1-ba9713c80938"
	},
	{
		"id": "c7f58c39-5472-4efe-9740-127e8a252e75",
		"name": "",
		"content": {
			"en": "",
			"ms": "3 – Ahmad bin ‘Abdah mengkhabarkan kepada kami, katanya Hammad bin Zayd menyampaikan kepada kami, katanya Ghaylan bin Jarir mengkhabarkan kepada kami, daripada Abu Burdah, daripada Abu Musa, katanya, “Saya pernah menemui Rasulullah g dalam keadaan baginda sedang bersugi. Ketika itu, hujung sugi itu terlihat ada di lidah baginda sambil baginda mengeluarkan suara “‘A’,‘A’.”",
			"ar": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدَةَ قَالَ: حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ قَالَ: أَخْبَرَنَا غَيْلَانُ بْنُ جَرِيرٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى قَالَ: \"دَخَلْتُ عَلَى رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَسْتَنُّ وَطَرَفُ السِّوَاكِ عَلَى لِسَانِهِ وَهُوَ يَقُولُ: عَأْ عَأْ."
		},
		"chapter_id": "873dd3e4-5961-448c-9305-a6ffaf3e82f7",
		"chapter_name": "",
		"title": {
			"en": "",
			"ms": "Bab Tatacara Bersugi",
			"ar": "بَابُ كَيْفَ يَسْتَاكُِ"
		},
		"category_id": "2cdae5e5-58d7-4815-af4d-f3c7e9f29fc3",
		"category_name": "taharah",
		"category_title": {
			"en": "",
			"ms": "Kitab bersuci",
			"ar": "كِتَابُ الطَّهَارَةِ"
		},
		"book_name": "sunan_an_nasai",
		"book_title": "Sunan An-Nasa’i",
		"book_id": "6dc30e76-a364-46ba-80a1-ba9713c80938"
	},
	{
		"id": "18476997-2306-4306-9c35-5724782d68f9",
		"name": "",
		"content": {
			"en": "",
			"ms": "4 – ‘Amr bin ‘Ali mengkhabarkan kepada kami, Yahya bin Sa‘id menyampaikan kepada kami, katanya Qurrah bin Khalid menyampaikan kepada kami, katanya Humayd bin Hilal menyampaikan kepada kami, katanya Abu Burdah menyampaikan kepada saya, daripada Abu Musa, beliau berkata, “Saya pernah menghadap Rasulullah g bersama dua orang lelaki daripada Kabilah Asy‘ar. Salah seorang daripada mereka berdua ketika berada di sebelah kanan saya, manakala yang seorang lagi berada di sebelah kiri saya. Ketika itu, Rasulullah g sedang bersugi. Kedua-dua lelaki tersebut hendak meminta kerja. Saya pun berkata, “Demi Allah yang mengutusmu sebagai Nabi dengan  membawa kebenaran. Kedua-dua orang ini tidak memberitahu saya tentang apa yang mereka simpan di dalam hati mereka (apa yang mereka hajatkan). Saya juga tidak tahu sebenarnya mereka ingin meminta pekerjaan (jawatan).” Saya melihat seolah-olah sugi baginda berada di bawah bibir baginda dalam keadaan melekat lalu baginda bersabda, “Sungguh, kami tidak – atau tidak akan – meminta pertolongan (dengan memberikan jawatan) kepada orang yang memintanya. Akan tetapi, pergilah engkau (Abu Musa).” Akhirnya baginda mengutuskan Abu Musa ke Yaman. Kemudian baginda mengutus Mu‘adz bin Jabal k untuk mengikutinya.”",
			"ar": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا يَحْيَى وَهُوَ ابْنُ سَعِيدٍ قَالَ: حَدَّثَنَا قُرَّةُ بْنُ خَالِدٍ قَالَ: حَدَّثَنَا حُمَيْدُ بْنُ هِلَالٍ قَالَ: حَدَّثَنِي أَبُو بُرْدَةَ، عَنْ أَبِي مُوسَى قَالَ: أَقْبَلْتُ إِلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَمَعِي رَجُلَانِ مِنَ الْأَشْعَرِيِّينَ: أَحَدُهُمَا عَنْ يَمِينِي، وَالْآخَرُ عَنْ يَسَارِي. وَرَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَسْتَاكُ فَكِلَاهُمَا سَأَلَ الْعَمَلَ. قُلْتُ: وَالَّذِي بَعَثَكَ بِالْحَقِّ نَبِيًّا مَا أَطْلَعَانِي عَلَى مَا فِي أَنْفُسِهِمَا، وَمَا شَعَرْتُ أَنَّهُمَا يَطْلُبَانِ الْعَمَلَ، فَكَأَنِّي أَنْظُرُ إِلَى سِوَاكِهِ تَحْتَ شَفَتِهِ قَلَصَتْ. فَقَالَ: إِنَّا لَا - أَوْ لنْ - نَسْتَعِينَ عَلَى الْعَمَلِ مَنْ أَرَادَهُ، وَلَكِنِ اذْهَبْ أَنْتَ. فَبَعَثَهُ عَلَى الْيَمَنِ، ثُمَّ أَرْدَفَهُ مُعَاذُ بْنُ جَبَلٍ رَضِيَ اللَّهُ عَنْهُمَا."
		},
		"chapter_id": "42221e53-40e0-491d-9ec4-3eb292432eb3",
		"chapter_name": "",
		"title": {
			"en": "",
			"ms": "Bab Pemimpin Bersugi Di Hadapan Rakyatnya",
			"ar": "بَابُ هَلْ يَسْتَاكُ الْإِمَامُ بِحَضْرَةِ رَعِيَّتِهِ؟"
		},
		"category_id": "2cdae5e5-58d7-4815-af4d-f3c7e9f29fc3",
		"category_name": "taharah",
		"category_title": {
			"en": "",
			"ms": "Kitab bersuci",
			"ar": "كِتَابُ الطَّهَارَةِ"
		},
		"book_name": "sunan_an_nasai",
		"book_title": "Sunan An-Nasa’i",
		"book_id": "6dc30e76-a364-46ba-80a1-ba9713c80938"
	},
	{
		"id": "4012d2c1-6aaf-4d74-a51b-af0c0b2f3bd2",
		"name": "",
		"content": {
			"en": "",
			"ms": "5 – Humayd bin Mas‘adah dan Muhammad bin ‘Abdul ‘A’la mengkhabarkan kepada kami, daripada Yazid bin Zuray‘, katanya, Abdul Rahman bin Abu ‘Atiq menyampaikan kepada saya, katanya ayah saya menyampaikan kepada saya, katanya saya mendengar ‘A’isyah berkata daripada Nabi g, baginda bersabda, “Sugi itu merupakan pembersih mulut. Ia juga merupakan salah satu jalan untuk mendapat reda Allah.”",
			"ar": "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، وَمُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى، عَنْ يَزِيدَ وَهُوَ ابْنُ زُرَيْعٍ قَالَ: حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ أَبِي عَتِيقٍ قَالَ: حَدَّثَنِي أَبِي قَالَ: سَمِعْتُ عَائِشَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: السِّوَاكُ مَطْهَرَةٌ لِلْفَمِ مَرْضَاةٌ لِلرَّبِّ"
		},
		"chapter_id": "2f1b573f-59cd-4e58-bea8-13c5a574f26b",
		"chapter_name": "",
		"title": {
			"en": "",
			"ms": "Bab Anjuran Bersugi",
			"ar": "بَابُ التَّرْغِيبِ فِي السِّوَاكِ"
		},
		"category_id": "2cdae5e5-58d7-4815-af4d-f3c7e9f29fc3",
		"category_name": "taharah",
		"category_title": {
			"en": "",
			"ms": "Kitab bersuci",
			"ar": "كِتَابُ الطَّهَارَةِ"
		},
		"book_name": "sunan_an_nasai",
		"book_title": "Sunan An-Nasa’i",
		"book_id": "6dc30e76-a364-46ba-80a1-ba9713c80938"
	},
	{
		"id": "c8aa5279-30a0-4a1b-9fdb-5db0fa8514eb",
		"name": "",
		"content": {
			"en": "",
			"ms": "6 – Humayd bin Mas‘adah dan ‘Imran bin Musa meriwayatkan, ‘Abdul Warits menyampaikan kepada kami, katanya Syu‘ayb bin al-Habhab menyampaikan kepada kami, daripada Anas bin Malik, beliau berkata, Rasulullah g bersabda, “Saya benar-benar sudah banyak kali anjurkan kamu bersugi.”",
			"ar": "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، وَعِمْرَانُ بْنُ مُوسَى قَالَا: حَدَّثَنَا عَبْدُ الْوَارِثِ قَالَ: حَدَّثَنَا شُعَيْبُ بْنُ الْحَبْحَابِ، عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: قَدْ أَكْثَرْتُ عَلَيْكُمْ فِي السِّوَاكِ.ِّ"
		},
		"chapter_id": "6ea9c545-a5f5-4bae-bfba-c10d1119ac16",
		"chapter_name": "",
		"title": {
			"en": "",
			"ms": "Bab Anjuran Memperbanyakkan Bersugi",
			"ar": "الْإِكْثَارُ فِي السِّوَاكِِ"
		},
		"category_id": "2cdae5e5-58d7-4815-af4d-f3c7e9f29fc3",
		"category_name": "taharah",
		"category_title": {
			"en": "",
			"ms": "Kitab bersuci",
			"ar": "كِتَابُ الطَّهَارَةِ"
		},
		"book_name": "sunan_an_nasai",
		"book_title": "Sunan An-Nasa’i",
		"book_id": "6dc30e76-a364-46ba-80a1-ba9713c80938"
	},
	{
		"id": "fa9f70a8-7a98-47ba-8c5c-af0ffab5a53d",
		"name": "",
		"content": {
			"en": "",
			"ms": "7 – Qutaybah bin Sa‘id mengkhabarkan kepada kami, daripada Malik, daripada Abu al-Zinad, daripada al-‘A’raj, daripada Abu Hurayrah, bahawa Rasulullah g bersabda, “Sekiranya saya tidak bimbang ia akan membebankan umat saya, nescaya saya akan memerintahkan mereka untuk bersugi setiap kali hendak menunaikan solat.”",
			"ar": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: لَوْلَا أَنْ أَشُقَّ عَلَى أُمَّتِي لَأَمَرْتُهُمْ بِالسِّوَاكِ عِنْدَ كُلِّ صَلَاةٍ.ِّ"
		},
		"chapter_id": "bb608b80-69b2-438b-9d5e-8042055bae72",
		"chapter_name": "",
		"title": {
			"en": "",
			"ms": "Kelonggaran Bersugi Pada Waktu Petang Bagi Orang Yang Berpuasa",
			"ar": "الرُّخْصَةُ فِي السِّوَاكِ بِالْعَشِيِّ لِلصَّائِمِ"
		},
		"category_id": "2cdae5e5-58d7-4815-af4d-f3c7e9f29fc3",
		"category_name": "taharah",
		"category_title": {
			"en": "",
			"ms": "Kitab bersuci",
			"ar": "كِتَابُ الطَّهَارَةِ"
		},
		"book_name": "sunan_an_nasai",
		"book_title": "Sunan An-Nasa’i",
		"book_id": "6dc30e76-a364-46ba-80a1-ba9713c80938"
	},
	{
		"id": "2ab68be6-a4f4-4f36-8f32-a409d0ac4b40",
		"name": "",
		"content": {
			"en": "",
			"ms": "8 –\t‘Ali bin Khasyram mengkhabarkan kepada kami, katanya ‘Isa bin Yunus menyampaikan kepada kami, daripada Mis‘ar, daripada al-Miqdam bin Syurayh daripada ayahnya, katanya, “Saya berkata kepada ‘A’isyah, “Apakah perkara pertama yang biasa dilakukan oleh Rasulullah g setelah masuk ke dalam rumahnya?” Beliau menjawab, “Bersugi.”",
			"ar": "أَخْبَرَنَا عَلِيُّ بْنُ خَشْرَمٍ قَالَ: حَدَّثَنَا عِيسَى وَهُوَ ابْنُ يُونُسَ، عَنْ مِسْعَرٍ، عَنِ الْمِقْدَامِ وَهُوَ ابْنُ شُرَيْحٍ، عَنْ أَبِيهِ قَالَ: قُلْتُ لِعَائِشَةَ بِأَيِّ شَيْءٍ كَانَ يَبْدَأُ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِذَا دَخَلَ بَيْتَهُ؟ قَالَتْ: بِالسِّوَاكِ"
		},
		"chapter_id": "7c4cb579-ddcb-4296-8b85-2e319c1a2f34",
		"chapter_name": "",
		"title": {
			"en": "",
			"ms": "Bab Bersugi Pada Setiap Waktu",
			"ar": "السِّوَاكُ فِي كُلِّ حِينٍِ"
		},
		"category_id": "2cdae5e5-58d7-4815-af4d-f3c7e9f29fc3",
		"category_name": "taharah",
		"category_title": {
			"en": "",
			"ms": "Kitab bersuci",
			"ar": "كِتَابُ الطَّهَارَةِ"
		},
		"book_name": "sunan_an_nasai",
		"book_title": "Sunan An-Nasa’i",
		"book_id": "6dc30e76-a364-46ba-80a1-ba9713c80938"
	},
	{
		"id": "c25016d7-ef99-47de-97d7-1971b6eb91e4",
		"name": "",
		"content": {
			"en": "",
			"ms": "9 – Al-Harits bin Miskin mengkhabarkan kepada kami secara bacaan di hadapannya dalam keadaan saya mendengar, daripada Ibn Wahb, daripada Yunus, daripada Ibn Syihab, daripada Sa‘id bin al-Musayyib, daripada Abu Hurayrah, daripada Rasulullah g, baginda bersabda, “Fitrah itu ada lima, iaitu berkhatan, mencukur bulu kemaluan, memotong misai, memotong kuku dan mencabut bulu ketiak.”",
			"ar": "أَخْبَرَنَا الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، عَنِ ابْنِ وَهْبٍ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: \"الْفِطْرَةُ خَمْسٌ: الِاخْتِتَانُ، وَالِاسْتِحْدَادُ، وَقَصُّ الشَّارِبِ، وَتَقْلِيمُ الْأَظْفَارِ، وَنَتْفُ الْإِبْطِ\"ِ"
		},
		"chapter_id": "19f5618a-02cc-4333-afc4-8e464a1d809a",
		"chapter_name": "",
		"title": {
			"en": "",
			"ms": "Berkhatan",
			"ar": "الِاخْتِتَانُ"
		},
		"category_id": "2cdae5e5-58d7-4815-af4d-f3c7e9f29fc3",
		"category_name": "taharah",
		"category_title": {
			"en": "",
			"ms": "Kitab bersuci",
			"ar": "كِتَابُ الطَّهَارَةِ"
		},
		"book_name": "sunan_an_nasai",
		"book_title": "Sunan An-Nasa’i",
		"book_id": "6dc30e76-a364-46ba-80a1-ba9713c80938"
	},
	{
		"id": "c25016d7-ef99-47de-97d7-1971b6eb91e4",
		"name": "",
		"content": {
			"en": "",
			"ms": "10 – \tMuhammad bin ‘Abdul ‘A’la mengkhabarkan kepada kami, katanya al-Mu‘tamir menyampaikan kepada kami, katanya saya mendengar Ma‘mar berkata daripada al-Zuhri, daripada Sa‘id bin al-Musayyib, daripada Abu Hurayrah, beliau berkata Rasulullah g bersabda, “Ada lima perkara yang termasuk dalam fitrah.\n\n 1. Memotong misai \n\n 2. Mencabut bulu ketiak\n\n 3. Memotong kuku\n\n 4. Mencukur bulu ari-ari \n\n 5. Berkhatan.",
			"ar": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ: حَدَّثَنَا الْمُعْتَمِرُ قَالَ: سَمِعْتُ مَعْمَرًا، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ \"خَمْسٌ مِنَ الْفِطْرَةِ: قَصُّ الشَّارِبِ، وَنَتْفُ الْإِبْطِ، وَتَقْلِيمُ الْأَظْفَارِ، وَالِاسْتِحْدَادُ، وَالْخِتَانُ\"."
		},
		"chapter_id": "a6079475-efba-474c-a20f-8530ffd4a5dc",
		"chapter_name": "",
		"title": {
			"en": "",
			"ms": "Bab Memotong Kuku",
			"ar": "تَقْلِيمُ الْأَظْفَارِ"
		},
		"category_id": "2cdae5e5-58d7-4815-af4d-f3c7e9f29fc3",
		"category_name": "taharah",
		"category_title": {
			"en": "",
			"ms": "Kitab bersuci",
			"ar": "كِتَابُ الطَّهَارَةِ"
		},
		"book_name": "sunan_an_nasai",
		"book_title": "Sunan An-Nasa’i",
		"book_id": "6dc30e76-a364-46ba-80a1-ba9713c80938"
	},
	{
		"id": "1bdbf96e-8053-47c7-a989-5ea33b6221d3",
		"name": "",
		"content": {
			"en": "",
			"ms": "1 - Abu Bakar bin Abu Syaybah menyampaikan kepada kami, berkata, Syarik menyampaikan kepada kami, daripada al-A‘masy, daripada Abu Shalih, daripada Abu Hurayrah, berkata, Rasulullah g bersabda: “Apa yang saya perintahkan maka ambillah, dan apa yang saya larang maka tinggalkanlah.”",
			"ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، حَدَّثَنَا شَرِيكٌ ، عَنِ الأَعْمَشِ ، عَنْ أَبِي صَالِحٍ ، عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ ، قَالَ : قَالَ رَسُولُ اللهِ صَلَّى الله عَليْهِ وسَلَّمَ : مَا أَمَرْتُكُمْ بِهِ فَخُذُوهُ ، وَمَا نَهَيْتُكُمْ عَنْهُ فَانْتَهُوا."
		},
		"chapter_id": "4750419c-436d-4a9c-8e4e-9d0cf53661a4",
		"chapter_name": "",
		"title": {
			"en": "",
			"ms": "Bab Mengikuti Sunnah Rasulullah",
			"ar": "بَابُ اتباع سُنَّةِ رَسُولِ اللهِ صَلَّى الله عَليْهِ وسَلَّمَ"
		},
		"category_id": "983ef3cd-b1ff-436b-be68-828761e124fe",
		"category_name": "kitab",
		"category_title": {
			"en": "",
			"ms": "Kitab 1",
			"ar": "كِتَابُ"
		},
		"book_name": "sunan_ibnu_majah",
		"book_title": "Sunan Ibnu Majah",
		"book_id": "3b91daa1-acf3-4841-a38a-b1d576396e6c"
	},
	{
		"id": "365ccfc2-2a45-4b19-8412-56994e191493",
		"name": "",
		"content": {
			"en": "",
			"ms": "2 - Muhammad bin al-Shabbah menyampaikan kepada kami, berkata, Jarir mengkhabarkan  kepada kami, daripada al-A‘masy, daripada Abu Shalih, daripada Abu Hurayrah, berkata, Rasulullah g bersabda: “Biarkanlah apa yang telah saya tinggalkan untuk kamu semua. Sesungguhnya orang-orang sebelum kamu semua binasa kerana pertanyaan dan perselisihan mereka kepada para Nabi mereka. Jika saya perintahkan kepada kamu semua melakukan suatu perkara, maka laksanakanlah semampu kamu semua, dan jika saya melarang kamu semua tentang suatu perkara, maka jauhilah.”",
			"ar": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ ، أَخْبَرَنَا جَرِيرٌ ، عَنِ الأَعْمَشِ ، عَنْ أَبِي صَالِحٍ ، عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ ، قَالَ : قَالَ رَسُولُ اللهِ صَلَّى الله عَليْهِ وسَلَّمَ : ذَرُونِي مَا تَرَكْتُكُمْ ، فَإِنَّمَا هَلَكَ مَنْ كَانَ قَبْلَكُمْ بِسُؤَالِهِمْ وَاخْتِلاَفِهِمْ عَلَى أَنْبِيَائِهِمْ ، فَإِذَا أَمَرْتُكُمْ بِشَيْءٍ فَخُذُوا مِنْهُ مَا اسْتَطَعْتُمْ ، وَإِذَا نَهَيْتُكُمْ عَنْ شَيْءٍ فَانْتَهُوا."
		},
		"chapter_id": "4750419c-436d-4a9c-8e4e-9d0cf53661a4",
		"chapter_name": "",
		"title": {
			"en": "",
			"ms": "Bab Mengikuti Sunnah Rasulullah",
			"ar": "بَابُ اتباع سُنَّةِ رَسُولِ اللهِ صَلَّى الله عَليْهِ وسَلَّمَ"
		},
		"category_id": "983ef3cd-b1ff-436b-be68-828761e124fe",
		"category_name": "kitab",
		"category_title": {
			"en": "",
			"ms": "Kitab 1",
			"ar": "كِتَابُ"
		},
		"book_name": "sunan_ibnu_majah",
		"book_title": "Sunan Ibnu Majah",
		"book_id": "3b91daa1-acf3-4841-a38a-b1d576396e6c"
	},
	{
		"id": "0c05b857-58c4-4786-8322-c5d2aa4cc191",
		"name": "",
		"content": {
			"en": "",
			"ms": "3 - Abu Bakar  bin Abu Syaybah menyampaikan kepada kamim berkata, Abu Mu‘awiyah dan Waki‘ menyampaikan kepada kami, daripada al-A‘masy, daripada Abu Shalih, daripada Abu Hurayrah, berkata, Rasulullah bersabda: “Sesiapa mentaati saya, maka dia taat kepada Allah dan sesiapa derhaka kepada saya, maka dia telah derhaka kepada Allah.“",
			"ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، حَدَّثَنَا أَبُو مُعَاوِيَةَ ، وَوَكِيعٌ ، عَنِ الأَعْمَشِ ، عَنْ أَبِي صَالِحٍ ، عَنْ أَبِي هُرَيْرَةَ ، قَالَ : قَالَ رَسُولُ اللهِ صَلَّى الله عَليْهِ وسَلَّمَ : مَنْ أَطَاعَنِي فَقَدْ أَطَاعَ اللَّهَ ، وَمَنْ عَصَانِي فَقَدْ عَصَى اللَّهَ."
		},
		"chapter_id": "4750419c-436d-4a9c-8e4e-9d0cf53661a4",
		"chapter_name": "",
		"title": {
			"en": "",
			"ms": "Bab Mengikuti Sunnah Rasulullah",
			"ar": "بَابُ اتباع سُنَّةِ رَسُولِ اللهِ صَلَّى الله عَليْهِ وسَلَّمَ"
		},
		"category_id": "983ef3cd-b1ff-436b-be68-828761e124fe",
		"category_name": "kitab",
		"category_title": {
			"en": "",
			"ms": "Kitab 1",
			"ar": "كِتَابُ"
		},
		"book_name": "sunan_ibnu_majah",
		"book_title": "Sunan Ibnu Majah",
		"book_id": "3b91daa1-acf3-4841-a38a-b1d576396e6c"
	},
	{
		"id": "6f04de50-776f-4d26-b88b-c6e1110489fb",
		"name": "",
		"content": {
			"en": "",
			"ms": "Muhammad bin ‘Abdullah bin Numayr menyampaikan kepada kami, berkata, Zakariyya’ bin ‘Adiyy menyampaikan kepada kami, daripada Ibn al-Mubarak, daripada Muhammad bin Suqah, daripada Abu Ja‘far, berkata, “Apabila Ibn ‘Umar mendengar sebuah hadits daripada Rasulullah, dia tidak melengahkannya dan tidak pula sibuk dengan perkara yang lain.”",
			"ar": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ ، حَدَّثَنَا زَكَرِيَّا بْنُ عَدِيٍّ ، عَنِ ابْنِ الْمُبَارَكِ ، عَنْ مُحَمَّدِ بْنِ سُوقَةَ ، عَنْ أَبِي جَعْفَرٍ , قَالَ : كَانَ ابْنُ عُمَرَ إِذَا سَمِعَ مِنْ رَسُولِ اللهِ صَلَّى الله عَليْهِ وسَلَّمَ حَدِيثًا لَمْ يَعْدُهُ ، وَلَمْ يُقَصِّرْ دُونَهُ."
		},
		"chapter_id": "4750419c-436d-4a9c-8e4e-9d0cf53661a4",
		"chapter_name": "",
		"title": {
			"en": "",
			"ms": "Bab Mengikuti Sunnah Rasulullah",
			"ar": "بَابُ اتباع سُنَّةِ رَسُولِ اللهِ صَلَّى الله عَليْهِ وسَلَّمَ"
		},
		"category_id": "983ef3cd-b1ff-436b-be68-828761e124fe",
		"category_name": "kitab",
		"category_title": {
			"en": "",
			"ms": "Kitab 1",
			"ar": "كِتَابُ"
		},
		"book_name": "sunan_ibnu_majah",
		"book_title": "Sunan Ibnu Majah",
		"book_id": "3b91daa1-acf3-4841-a38a-b1d576396e6c"
	},
	{
		"id": "c49ac137-4589-4114-9527-d2629b757785",
		"name": "",
		"content": {
			"en": "",
			"ms": "5 - Hisyam bin ‘Ammar al-Dimasyqi menyampaikan kepada kami, berkata, Muhammad bin ‘Isa bin Sumay‘ menyampaikan kepada kami, berkata, Ibrahim bin Sulayman al-Afthas menyampaikan kepada kami, daripada al-Walid bin ‘Abd al-Rahman al-Jurasyi, daripada Jubayr bin Nufayr, daripada Abu al-Darda’, berkata, “Rasulullah g keluar menemui kami, sementara kami sedang membincangkan masalah kefakiran dan kami merasa takut dengannya. Lalu Baginda bersabda: “Adakah kamu semua takut kepada kemiskinan? Demi Zat yang jiwa saya berada di tangan-Nya, sungguh akan diberikan kepada kamu semua dunia, sehingga hati salah seorang daripada kamu semua tidak dapat berpaling kecuali akan menemuinya. Sungguh, telah saya tinggalkan untuk kamu semua perkara dengan jelas terang-benderang, malam dan siangnya sama.” \nAbu al-Darda’ berkata, “Demi Allah benar, Rasulullah g telah meninggalkan bagi kita perkara yang terang-benderang, malam dan siangnya sama.”",
			"ar": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ الدِّمَشْقِيُّ ، حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى بْنِ سُمَيْعٍ ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سُلَيْمَانَ الأَفْطَسُ ، عَنِ الْوَلِيدِ بْنِ عَبْدِ الرَّحْمَنِ الْجُرَشِيِّ ، عَنْ جُبَيْرِ بْنِ نُفَيْرٍ ، عَنْ أَبِي الدَّرْدَاءِ ، قَالَ : خَرَجَ عَلَيْنَا رَسُولُ اللهِ صَلَّى الله عَليْهِ وسَلَّمَ وَنَحْنُ نَذْكُرُ الْفَقْرَ وَنَتَخَوَّفُهُ ، فَقَالَ : آلْفَقْرَ تَخَافُونَ ؟ وَالَّذِي نَفْسِي بِيَدِهِ ، لَتُصَبَّنَّ عَلَيْكُمُ الدُّنْيَا صَبًّا ، حَتَّى لاَ يُزِيغَ قَلْبَ أَحَدِكُمْ إِزَاغَةً إِلاَّ هِيَهْ ، وَايْمُ اللهِ ، لَقَدْ تَرَكْتُكُمْ عَلَى مِثْلِ الْبَيْضَاءِ ، لَيْلُهَا وَنَهَارُهَا سَوَاءٌ.\u2028قَالَ أَبُو الدَّرْدَاءِ : صَدَقَ وَاللَّهِ رَسُولُ اللهِ صَلَّى الله عَليْهِ وسَلَّمَ , تَرَكَنَا وَاللَّهِ عَلَى مِثْلِ الْبَيْضَاءِ ، لَيْلُهَا وَنَهَارُهَا سَوَاءٌ."
		},
		"chapter_id": "4750419c-436d-4a9c-8e4e-9d0cf53661a4",
		"chapter_name": "",
		"title": {
			"en": "",
			"ms": "Bab Mengikuti Sunnah Rasulullah",
			"ar": "بَابُ اتباع سُنَّةِ رَسُولِ اللهِ صَلَّى الله عَليْهِ وسَلَّمَ"
		},
		"category_id": "983ef3cd-b1ff-436b-be68-828761e124fe",
		"category_name": "kitab",
		"category_title": {
			"en": "",
			"ms": "Kitab 1",
			"ar": "كِتَابُ"
		},
		"book_name": "sunan_ibnu_majah",
		"book_title": "Sunan Ibnu Majah",
		"book_id": "3b91daa1-acf3-4841-a38a-b1d576396e6c"
	},
	{
		"id": "3846e081-24cd-479e-94ba-c8d11848432f",
		"name": "",
		"content": {
			"en": "",
			"ms": "6 - Muhammad bin Basysyar menyampaikan kepada kami, berkata, Muhammad bin Ja‘far menyampaikan kepada kami, berkata, Syu‘bah menyampaikan kepada kami, daripada Mu‘awiyah bin Qurrah, daripada Ayahnya, berkata, Rasulullah g bersabda: “Akan senantiasa ada sekelompok daripada umat saya mendapat pertolongan. Orang-orang yang menghinakannya tidak akan membahayakan mereka sehingga berlaku hari kiamat.“",
			"ar": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ ، حَدَّثَنَا شُعْبَةُ ، عَنْ مُعَاوِيَةَ بْنِ قُرَّةَ ، عَنْ أَبِيهِ ، قَالَ : قَالَ رَسُولُ اللهِ صَلَّى الله عَليْهِ وسَلَّمَ : لاَ تَزَالُ طَائِفَةٌ مِنْ أُمَّتِي مَنْصُورِينَ ، لاَ يَضُرُّهُمْ مَنْ خَذَلَهُمْ حَتَّى تَقُومَ السَّاعَةُ."
		},
		"chapter_id": "4750419c-436d-4a9c-8e4e-9d0cf53661a4",
		"chapter_name": "",
		"title": {
			"en": "",
			"ms": "Bab Mengikuti Sunnah Rasulullah",
			"ar": "بَابُ اتباع سُنَّةِ رَسُولِ اللهِ صَلَّى الله عَليْهِ وسَلَّمَ"
		},
		"category_id": "983ef3cd-b1ff-436b-be68-828761e124fe",
		"category_name": "kitab",
		"category_title": {
			"en": "",
			"ms": "Kitab 1",
			"ar": "كِتَابُ"
		},
		"book_name": "sunan_ibnu_majah",
		"book_title": "Sunan Ibnu Majah",
		"book_id": "3b91daa1-acf3-4841-a38a-b1d576396e6c"
	},
	{
		"id": "c24ce8b5-9a97-487e-98df-373175db7bdc",
		"name": "",
		"content": {
			"en": "",
			"ms": "Abu ‘Abdullah menyampaikan kepada kami, berkata, Hisyam bin ‘Ammar menyampaikan kepada kami, berkata, Yahya bin Hamzah menyampaikan kepada kami, berkata, Abu ‘Alqamah Nashr bin ‘Alqamah menyampaikan kepada kami, daripada ‘Umayr al-Aswad dan Katsir bin Murrah al-Hadhrami, daripada Abu Hurayrah, berkata, Rasulullah g bersabda: “Akan senantiasa ada sekelompok daripada umatku yang tegar berdiri di atas perintah Allah, tidak akan membahayakan mereka orang yang menyelisihinya.”",
			"ar": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ ، حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ ، حَدَّثَنَا أَبُو عَلْقَمَةَ نَصْرُ بْنُ عَلْقَمَةَ ، عَنْ عُمَيْرِ بْنِ الأَسْوَدِ ، وَكَثِيرِ بْنِ مُرَّةَ الْحَضْرَمِيِّ ، عَنْ أَبِي هُرَيْرَةَ , أَنَّ رَسُولَ اللهِ صَلَّى الله عَليْهِ وسَلَّمَ قَالَ : لاَ تَزَالُ طَائِفَةٌ مِنْ أُمَّتِي قَوَّامَةً عَلَى أَمْرِ اللهِ عَزَّ وَجَلَّ ، لاَ يَضُرُّهَا مَنْ خَالَفَهَا."
		},
		"chapter_id": "4750419c-436d-4a9c-8e4e-9d0cf53661a4",
		"chapter_name": "",
		"title": {
			"en": "",
			"ms": "Bab Mengikuti Sunnah Rasulullah",
			"ar": "بَابُ اتباع سُنَّةِ رَسُولِ اللهِ صَلَّى الله عَليْهِ وسَلَّمَ"
		},
		"category_id": "983ef3cd-b1ff-436b-be68-828761e124fe",
		"category_name": "kitab",
		"category_title": {
			"en": "",
			"ms": "Kitab 1",
			"ar": "كِتَابُ"
		},
		"book_name": "sunan_ibnu_majah",
		"book_title": "Sunan Ibnu Majah",
		"book_id": "3b91daa1-acf3-4841-a38a-b1d576396e6c"
	},
	{
		"id": "2a209d1c-d660-4a39-97cb-2e43f71fba0c",
		"name": "",
		"content": {
			"en": "",
			"ms": "8 - Abu ‘Abdullah menyampaikan kepada kami, berkata, Hisyam bin ‘Ammar menyampaikan kepada kami, berkata, al-Jarrah bin Malih menyampaikan kepada kami, berkata, Bakar  bin Zur‘ah menyampaikan kepada kami, berkata, saya mendengar Abu ‘Inabah al-Khawlani dan dia merupakan sahabat yang mengalami situasi solat menghadap dua kiblat bersama Rasulullah g, berkata, saya mendengar Rasulullah g bersabda: “Allah akan senantiasa menanam tanaman (pembaharu) dalam agama ini, yang akan Dia gunakan untuk ketaatan kepada-Nya.”",
			"ar": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ ، حَدَّثَنَا الْجَرَّاحُ بْنُ مَلِيحٍ ، حَدَّثَنَا بَكْرُ بْنُ زُرْعَةَ ، قَالَ : سَمِعْتُ أَبَا عِنَبَةَ الْخَوْلاَنِيَّ ، وَكَانَ قَدْ صَلَّى الْقِبْلَتَيْنِ مَعَ رَسُولِ اللهِ صَلَّى الله عَليْهِ وسَلَّمَ قَالَ : سَمِعْتُ رَسُولَ اللهِ صَلَّى الله عَليْهِ وسَلَّمَ يَقُولُ : لاَ يَزَالُ اللَّهُ يَغْرِسُ فِي هَذَا الدِّينِ غَرْسًا يَسْتَعْمِلُهُمْ فِي طَاعَتِهِ"
		},
		"chapter_id": "4750419c-436d-4a9c-8e4e-9d0cf53661a4",
		"chapter_name": "",
		"title": {
			"en": "",
			"ms": "Bab Mengikuti Sunnah Rasulullah",
			"ar": "بَابُ اتباع سُنَّةِ رَسُولِ اللهِ صَلَّى الله عَليْهِ وسَلَّمَ"
		},
		"category_id": "983ef3cd-b1ff-436b-be68-828761e124fe",
		"category_name": "kitab",
		"category_title": {
			"en": "",
			"ms": "Kitab 1",
			"ar": "كِتَابُ"
		},
		"book_name": "sunan_ibnu_majah",
		"book_title": "Sunan Ibnu Majah",
		"book_id": "3b91daa1-acf3-4841-a38a-b1d576396e6c"
	},
	{
		"id": "f53faaef-1f27-452c-a8f5-931422602184",
		"name": "",
		"content": {
			"en": "",
			"ms": "9 - Ya‘qub bin Humayd bin Kasib menyampaikan kepada kami, berkata, menyampaikan kepada kami al-Qasim bin Nafi‘ berkata, al-Hajjaj bin Arthah menyampaikan kepada kami, daripada ‘Amr bin Syu‘ayb, daripada Ayahnya, berkata, Mu‘awiyah berdiri khutbah, lalu dberkata, “Mana para ulama kamu semua? Mana ulama kamu semua? Saya mendengar Rasulullah g bersabda: “Tidak akan berlaku hari kiamat sehingga sekelompok daripada umat saya menang ke atas semua manusia, mereka tidak peduli dengan orang yang menghinakannya dan tidak pula dengan orang yang menolongnya.”",
			"ar": "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ ، حَدَّثَنَا الْقَاسِمُ بْنُ نَافِعٍ ، حَدَّثَنَا الْحَجَّاجُ بْنُ أَرْطَاةَ ، عَنْ عَمْرِو بْنِ شُعَيْبٍ ، عَنْ أَبِيهِ ، قَالَ : قَامَ مُعَاوِيَةُ خَطِيبًا , فَقَالَ : أَيْنَ عُلَمَاؤُكُمْ ؟ أَيْنَ عُلَمَاؤُكُمْ ؟ سَمِعْتُ رَسُولَ اللهِ صَلَّى الله عَليْهِ وسَلَّمَ يَقُولُ : لاَ تَقُومُ السَّاعَةُ إِلاَّ وَطَائِفَةٌ مِنْ أُمَّتِي ظَاهِرِينَ عَلَى النَّاسِ ، لاَ يُبَالُونَ مَنْ خَذَلَهُمْ وَلاَ مَنْ نَصَرَهُمْ.ِ"
		},
		"chapter_id": "4750419c-436d-4a9c-8e4e-9d0cf53661a4",
		"chapter_name": "",
		"title": {
			"en": "",
			"ms": "Bab Mengikuti Sunnah Rasulullah",
			"ar": "بَابُ اتباع سُنَّةِ رَسُولِ اللهِ صَلَّى الله عَليْهِ وسَلَّمَ"
		},
		"category_id": "983ef3cd-b1ff-436b-be68-828761e124fe",
		"category_name": "kitab",
		"category_title": {
			"en": "",
			"ms": "Kitab 1",
			"ar": "كِتَابُ"
		},
		"book_name": "sunan_ibnu_majah",
		"book_title": "Sunan Ibnu Majah",
		"book_id": "3b91daa1-acf3-4841-a38a-b1d576396e6c"
	},
	{
		"id": "6e91e0b6-dd2d-497e-a732-b31c51925fde",
		"name": "",
		"content": {
			"en": "",
			"ms": "10 - Hisyam bin ‘Ammar menyampaikan kepada kami, berkata, Muhammad bin Syu‘ayb menyampaikan kepada kami, berkata, Sa‘id bin Basyir menyampaikan kepada kami, daripada Qatadah, daripada Abu Qilabah, daripada Abu Asma’, daripada Tsawban, berkata, Rasulullah g bersabda: “Akan senantiasa ada sekelompok daripada umat saya yang dibantu atas kebenaran, tidak membahayakan mereka orang yang menyelisihinya sehingga datang keputusan Allah b.”",
			"ar": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ ، حَدَّثَنَا مُحَمَّدُ بْنُ شُعَيْبٍ ، حَدَّثَنَا سَعِيدُ بْنُ بَشِيرٍ ، عَنْ قَتَادَةَ ، عَنْ أَبِي قِلاَبَةَ ، عَنْ أَبِي أَسْمَاءَ ، عَنْ ثَوْبَانَ ، أَنَّ رَسُولَ اللهِ صَلَّى الله عَليْهِ وسَلَّمَ قَالَ : لاَ تَزَالُ طَائِفَةٌ مِنْ أُمَّتِي عَلَى الْحَقِّ مَنْصُورِينَ ، لاَ يَضُرُّهُمْ مَنْ خَالَفَهُمْ ، حَتَّى يَأْتِيَ أَمْرُ اللهِ عَزَّ وَجَلَّ.ِ"
		},
		"chapter_id": "4750419c-436d-4a9c-8e4e-9d0cf53661a4",
		"chapter_name": "",
		"title": {
			"en": "",
			"ms": "Bab Mengikuti Sunnah Rasulullah",
			"ar": "بَابُ اتباع سُنَّةِ رَسُولِ اللهِ صَلَّى الله عَليْهِ وسَلَّمَ"
		},
		"category_id": "983ef3cd-b1ff-436b-be68-828761e124fe",
		"category_name": "kitab",
		"category_title": {
			"en": "",
			"ms": "Kitab 1",
			"ar": "كِتَابُ"
		},
		"book_name": "sunan_ibnu_majah",
		"book_title": "Sunan Ibnu Majah",
		"book_id": "3b91daa1-acf3-4841-a38a-b1d576396e6c"
	},
	{
		"id": "fc21110f-3ccb-4aa1-a73b-597d95d72202",
		"name": "",
		"content": {
			"en": "",
			"ms": "1 - Qutaybah bin Sa’id menyampaikan kepada kami, katanya: \"Abu ‘Awanah mengkhabarkan kepada kami, daripada Simak bin Harb. Dalam sanad lain, Hannad menyampaikan kepada kami katanya, Waki’ menyampaikan kepada kami, daripada Israil, daripada Simak, daripada Mush'ab bin Sa’ad, daripada Ibn ‘Umar, daripada Nabi g sabdanya: “Sembahyang tidak akan diterima dengan tanpa bersuci dan sedekah (tidak akan diterima) daripada hasil harta yang diselewengkan”.\nHannad meriwayatkan dalam haditsnya dengan lafaz “Illa Bi Tuhur” yang bermaksud \"melainkan dengan bersuci\". Hadits ini merupakan hadits yang paling shahih dan paling baik dalam bab ini. Dalam bab ini juga terdapat riwayat daripada Abu al-Malih, daripada bapanya, Abu Hurayrah dan Anas. Nama Abu al-Malih bin Usamah ialah ‘Amir. Ada juga dikatakan Zaid bin Usamah bin ‘Umayr al-Hudzali.\n",
			"ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ: أَخْبَرَنَا أَبُو عَوَانَةَ، عَنْ سِمَاكِ بْنِ حَرْبٍ (ح) وحَدَّثَنَا هَنَّادٌ، قَالَ: حَدَّثَنَا وَكِيعٌ، عَنْ إِسْرَائِيلَ، عَنْ سِمَاكٍ، عَنْ مُصْعَبِ بْنِ سَعْدٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ: لاَ تُقْبَلُ صَلاَةٌ بِغَيْرِ طُهُورٍ وَلاَ صَدَقَةٌ مِنْ غُلُولٍ.\nقَالَ هَنَّادٌ فِي حَدِيثِهِ: إِلاَّ بِطُهُورٍ. هَذَا الْحَدِيثُ أَصَحُّ شَيْءٍ فِي هَذَا الْبَابِ وَأَحْسَنُ. وَفِي الْبَابِ عَنْ أَبِي الْمَلِيحِ، عَنْ أَبِيهِ، وَأَبِي هُرَيْرَةَ، وَأَنَسٍ. وَأَبُو الْمَلِيحِ بْنُ أُسَامَةَ اسْمُهُ عَامِرٌ، وَيُقَالُ: زَيْدُ بْنُ أُسَامَةَ بْنِ عُمَيْرٍ الْهُذَلِيُّ."
		},
		"chapter_id": "2a92f2f3-af16-4705-89b2-06d7e722f0e4",
		"chapter_name": "",
		"title": {
			"en": "",
			"ms": "Bab Sembahyang Tidak Diterima Dengan Tidak Bersuci",
			"ar": "بَابُ مَا جَاءَ لاَ تُقْبَلُ صَلاَةٌ بِغَيْرِ طُهُورٍٍ"
		},
		"category_id": "cd2d21ff-22f6-451a-bc57-1e0d5ba4fcb1",
		"category_name": "",
		"category_title": {
			"en": "",
			"ms": "Bab-bab bersuci daripada Rasulullah",
			"ar": "أَبْوَابُ الطَّهَارَةِ عَنْ رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ"
		},
		"book_name": "jami_al_tirmidhi",
		"book_title": "Jami’ Al-Tirmidhi",
		"book_id": "c4d5ea38-2090-4f28-8ca3-40bb2639d502"
	},
	{
		"id": "fc21110f-3ccb-4aa1-a73b-597d95d72202",
		"name": "",
		"content": {
			"en": "",
			"ms": "2 – Ishaq bin Musa al-Anshari menyampaikan kepada kami, katanya: \"Ma’an bin ‘Isa al-Qazzaz menyampaikan kepada kami katanya, Malik bin Anas menyampaikan kepada kami. Dalam sanad lain, Qutaybah menyampaikan kepada kami, daripada Malik, daripada Suhayl bin Abu Shalih, daripada bapanya, daripada Abu Hurayrah katanya: “Rasulullah g bersabda: “Apabila seorang hamba muslim atau mukmin berwuduk dengan membasuh mukanya maka keluarlah daripada mukanya segala kesalahan (dosa) yang pernah dilihat oleh kedua matanya bersama air (wuduknya) atau bersama titisan air yang terakhir atau yang seumpamanya. Apabila dia membasuh kedua-dua tangannya maka keluarlah daripada kedua-duanya segala kesalahan (dosa) yang dilakukan oleh kedua-duanya bersama air atau bersama titisan air yang terakhir sehingga keluar (selesai daripada wuduknya) dalam keadaan suci daripada dosa-dosa”.Hadits ini adalah hadits hasan shahih. Hadits ini diriwayatkan oleh Malik, daripada Suhayl, daripada bapanya, daripada Abu Hurayrah. Abu Shalih adalah bapa Suhayl iaitu Abu Shalih al-Samman dan namanya ialah Dzakwan. Nama Abu Hurayrah menjadi perselisihan pendapat. Mereka berkata bahawa beliau bernama ‘Abd Shams. Ada yang mengatakan bahawa namanya ialah ‘Abdullah bin ‘Amr. Begitulah pendapat Muhammad bin Isma’il dan inilah yang paling tepat. Dalam bab ini terdapat riwayat daripada ‘Utsman, Tsawban, al-Shunabihiy, ’Amr bin ‘Anbasah, Salman dan ‘Abdullah bin ‘Amr. Dan al-Shunabihi meriwayatkan daripada Abu Bakar al-Shiddiq. Beliau tidak mendengar daripada Rasulullah g. Namanya ialah ‘Abd al-Rahman bin ‘Usailah dan diberi gelaran Abu ‘Abdullah. Dia telah berjalan untuk bertemu Rasulullah g tetapi Nabi g wafat ketika beliau dalam perjalanan. Beliau juga ada meriwayatkan beberapa hadits daripada Rasulullah g. Sementara al-Shunabih bin al-A’sar al-Akhmasiy merupakan sahabat Nabi g. Dia juga dipanggil dengan al-Shunabihiy. Dia ada meriwayatkan hadits, katanya: “Aku mendengar Rasulullah g bersabda: “Sesungguhnya aku berbangga dengan ramainya kamu di hadapan umat-umat (terdahulu). Oleh itu, janganlah sesekali kamu berbunuhan selepasku (ketiadaanku)”.",
			"ar": "حَدَّثَنَا إِسْحَاقُ بْنُ مُوسَى الأَنْصَارِيُّ، قَالَ: حَدَّثَنَا مَعْنُ بْنُ عِيسَى الْقَزَّازُ، قَالَ: حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ (ح) وحَدَّثَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِذَا تَوَضَّأَ الْعَبْدُ الْمُسْلِمُ، أَوِ الْمُؤْمِنُ، فَغَسَلَ وَجْهَهُ خَرَجَتْ مِنْ وَجْهِهِ كُلُّ خَطِيئَةٍ نَظَرَ إِلَيْهَا بِعَيْنَيْهِ مَعَ الْمَاءِ، أَوْ مَعَ آخِرِ قَطْرِ الْمَاءِ، أَوْ نَحْوَ هَذَا، وَإِذَا غَسَلَ يَدَيْهِ خَرَجَتْ مِنْ يَدَيْهِ كُلُّ خَطِيئَةٍ بَطَشَتْهَا يَدَاهُ مَعَ الْمَاءِ، أَوْ مَعَ آخِرِ قَطْرِ الْمَاءِ، حَتَّى يَخْرُجَ نَقِيًّا مِنَ الذُّنُوبِ.\nهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ , وَهُوَ حَدِيثُ مَالِكٍ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ. وَأَبُو صَالِحٍ وَالِدُ سُهَيْلٍ هُوَ أَبُو صَالِحٍ السَّمَّانُ، وَاسْمُهُ ذَكْوَانُ، وَأَبُو هُرَيْرَةَ اخْتُلِفَ فِي اسْمِهِ، فَقَالُوا: عَبْدُ شَمْسٍ، وَقَالُوا: عَبْدُ اللهِ بْنُ عَمْرٍو، وَهَكَذَا قَالَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ، وَهَذَا الأَصَحُّ. وَفِي الْبَابِ عَنْ عُثْمَانَ، وَثَوْبَانَ، وَالصُّنَابِحِيِّ، وَعَمْرِو بْنِ عَبَسَةَ، وَسَلْمَانَ، وَعَبْدِ اللهِ بْنِ عَمْرٍو. وَالصُّنَابِحِيُّ هَذَا الَّذِي رَوَى عَنْ أَبِي بَكْرٍ الصِّدِّيقِ، لَيْسَ لَهُ سَمَاعٌ مِنْ رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، وَاسْمُهُ عَبْدُ الرَّحْمَنِ بْنُ عُسَيْلَةَ، وَيُكْنَى أَبَا عَبْدِ اللهِ، رَحَلَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُبِضَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ فِي الطَّرِيقِ، وَقَدْ رَوَى عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحَادِيثَ. وَالصُّنَابِحُ بْنُ الأَعْسَرِ الأَحْمَسِيُّ صَاحِبُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يُقَالُ لَهُ: الصُّنَابِحِيُّ أَيْضًا، وَإِنَّمَا حَدِيثُهُ قَالَ: سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ: إِنِّي مُكَاثِرٌ بِكُمُ الأُمَمَ فَلاَ تَقْتَتِلُنَّ بَعْدِي."
		},
		"chapter_id": "f4578ff3-6a4e-4851-b7a1-e2aae27902b1",
		"chapter_name": "",
		"title": {
			"en": "",
			"ms": "Bab Kelebihan Bersuci",
			"ar": "بَابُ مَا جَاءَ فِي فَضْلِ الطُّهُورٍٍِ"
		},
		"category_id": "cd2d21ff-22f6-451a-bc57-1e0d5ba4fcb1",
		"category_name": "",
		"category_title": {
			"en": "",
			"ms": "Bab-bab bersuci daripada Rasulullah",
			"ar": "أَبْوَابُ الطَّهَارَةِ عَنْ رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ"
		},
		"book_name": "jami_al_tirmidhi",
		"book_title": "Jami’ Al-Tirmidhi",
		"book_id": "c4d5ea38-2090-4f28-8ca3-40bb2639d502"
	},
	{
		"id": "b2a0d1b0-60a6-4239-8b21-a44bda52d95c",
		"name": "",
		"content": {
			"en": "",
			"ms": "3- Qutaybah, Hannad dan Mahmud bin Ghaylan menyampaikan kepada kami, katanya: \"Waki’ menyampaikan kepada kami, daripada Sufyan. Dalam sanad lain, Muhammad bin Basysyar menyampaikan kepada kami, katanya: \"‘Abd al-Rahman bin Mahdi menyampaikan kepada kami katanya, Sufyan menyampaikan kpeada kami, daripada ‘Abdullah bin Muhammad bin ‘Aqil, daripada Muhammad Ibn al-Hanafiyyah, daripada ‘Ali, daripada Nabi g, sabdanya: “Kunci sembahyang adalah bersuci, dimulakannya dengan takbir (takbiratul ihram) dan diakhiri dengan memberi salam”.\nHadits ini adalah hadits yang paling shahih dan paling baik dalam bab ini. ‘Abdullah bin Muhammad bin ‘Aqil merupakan seorang shaduq. Sebahagian ilmuwan mempersoalkannya pada sudut hafalannya. Aku mendengar Muhammad bin Isma’il berkata: “Ahmad bin Hanbal, Ishaq bin Ibrahim dan al-Humaydi berhujah dengan hadits yang diriwayatkan oleh ‘Abdullah bin Muhammad bin ‘Aqil”. Muhammad berkata: “Dia seorang muqarib al-Hadits”. Dalam bab ini  terdapat riwayat daripada Jabir dan Abu Sa’id.",
			"ar": "حَدَّثَنَا قُتَيْبَةُ، وَهَنَّادٌ، وَمَحْمُودُ بْنُ غَيْلاَنَ، قَالُوا: حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ (ح) وحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ: حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، قَالَ: حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ اللهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ، عَنْ مُحَمَّدِ ابْنِ الْحَنَفِيَّةِ، عَنْ عَلِيٍّ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ: مِفْتَاحُ الصَّلاَةِ الطُّهُورُ، وَتَحْرِيمُهَا التَّكْبِيرُ، وَتَحْلِيلُهَا التَّسْلِيمُ.\nهَذَا الْحَدِيثُ أَصَحُّ شَيْءٍ فِي هَذَا الْبَابِ وَأَحْسَنُ. وَعَبْدُ اللهِ بْنُ مُحَمَّدِ بْنِ عَقِيلٍ هُوَ صَدُوقٌ، وَقَدْ تَكَلَّمَ فِيهِ بَعْضُ أَهْلِ الْعِلْمِ مِنْ قِبَلِ حِفْظِهِ. وسَمِعْت مُحَمَّدَ بْنَ إِسْمَاعِيلَ، يَقُولُ: كَانَ أَحْمَدُ بْنُ حَنْبَلٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَالْحُمَيْدِيُّ، يَحْتَجُّونَ بِحَدِيثِ عَبْدِ اللهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ، قَالَ مُحَمَّدٌ: وَهُوَ مُقَارِبُ الْحَدِيثِ. وَفِي الْبَابِ عَنْ جَابِرٍ، وَأَبِي سَعِيدٍ."
		},
		"chapter_id": "1be1a04f-834f-4ee6-a8cf-9070a2436d0c",
		"chapter_name": "",
		"title": {
			"en": "",
			"ms": "Bab Kunci Sembahyang Adalah Bersuci",
			"ar": "بَابُ مَا جَاءَ أَنَّ مِفْتَاحَ الصَّلاَةِ الطُّهُورُ"
		},
		"category_id": "cd2d21ff-22f6-451a-bc57-1e0d5ba4fcb1",
		"category_name": "",
		"category_title": {
			"en": "",
			"ms": "Bab-bab bersuci daripada Rasulullah",
			"ar": "أَبْوَابُ الطَّهَارَةِ عَنْ رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ"
		},
		"book_name": "jami_al_tirmidhi",
		"book_title": "Jami’ Al-Tirmidhi",
		"book_id": "c4d5ea38-2090-4f28-8ca3-40bb2639d502"
	},
	{
		"id": "6aa7e5f2-e0ce-4171-a366-fe693f3800ad",
		"name": "",
		"content": {
			"en": "",
			"ms": "4 – Abu Bakar iaitu Muhammad bin Zanjawayh al-Baghdadi dan perawi-perawi selainnya menyampaikan kepada kami, katanya: \"Al-Husayn bin Muhammad menyampaikan kepada kami katanya, Sulayman bin Qarm menyampaikan kepada kami, daripada Abu Yahya al-Qattat, daripada Mujahid, daripada Jabir bin ‘Abdullah katanya: “Rasulullah g bersabda: “Kunci syurga adalah sembahyang dan kunci sembahyang adalah wuduk”.",
			"ar": "حَدَّثَنَا أَبُو بَكْرٍ مُحَمَّدُ بْنُ زَنْجَوَيْهِ الْبَغْدَادِيُّ، وَغَيْرُ وَاحِدٍ قَالُوا: حَدَّثَنَا الْحُسَيْنُ بْنُ مُحَمَّدٍ، قَالَ: حَدَّثَنَا سُلَيْمَانُ بْنُ قَرْمٍ، عَنْ أَبِي يَحْيَى الْقَتَّاتِ، عَنْ مُجَاهِدٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مِفْتَاحُ الْجَنَّةِ الصَّلاَةُ، وَمِفْتَاحُ الصَّلاَةِ الْوُضُوءُ."
		},
		"chapter_id": "1be1a04f-834f-4ee6-a8cf-9070a2436d0c",
		"chapter_name": "",
		"title": {
			"en": "",
			"ms": "Bab Kunci Sembahyang Adalah Bersuci",
			"ar": "بَابُ مَا جَاءَ أَنَّ مِفْتَاحَ الصَّلاَةِ الطُّهُورُ"
		},
		"category_id": "cd2d21ff-22f6-451a-bc57-1e0d5ba4fcb1",
		"category_name": "",
		"category_title": {
			"en": "",
			"ms": "Bab-bab bersuci daripada Rasulullah",
			"ar": "أَبْوَابُ الطَّهَارَةِ عَنْ رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ"
		},
		"book_name": "jami_al_tirmidhi",
		"book_title": "Jami’ Al-Tirmidhi",
		"book_id": "c4d5ea38-2090-4f28-8ca3-40bb2639d502"
	},
	{
		"id": "78086c78-5cd6-4e6d-b2ae-fddb21bf79bd",
		"name": "",
		"content": {
			"en": "",
			"ms": "5 – Qutaybah dan Hannad menyampaikan kepada kami, katanya: \"Waki’ menyampaikan kepada kami, daripada Syu'bah, daripada ‘Abd al-‘Aziz bin Shuhayb, daripada Anas bin Malik katanya: “Nabi g apabila masuk ke bilik air, Baginda akan berdoa: “Ya Allah, sesungguhnya aku berlindung kepada-Mu”. Syu'bah berkata: “Pada waktu lain baginda berkata: “Aku berlindung kepada Allah daripada syaitan jantan dan betina”. \nDi dalam bab ini terdapat riwayat daripada ‘Ali, Zaid bin Arqam, Jabir dan Ibn Mas’ud. Hadits yang diriwayatkan oleh Anas adalah hadits yang paling shahih dan baik dalam bab ini. Hadits riwayat Zaid bin Arqam, pada sanadnya terdapat idhthirab. Hisyam al-Dastuwa'i, Sa’id bin Abu ‘Arubah meriwayatkan daripada Qatadah. Dan Sa’id meriwayatkan daripada al-Qasim bin ‘Auf al-Syaibani, daripada Zaid bin Arqam. Sementara itu, Hisyam meriwayatkan daripada Qatadah, daripada Zaid bin Arqam. Syu'bah dan Ma’mar pula meriwayatkan daripada Qatadah bin al-Nadhr bin Anas. Syu'bah meriwayatkan daripada Zaid bin Arqam dan Ma’mar meriwayatkan daripada al-Nadhr bin Anas, daripada bapanya, daripada Nabi g. Aku bertanya Muhammad tentang kegoncangan sanad ini, dia menjawab: “Terdapat andaian bahawa Qatadah meriwayatkan daripada kedua-duanya (al-Qasim dan al-Nadhr) sekali”.",
			"ar": "حَدَّثَنَا قُتَيْبَةُ، وَهَنَّادٌ، قَالاَ: حَدَّثَنَا وَكِيعٌ، عَنْ شُعْبَةَ، عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دَخَلَ الْخَلاَءَ، قَالَ: اللَّهُمَّ إِنِّي أَعُوذُ بِكَ قَالَ شُعْبَةُ: وَقَدْ قَالَ مَرَّةً أُخْرَى: أَعُوذُ بِاللَّهِ مِنَ الْخُبْثِ وَالْخَبِيثِ، أَوِ الْخُبُثِ وَالْخَبَائِثِ.\nوَفِي الْبَابِ عَنْ عَلِيٍّ، وَزَيْدِ بْنِ أَرْقَمَ، وَجَابِرٍ، وَابْنِ مَسْعُودٍ. حَدِيثُ أَنَسٍ أَصَحُّ شَيْءٍ فِي هَذَا الْبَابِ وَأَحْسَنُ. وَحَدِيثُ زَيْدِ بْنِ أَرْقَمَ فِي إِسْنَادِهِ اضْطِرَابٌ: رَوَى هِشَامٌ الدَّسْتُوَائِيُّ، وَسَعِيدُ بْنُ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، فَقَالَ سَعِيدٌ: عَنِ الْقَاسِمِ بْنِ عَوْفٍ الشَّيْبَانِيِّ، عَنْ زَيْدِ بْنِ أَرْقَمَ، وَقَالَ هِشَامٌ: عَنْ قَتَادَةَ، عَنْ زَيْدِ بْنِ أَرْقَمَ، وَرَوَاهُ شُعْبَةُ، وَمَعْمَرٌ، عَنْ قَتَادَةَ، عَنِ النَّضْرِ بْنِ أَنَسٍ، فَقَالَ شُعْبَةُ: عَنْ زَيْدِ بْنِ أَرْقَمَ، وَقَالَ مَعْمَرٌ: عَنِ النَّضْرِ بْنِ أَنَسٍ، عَنْ أَبِيهِ , عن النبي صلى الله عليه وسلم. سَأَلْتُ مُحَمَّدًا عَنْ هَذَا، فَقَالَ: يُحْتَمَلُ أَنْ يَكُونَ قَتَادَةُ رَوَى عَنْهُمَا جَمِيعًا."
		},
		"chapter_id": "5e2b3db7-c8ef-4725-995f-7daef23d863b",
		"chapter_name": "",
		"title": {
			"en": "",
			"ms": "Bab Doa Yang Diucapkan Apabila Masuk Ke Bilik Air",
			"ar": "بَابُ مَا يَقُولُ إِذَا دَخَلَ الْخَلاَءَ"
		},
		"category_id": "cd2d21ff-22f6-451a-bc57-1e0d5ba4fcb1",
		"category_name": "",
		"category_title": {
			"en": "",
			"ms": "Bab-bab bersuci daripada Rasulullah",
			"ar": "أَبْوَابُ الطَّهَارَةِ عَنْ رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ"
		},
		"book_name": "jami_al_tirmidhi",
		"book_title": "Jami’ Al-Tirmidhi",
		"book_id": "c4d5ea38-2090-4f28-8ca3-40bb2639d502"
	},
	{
		"id": "35df385e-3cc9-44f0-8648-cb3a00915cd8",
		"name": "",
		"content": {
			"en": "",
			"ms": "6 – Ahmad bin ‘Abdah al-Dhabbiy al-Bashriy menyampaikan kepada kami, katanya: \"Hammad bin Zaid menyampaikan kepada kami, daripada ‘Abd al-‘Aziz bin Shuhayb, daripada Anas bin Malik bahawa apabila Nabi g mahu masuk ke bilik air maka baginda akan berdoa: “Ya Allah, sesungguhnya aku berlindung kepada-Mu daripada syaitan jantan dan betina”.\nHadits ini adalah hadits hasan shahih.",
			"ar": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ الْبَصْرِيُّ، قَالَ: حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا دَخَلَ الْخَلاَءَ، قَالَ: اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخُبْثِ وَالْخَبَائِثِ.\nهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
		},
		"chapter_id": "5e2b3db7-c8ef-4725-995f-7daef23d863b",
		"chapter_name": "",
		"title": {
			"en": "",
			"ms": "Bab Doa Yang Diucapkan Apabila Masuk Ke Bilik Air",
			"ar": "بَابُ مَا يَقُولُ إِذَا دَخَلَ الْخَلاَءَ"
		},
		"category_id": "cd2d21ff-22f6-451a-bc57-1e0d5ba4fcb1",
		"category_name": "",
		"category_title": {
			"en": "",
			"ms": "Bab-bab bersuci daripada Rasulullah",
			"ar": "أَبْوَابُ الطَّهَارَةِ عَنْ رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ"
		},
		"book_name": "jami_al_tirmidhi",
		"book_title": "Jami’ Al-Tirmidhi",
		"book_id": "c4d5ea38-2090-4f28-8ca3-40bb2639d502"
	},
	{
		"id": "83299937-7102-4b62-af75-91e7c6e83afc",
		"name": "",
		"content": {
			"en": "",
			"ms": "7 – Muhammad bin Isma’il menyampaikan kepada kami, katanya: \"Malik bin Isma’il menyampaikan kepada kami, daripada Israil, daripada Yusuf bin Abu Burdah, daripada bapanya, daripada 'A'isyah katanya: “Apabila Nabi g keluar dari bilik air, baginda akan membaca: “Aku mohon keampunan-Mu”.\nHadits ini adalah hadits hasan gharib. Kami tidak mengetahuinya melainkan melalui hadits riwayat Israil, daripada Yusuf bin Abu Burdah. Abu Burdah bin Abu Musa namanya ialah ‘Amir bin ‘Abdullah bin Qays al-Ash’ariy. Tidak diketahui dalam bab ini (hadits yang shahih) melainkan hadits yang diriwayatkan oleh 'A'isyah.",
			"ar": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ، قَالَ: حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، عَنْ إِسْرَائِيلَ، عَنْ يُوسُفَ بْنِ أَبِي بُرْدَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ قَالَتْ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا خَرَجَ مِنَ الْخَلاَءِ، قَالَ: غُفْرَانَكَ.\nهَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ، لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ إِسْرَائِيلَ، عَنْ يُوسُفَ بْنِ أَبِي بُرْدَةَ. وَأَبُو بُرْدَةَ بْنُ أَبِي مُوسَى، اسْمُهُ عَامِرُ بْنُ عَبْدِ اللهِ بْنِ قَيْسٍ الأَشْعَرِيُّ. وَلاَ يُعْرَفُ فِي هَذَا الْبَابِ إِلاَّ حَدِيثُ عَائِشَةَ."
		},
		"chapter_id": "2c05c214-c83a-4e54-b62a-0d6ddbe7b1f0",
		"chapter_name": "",
		"title": {
			"en": "",
			"ms": "Bab Doa Yang Diucapkan Apabila Keluar Daripada Bilik Air",
			"ar": "بَابُ مَا يَقُولُ إِذَا خَرَجَ مِنَ الْخَلاَءَِ"
		},
		"category_id": "cd2d21ff-22f6-451a-bc57-1e0d5ba4fcb1",
		"category_name": "",
		"category_title": {
			"en": "",
			"ms": "Bab-bab bersuci daripada Rasulullah",
			"ar": "أَبْوَابُ الطَّهَارَةِ عَنْ رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ"
		},
		"book_name": "jami_al_tirmidhi",
		"book_title": "Jami’ Al-Tirmidhi",
		"book_id": "c4d5ea38-2090-4f28-8ca3-40bb2639d502"
	},
	{
		"id": "68fc93bd-1670-4aa0-920d-be8da3b19fc1",
		"name": "",
		"content": {
			"en": "",
			"ms": "8 – Sa’id bin ‘Abd al-Rahman al-Makhzumiy menyampaikan kepada kami, katanya: \"Sufyan bin ‘Uyaynah menyampaikan kepada kami, daripada al-Zuhriy, daripada ‘Atha’ bin Yazid al-Laitsi, daripada Abu Ayyub al-Anshari katanya: “Rasulullah g bersabda: “Apabila kamu pergi ke tandas maka janganlah kamu mengadap kiblat dan membelakanginya ketika berak atau kencing. Akan tetapi hadaplah ke timur atau barat”. Abu Ayyub berkata: “Kami tiba di Syam lalu kami dapati tandas-tandas dibina mengadap kiblat. Maka kami pun berpaling dan memohon ampun kepada Allah”.\nDalam bab ini terdapat riwayat daripada ‘Abdullah bin al-Harits bin Jaz’ al-ZUbaydiy dan Ma’qil bin Abu al-Haitsam. Disebutkan juga Ma’qil bin Abu Ma'qil. (daripada) Abu Hurayrah dan Sahl bin Hunayf. Hadits riwayat Abu Ayyub adalah hadits yang paling baik dan paling shahih dalam bab ini. Nama Abu Ayyub ialah Khalid bin Zaid. Nama al-Zuhriy ialah Muhammad bin Muslim bin ‘Ubaydullah bin Syihab al-Zuhriy. Gelarannya ialah Abu Bakr. Abu al-Walid al-Makkiy berkata: “Abu ‘Abdullah al-Syafi'i berkata: “Makna sebenar sabdaan Nabi g: “Janganlah kamu mengadap kiblat dan membelakanginya ketika berak dan kencing ialah ketika berada di padang pasir (atau tempat terbuka). Sekiranya berada dalam binaan yang dijadikan sebagai tandas maka keadaan itu mempunyai kelonggaran\". Demikianlah pendapat Ishaq. Ahmad bin Hanbal berkata: “Kelonggaran itu sebenarnya datang daripada Nabi g berhubung membelakangi kiblat ketika berak atau kencing. Adapun mengadap kiblat maka ia tidak dibenarkan. Seolah-olah dia berpendapat tidak boleh mengadap kiblat di padang pasir atau binaan yang dijadikan tandas”.",
			"ar": "حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ الْمَخْزُومِيُّ، قَالَ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ، عَنْ أَبِي أَيُّوبَ الأَنْصَارِيِّ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِذَا أَتَيْتُمُ الْغَائِطَ فَلاَ تَسْتَقْبِلُوا الْقِبْلَةَ بِغَائِطٍ وَلاَ بَوْلٍ، وَلاَ تَسْتَدْبِرُوهَا، وَلَكِنْ شَرِّقُوا أَوْ غَرِّبُوا. قَالَ أَبُو أَيُّوبَ: فَقَدِمْنَا الشَّامَ فَوَجَدْنَا مَرَاحِيضَ قَدْ بُنِيَتْ مُسْتَقْبَلَ الْقِبْلَةِ، فَنَنْحَرِفُ عَنْهَا، وَنَسْتَغْفِرُ اللَّهَ.\nوَفِي الْبَابِ عَنْ عَبْدِ اللهِ بْنِ الْحَارِثِ بْنِ جَزْءٍ الزُّبَيْدِيِّ، وَمَعْقِلِ بْنِ أَبِي الْهَيْثَمِ، وَيُقَالُ: مَعْقِلُ بْنُ أَبِي مَعْقِلٍ، وَأَبِي أُمَامَةَ، وَأَبِي هُرَيْرَةَ، وَسَهْلِ بْنِ حُنَيْفٍ. حَدِيثُ أَبِي أَيُّوبَ أَحْسَنُ شَيْءٍ فِي هَذَا الْبَابِ وَأَصَحُّ. وَأَبُو أَيُّوبَ اسْمُهُ خَالِدُ بْنُ زَيْدٍ، وَالزُّهْرِيُّ اسْمُهُ مُحَمَّدُ بْنُ مُسْلِمِ بْنِ عُبَيْدِ اللهِ بْنِ شِهَابٍ الزُّهْرِيُّ، وَكُنْيَتُهُ أَبُو بَكْرٍ. قَالَ أَبُو الْوَلِيدِ الْمَكِّيُّ: قَالَ أَبُو عَبْدِ اللهِ الشَّافِعِيُّ: إِنَّمَا مَعْنَى قَوْلِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لاَ تَسْتَقْبِلُوا الْقِبْلَةَ بِغَائِطٍ وَلاَ بَوْلٍ، وَلاَ تَسْتَدْبِرُوهَا، إِنَّمَا هَذَا فِي الْفَيَافِي، فَأَمَّا فِي الْكُنُفِ الْمَبْنِيَّةِ لَهُ رُخْصَةٌ فِي أَنْ يَسْتَقْبِلَهَا، وَهَكَذَا قَالَ إِسْحَاقُ. وقَالَ أَحْمَدُ بْنُ حَنْبَلٍ: إِنَّمَا الرُّخْصَةُ مِنَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي اسْتِدْبَارِ الْقِبْلَةِ بِغَائِطٍ أَوْ بَوْلٍ، فَأَمَّا اسْتِقْبَالُ الْقِبْلَةِ فَلاَ يَسْتَقْبِلُهَا، كَأَنَّهُ لَمْ يَرَ فِي الصَّحْرَاءِ وَلاَ فِي الْكُنُفِ أَنْ يَسْتَقْبِلَ الْقِبْلَةَ."
		},
		"chapter_id": "62d3b0f4-2c75-4f3a-b676-2b12d5854d6f",
		"chapter_name": "",
		"title": {
			"en": "",
			"ms": "Bab Larangan Daripada Mengadap Kiblat Ketika Berak Dan Kencing",
			"ar": "بَابٌ فِي النَّهْيِ عَنِ اسْتِقْبَالِ الْقِبْلَةِ بِغَائِطٍ أَوْ بَوْلٍ"
		},
		"category_id": "cd2d21ff-22f6-451a-bc57-1e0d5ba4fcb1",
		"category_name": "",
		"category_title": {
			"en": "",
			"ms": "Bab-bab bersuci daripada Rasulullah",
			"ar": "أَبْوَابُ الطَّهَارَةِ عَنْ رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ"
		},
		"book_name": "jami_al_tirmidhi",
		"book_title": "Jami’ Al-Tirmidhi",
		"book_id": "c4d5ea38-2090-4f28-8ca3-40bb2639d502"
	},
	{
		"id": "a6173c5b-f731-44eb-b7de-5a06408b0d7b",
		"name": "",
		"content": {
			"en": "",
			"ms": "9 – Muhammad bin Basysyar dan Muhammad bin al-Mutsanna menyampaikan kepada kami, katanya: \"Wahb bin Jarir menyampaikan kepada kami, katanya: \"Bapaku menyampaikan kepada kami, daripada Muhammad bin Ishaq, daripada Aban bin Shalih, daripada Mujahid, daripada Jabir bin ‘Abdullah katanya: “Nabi g melarang mengadap kiblat ketika kencing. Tetapi aku melihatnya mengadap kiblat setahun sebelum baginda diwafatkan”.\nDalam bab ini terdapat hadits yang diriwayatkan daripada Abu Qatadah, 'A'isyah dan ‘Ammar. Hadits yang diriwayatkan oleh Jabir dalam bab ini adalah hadits hasan gharib.",
			"ar": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، قَالاَ: حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، قَالَ: حَدَّثَنَا أَبِي، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ أَبَانَ بْنِ صَالِحٍ، عَنْ مُجَاهِدٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، قَالَ: نَهَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَسْتَقْبِلَ الْقِبْلَةَ بِبَوْلٍ، فَرَأَيْتُهُ قَبْلَ أَنْ يُقْبَضَ بِعَامٍ يَسْتَقْبِلُهَا.\nوَفِي الْبَابِ عَنْ أَبِي قَتَادَةَ، وَعَائِشَةَ، وَعَمَّارٍ. حَدِيثُ جَابِرٍ فِي هَذَا الْبَابِ حَدِيثٌ حَسَنٌ غَرِيبٌ."
		},
		"chapter_id": "f9dce7a9-2f65-460e-ae5a-da207f990aa7",
		"chapter_name": "",
		"title": {
			"en": "",
			"ms": "Bab Keharusan Mengadap Kiblat (Ketika Membuang Air)",
			"ar": "بَابُ مَا جَاءَ مِنَ الرُّخْصَةِ فِي ذَلِكَ"
		},
		"category_id": "cd2d21ff-22f6-451a-bc57-1e0d5ba4fcb1",
		"category_name": "",
		"category_title": {
			"en": "",
			"ms": "Bab-bab bersuci daripada Rasulullah",
			"ar": "أَبْوَابُ الطَّهَارَةِ عَنْ رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ"
		},
		"book_name": "jami_al_tirmidhi",
		"book_title": "Jami’ Al-Tirmidhi",
		"book_id": "c4d5ea38-2090-4f28-8ca3-40bb2639d502"
	},
	{
		"id": "a6173c5b-f731-44eb-b7de-5a06408b0d7b",
		"name": "",
		"content": {
			"en": "",
			"ms": "10 – Ibn Lahi’ah telah meriwayatkan hadits ini daripada Abu al-Zubayr, daripada Jabir, daripada Abu Qatadah bahawa dia melihat Nabi g kencing mengadap kiblat. Qutaybah mengkhabarkan kepada kami tentang perkara itu, katanya: “Ibn Lahi’ah mengkhabarkan kepada kami”.\nHadits yang diriwayatkan oleh Jabir daripada Nabi g lebih shahih daripada hadits Ibn Lahi’ah. Ibn Lahi’ah dha’if di sisi ulama hadits. Yahya bin Sa’id al-Qaththan dan selainnya mengatakan beliau dha'if.",
			"ar": "وَقَدْ رَوَى هَذَا الْحَدِيثَ ابْنُ لَهِيعَةَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، عَنْ أَبِي قَتَادَةَ، أَنَّهُ رَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَبُولُ مُسْتَقْبِلَ الْقِبْلَةِ، أَخْبَرَنَا بِذَلِكَ قُتَيْبَةُ، قَالَ: أَخْبَرَنَا ابْنُ لَهِيعَةَ.\nوَحَدِيثُ جَابِرٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَصَحُّ مِنْ حَدِيثِ ابْنِ لَهِيعَةَ. وَابْنُ لَهِيعَةَ ضَعِيفٌ عِنْدَ أَهْلِ الْحَدِيثِ؛ ضَعَّفَهُ يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ وَغَيْرُهُ."
		},
		"chapter_id": "f9dce7a9-2f65-460e-ae5a-da207f990aa7",
		"chapter_name": "",
		"title": {
			"en": "",
			"ms": "Bab Keharusan Mengadap Kiblat (Ketika Membuang Air)",
			"ar": "بَابُ مَا جَاءَ مِنَ الرُّخْصَةِ فِي ذَلِكَ"
		},
		"category_id": "cd2d21ff-22f6-451a-bc57-1e0d5ba4fcb1",
		"category_name": "",
		"category_title": {
			"en": "",
			"ms": "Bab-bab bersuci daripada Rasulullah",
			"ar": "أَبْوَابُ الطَّهَارَةِ عَنْ رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ"
		},
		"book_name": "jami_al_tirmidhi",
		"book_title": "Jami’ Al-Tirmidhi",
		"book_id": "c4d5ea38-2090-4f28-8ca3-40bb2639d502"
	}
]