[
    {
      "id": "08dc783f-1905-4fe1-932e-cee264a013f5",
      "footnotes": [],
      "number": "",
      "content": {
        "en": "",
        "ms": "ِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ\n\nDengan nama Allah, Maha Pemurah, Maha Mengasihani.\n\nالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ، وَالْعَاقِبَةُ لِلْمُتَّقِينَ، وَصَلَّى الله عَلَى مُحَمَّدٍ خَاتَمِ النَّبِيِّينَ، وَعَلَى جَمِيعِ الْأَنْبِيَاءِ وَالْمُرْسَلِينَ «أَمَّا بَعْدُ، فَإِنَّكَ يَرْحَمُكَ اللهُ بِتَوْفِيقِ خَالِقِكَ، ذَكَرْتَ أَنَّكَ هَمَمْتَ بِالْفَحْصِ عَنْ تَعَرُّفِ جُمْلَةِ الْأَخْبَارِ الْمَأْثُورَةِ عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي سُنَنِ الدِّينِ وَأَحْكَامِهِ، وَمَا كَانَ مِنْهَا فِي الثَّوَابِ وَالْعِقَابِ، وَالتَّرْغِيبِ وَالتَّرْهِيبِ، وَغَيْرِ ذَلِكَ مِنْ صُنُوفِ الْأَشْيَاءِ بِالْأَسَانِيدِ الَّتِي بِهَا نُقِلَتْ، وَتَدَاوَلَهَا أَهْلُ الْعِلْمِ فِيمَا بَيْنَهُمْ، فَأَرَدْتَ، أَرْشَدَكَ اللهُ أَنْ تُوَقَّفَ عَلَى جُمْلَتِهَا مُؤَلَّفَةً مُحْصَاةً، وَسَأَلْتَنِي أَنْ أُلَخِّصَهَا لَكَ فِي التَّأْلِيفِ بِلَا تَكْرَارٍ يَكْثُرُ، فَإِنَّ ذَلِكَ زَعَمْتَ مِمَّا يَشْغَلُكَ عَمَّا لَهُ قَصَدْتَ مِنَ التَّفَهُّمِ فِيهَا، وَالِاسْتِنْبَاطِ مِنْهَا، \n\nSegala puji bagi Allah, Tuhan seru sekalian alam; kesudahan yang baik buat yang menjaga hak-Nya. Allah mencurahkan pujian buat Muhammad, penutup kenabian, dan buat sekalian para nabi dan rasul.\n***\nTuan pembaca, semoga Allah merahmatimu, dengan taufik Allah telah menyuarakan yang tuan berkeinginan untuk mengetahui sejumlah hadis-hadis Nabi ﷺ, terkait aturan dan peraturan agama, terkait ganjaran dan balasan, galakan dan amaran, dan lain-lain topik yang dinukilkan melalui sanad dalam kalangan para ulama.\n\nTuan mahu, semoga Allah memberi petunjuk kepada tuan, untuk topik-topik ini boleh digapai dalam sebuah penulisan yang mudah, dan tuan meminta saya menyimpulkannya dalam sebuah buku, tanpa banyak pengulangan. Kerana menurut tuan, pengulangan menyebabkan tuan tidak dapat fokus untuk memahami dan mengeluarkan makna daripada hadis-hadis tersebut.\n\nوَلِلَّذِي سَأَلْتَ أَكْرَمَكَ اللهُ حِينَ رَجَعْتُ إِلَى تَدَبُّرِهِ، وَمَا تَؤُولُ بِهِ الْحَالُ إِنْ شَاءَ اللهُ عَاقِبَةٌ مَحْمُودَةٌ وَمَنْفَعَةٌ مَوْجُودَةٌ، وَظَنَنْتُ حِينَ سَأَلْتَنِي تَجَشُّمَ ذَلِكَ أَنْ لَوْ عُزِمَ لِي عَلَيْهِ، وَقُضِيَ لِي تَمَامُهُ، كَانَ أَوَّلُ مَنْ يُصِيبُهُ نَفْعُ ذَلِكَ إِيَّايَ خَاصَّةً قَبْلَ غَيْرِي مِنَ النَّاسِ لِأَسْبَابٍ كَثِيرَةٍ يَطُولُ بِذِكْرِهَا الْوَصْفُ، إِلَّا أَنَّ جُمْلَةَ ذَلِكَ أَنَّ ضَبْطَ الْقَلِيلِ مِنْ هَذَا الشَّأْنِ، وَإِتْقَانَهُ، أَيْسَرُ عَلَى الْمَرْءِ مِنْ مُعَالَجَةِ الْكَثِيرِ مِنْهُ، وَلَا سِيَّمَا عِنْدَ مَنْ لَا تَمْيِيزَ عِنْدَهُ مَنِ الْعَوَامِّ، إِلَّا بِأَنْ يُوَقِّفَهُ عَلَى التَّمْيِيزِ غَيْرُهُ، فَإِذَا كَانَ الْأَمْرُ فِي هَذَا كَمَا وَصَفْنَا، فَالْقَصْدُ مِنْهُ إِلَى الصَّحِيحِ الْقَلِيلِ أَوْلَى بِهِمْ مِنَ ازْدِيَادِ السَّقِيمِ، وَإِنَّمَا يُرْجَى بَعْضُ الْمَنْفَعَةِ فِي الِاسْتِكْثَارِ مِنْ هَذَا الشَّأْنِ، وَجَمْعِ الْمُكَرَّرَاتِ مِنْهُ لِخَاصَّةٍ مِنَ النَّاسِ مِمَّنْ رُزِقَ فِيهِ بَعْضُ التَّيَقُّظِ، وَالْمَعْرِفَةِ بِأَسْبَابِهِ وَعِلَلِهِ، فَذَلِكَ إِنْ شَاءَ اللهُ يَهْجُمُ بِمَا أُوتِيَ مِنْ ذَلِكَ عَلَى الْفَائِدَةِ فِي الِاسْتِكْثَارِ مِنْ جَمْعِهِ، فَأَمَّا عَوَامُّ النَّاسِ الَّذِينَ هُمْ بِخِلَافِ مَعَانِي الْخَاصِّ مِنْ أَهْلِ التَّيَقُّظِ وَالْمَعْرِفَةِ، فَلَا مَعْنَى لَهُمْ فِي طَلَبِ الْكَثِيرِ، وَقَدْ عَجَزُوا عَنْ مَعْرِفَةِ الْقَلِيلِ. \nSetelah saya fikir masak-masak permintaan tuan ini, saya dapati ia begitu bernas kerana memberi kesan yang baik dan manfaat yang pasti. Saya juga sedar sekiranya saya memenuhi hasrat ini, individu pertama yang mendapat manfaat adalah diri saya sendiri kerana sebab yang banyak, tidak dapat disebutkan di sini semuanya, tetapi antaranya: Untuk mempelajari dan menguasai hadis yang sedikit lebih mudah berbanding yang banyak, terutamanya bagi orang awam yang tidak mampu membezakan antara yang sahih dan tidak. Justeru memilih hadis sahih yang sedikit lebih baik buat mereka berbanding menambah riwayat yang bermasalah. \n\nYang akan beroleh manfaat sekiranya dihimpunkan banyak riwayat dan pengulangan adalah orang terpilih yang direzekikan sedikit kefahaman dalam bidang ini, memahami faktor dan punca sahih daif hadis. Orang sebegini, jika menceburkan diri dalam lambakan riwayat akan beroleh manfaat. Sementara orang kebanyakan yang tidak sebegitu, tiada faedah untuk mereka mendapatkan banyak riwayat sekiranya sedikit hadis pun mereka tidak mampu.\n\nثُمَّ إِنَّا إِنْ شَاءَ اللهُ مُبْتَدِئُونَ فِي تَخْرِيجِ مَا سَأَلْتَ وَتَأْلِيفِهِ، عَلَى شَرِيطَةٍ سَوْفَ أَذْكُرُهَا لَكَ، وَهُوَ إِنَّا نَعْمِدُ إِلَى جُمْلَةِ مَا أُسْنِدَ مِنَ الْأَخْبَارِ عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَنَقْسِمُهَا عَلَى ثَلَاثَةِ أَقْسَامٍ، وَثَلَاثِ طَبَقَاتٍ مِنَ النَّاسِ عَلَى غَيْرِ تَكْرَارٍ، إِلَّا أَنْ يَأْتِيَ مَوْضِعٌ لَا يُسْتَغْنَى فِيهِ عَنْ تَرْدَادِ حَدِيثٍ فِيهِ زِيَادَةُ مَعْنًى، أَوْ إِسْنَادٌ يَقَعُ إِلَى جَنْبِ إِسْنَادٍ، لِعِلَّةٍ تَكُونُ هُنَاكَ، لِأَنَّ الْمَعْنَى الزَّائِدَ فِي الْحَدِيثِ الْمُحْتَاجَ إِلَيْهِ يَقُومُ مَقَامَ حَدِيثٍ تَامٍّ، فَلَا بُدَّ مِنْ إِعَادَةِ الْحَدِيثِ الَّذِي فِيهِ مَا وَصَفْنَا مِنَ الزِّيَادَةِ، أَوْ أَنْ يُفَصَّلَ ذَلِكَ الْمَعْنَى مِنْ جُمْلَةِ الْحَدِيثِ عَلَى اخْتِصَارِهِ إِذَا أَمْكَنَ، وَلَكِنْ تَفْصِيلُهُ رُبَّمَا عَسُرَ مِنْ جُمْلَتِهِ، فَإِعَادَتُهُ بِهَيْئَتِهِ إِذَا ضَاقَ ذَلِكَ أَسْلَمُ، فَأَمَّا مَا وَجَدْنَا بُدًّا مِنْ إِعَادَتِهِ بِجُمْلَتِهِ مِنْ غَيْرِ حَاجَةٍ مِنَّا إِلَيْهِ، فَلَا نَتَوَلَّى فِعْلَهُ إِنْ شَاءَ اللهُ تَعَالَى \" \n\nInsya-Allah, kita akan mulakan projek mengeluarkan dan menyusun hadis-hadis yang tuan pinta, menurut syarat-syarat yang akan dinyatakan:\n\nKita memilih sejumlah khabar bersanad daripada Rasulullah ﷺ, kemudian kita bahagikan kepada tiga kumpulan, berdasarkan tiga tahapan rawinya, tanpa pengulangan kecuali jika keadaan menuntutnya dek terdapat penambahan makna. Kerana makna tambahan tersebut berada sama kedudukan dengan hadis yang sempurna. Atau kita ulang jika terdapat perincian bagi makna hadis yang sukar difahami. Tambahan-tambahan makna yang tidak diperlukan, insya-Allah kita tidak mengulangnya.\n\n\nفَأَمَّا الْقِسْمُ الْأَوَّلُ، فَإِنَّا نَتَوَخَّى أَنْ نُقَدِّمَ الْأَخْبَارَ الَّتِي هِيَ أَسْلَمُ مِنَ الْعُيُوبِ مِنْ غَيْرِهَا، وَأَنْقَى مِنْ أَنْ يَكُونَ نَاقِلُوهَا أَهْلَ اسْتِقَامَةٍ فِي الْحَدِيثِ، وَإِتْقَانٍ لِمَا نَقَلُوا، لَمْ يُوجَدْ فِي رِوَايَتِهِمْ اخْتِلَافٌ شَدِيدٌ، وَلَا تَخْلِيطٌ فَاحِشٌ، كَمَا قَدْ عُثِرَ فِيهِ عَلَى كَثِيرٍ مِنَ الْمُحَدِّثِينَ، وَبَانَ ذَلِكَ فِي حَدِيثِهِمْ، فَإِذَا نَحْنُ تَقَصَّيْنَا أَخْبَارَ هَذَا الصِّنْفِ مِنَ النَّاسِ، أَتْبَعْنَاهَا أَخْبَارًا يَقَعُ فِي أَسَانِيدِهَا بَعْضُ مَنْ لَيْسَ بِالْمَوْصُوفِ بِالْحِفْظِ وَالْإِتْقَانِ، كَالصِّنْفِ الْمُقَدَّمِ قَبْلَهُمْ، عَلَى أَنَّهُمْ وَإِنْ كَانُوا فِيمَا وَصَفْنَا دُونَهُمْ، فَإِنَّ اسْمَ السَّتْرِ، وَالصِّدْقِ، وَتَعَاطِي الْعِلْمِ يَشْمَلُهُمْ كَعَطَاءِ بْنِ السَّائِبِ، وَيَزِيدَ بْنِ أَبِي زِيَادٍ، وَلَيْثِ بْنِ أَبِي سُلَيْمٍ، وَأَضْرَابِهِمْ مِنْ حُمَّالِ الْآثَارِ، وَنُقَّالِ الْأَخْبَارِ، فَهُمْ وَإِنْ كَانُوا بِمَا وَصَفْنَا مِنَ الْعِلْمِ، وَالسَّتْرِ عِنْدَ أَهْلِ الْعِلْمِ مَعْرُوفِينَ، فَغَيْرُهُمْ مِنْ أَقْرَانِهِمْ مِمَّنْ عِنْدَهُمْ مَا ذَكَرْنَا مِنَ الْإِتْقَانِ، وَالِاسْتِقَامَةِ فِي الرِّوَايَةِ يَفْضُلُونَهُمْ فِي الْحَالِ وَالْمَرْتَبَةِ، لِأَنَّ هَذَا عِنْدَ أَهْلِ الْعِلْمِ دَرَجَةٌ رَفِيعَةٌ، وَخَصْلَةٌ سَنِيَّةٌ، أَلَا تَرَى أَنَّكَ إِذَا وَازَنْتَ هَؤُلَاءِ الثَّلَاثَةَ الَّذِينَ سَمَّيْنَاهُمْ عَطَاءً، وَيَزِيدَ، وَلَيْثًا، بِمَنْصُورِ بْنِ الْمُعْتَمِرِ، وَسُلَيْمَانَ الْأَعْمَشِ، وَإِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ فِي إِتْقَانِ الْحَدِيثِ وَالِاسْتِقَامَةِ فِيهِ، وَجَدْتَهُمْ مُبَايِنِينَ لَهُمْ، لَا يُدَانُونَهُمْ لَا شَكَّ عِنْدَ أَهْلِ الْعِلْمِ بِالْحَدِيثِ فِي ذَلِكَ، لِلَّذِي اسْتَفَاضَ عِنْدَهُمْ مِنْ صِحَّةِ حِفْظِ مَنْصُورٍ، وَالْأَعْمَشِ، وَإِسْمَاعِيلَ، وَإِتْقَانِهِمْ لِحَدِيثِهِمْ، وَأَنَّهُمْ لَمْ يَعْرِفُوا مِثْلَ ذَلِكَ مِنْ عَطَاءٍ، وَيَزِيدَ، وَلَيْثٍ، وَفِي مِثْلِ مَجْرَى هَؤُلَاءِ إِذَا وَازَنْتَ بَيْنَ الْأَقْرَانِ كَابْنِ عَوْنٍ، وَأَيُّوبَ السَّخْتِيَانِيِّ، مَعَ عَوْفِ بْنِ أَبِي جَمِيلَةَ، وَأَشْعَثَ الْحُمْرَانِيِّ، وَهُمَا صَاحِبَا الْحَسَنِ، وَابْنِ سِيرِينَ، كَمَا أَنَّ ابْنَ عَوْنٍ، وَأَيُّوبَ صَاحِبَاهُمَا، إِلَّا أَنَّ الْبَوْنَ بَيْنَهُمَا، وَبَيْنَ هَذَيْنِ بَعِيدٌ فِي كَمَالِ الْفَضْلِ، وَصِحَّةِ النَّقْلِ، وَإِنْ كَانَ عَوْفٌ، وَأَشْعَثُ غَيْرَ مَدْفُوعَيْنِ عَنْ صِدْقٍ وَأَمَانَةٍ عِنْدَ أَهْلِ الْعِلْمِ، وَلَكِنَّ الْحَالَ مَا وَصَفْنَا مِنَ الْمَنْزِلَةِ عِنْدَ أَهْلِ الْعِلْمِ، \n\nHadis kumpulan pertama adalah riwayat yang sejahtera daripada sebarang kecacatan, yang rekod perawinya paling bersih, paling iltizam dan menekuni riwayat mereka, di mana tidak terdapat perbezaan yang teruk dalam riwayat mereka, atau kekeliruan yang jelas, seperti yang selalu ditemui pada riwayat ramai ahli hadis secara jelas. \nSetelah kita bawa riwayat kumpulan ini, kita turuti dengan sanad-sanad yang mengandungi perawi yang kualitinya tidak setahap perawi sebelum ini. Tetapi mereka masih dikenali dengan tahap mastur, saduq dan menuntut ilmu; seperti ‘Atha’ bin al-Sa’ib, Yazid bin Abu Ziyad, Layts bin Abu Sulaym, dan yang setaraf dengan mereka. Meskipun mereka berstatus mastur, tetapi masih tidak menyaingi tahap perawi pertama. Kedudukan yang pertama ini berada di tahap yang tinggi dengan kualiti riwayat yang jitu dalam kalangan ulama. \nJika kamu bandingkan ‘Atha’, Yazid dan Layts dengan Manshur bin al-Mu‘tamir, Sulayman al-A‘masy dan Isma‘il bin Abu Khalid dari sudut kualiti riwayat, kamu akan temui perbezaan yang sangat, sangat jelas, yang tidak diragui oleh mana-mana ahli hadis. Begitu juga jika kamu banding antara pelajar seperguruan, seperti antara ibn ‘Awn dan Ayyub al-Sakhtiyani, dengan ‘Awf bin Abu Jamilah dan Asy‘ats al-Humrani, meskipun mereka semua berguru dengan al-Hasan dan ibn Sirin, tetapi beza kualiti periwayatan antara dua kumpulan ini sangat berbeza.\n\nوَإِنَّمَا مَثَّلْنَا هَؤُلَاءِ فِي التَّسْمِيَةِ لِيَكُونَ تَمْثِيلُهُمْ سِمَةً يَصْدُرُ عَنْ فَهْمِهَا مَنْ غَبِيَ عَلَيْهِ طَرِيقُ أَهْلِ الْعِلْمِ فِي تَرْتِيبِ أَهْلِهِ فِيهِ، فَلَا يَقْصُرُ بِالرَّجُلِ الْعَالِي الْقَدْرِ عَنْ دَرَجَتِهِ، وَلَا يُرْفَعُ مُتَّضِعُ الْقَدْرِ فِي الْعِلْمِ فَوْقَ مَنْزِلَتِهِ، وَيُعْطَى كُلُّ ذِي حَقٍّ فِيهِ حَقَّهُ، وَيُنَزَّلُ مَنْزِلَتَهُ، وَقَدْ ذُكِرَ عَنْ عَائِشَةَ رَضِيَ اللهُ تَعَالَى عَنْهَا، أَنَّهَا قَالَتْ: أَمَرَنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ نُنَزِّلَ النَّاسَ مَنَازِلَهُمْ مَعَ مَا نَطَقَ بِهِ الْقُرْآنُ، مِنْ قَوْلِ اللهُ تَعَالَى: {وَفَوْقَ كُلِّ ذِي عِلْمٍ عَلِيمٌ} [يوسف: 76]، فَعَلَى نَحْوِ مَا ذَكَرْنَا مِنَ الْوُجُوهِ، نُؤَلِّفُ مَا سَأَلْتَ مِنَ الْأَخْبَارِ عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ، فَأَمَّا مَا كَانَ مِنْهَا عَنْ قَوْمٍ هُمْ عِنْدَ أَهْلِ الْحَدِيثِ مُتَّهَمُونَ، أَوْ عِنْدَ الْأَكْثَرِ مِنْهُمْ، فَلَسْنَا نَتَشَاغَلُ بِتَخْرِيجِ حَدِيثِهِمْ، كَعَبْدِ اللهِ بْنِ مِسْوَرٍ أَبِي جَعْفَرٍ الْمَدَائِنِيِّ، وَعَمْرِو بْنِ خَالِدٍ، وَعَبْدِ الْقُدُّوسِ الشَّامِيِّ، وَمُحَمَّدِ بْنِ سَعِيدٍ الْمَصْلُوبِ، وَغِيَاثِ بْنِ إِبْرَاهِيمَ، وَسُلَيْمَانَ بْنِ عَمْرٍو أَبِي دَاوُدَ النَّخَعِيِّ، وَأَشْبَاهِهِمْ مِمَّنِ اتُّهِمَ بِوَضْعِ الْأَحَادِيثِ، وَتَوْلِيدِ الْأَخْبَارِ \" وَكَذَلِكَ، مَنِ الْغَالِبُ عَلَى حَدِيثِهِ الْمُنْكَرُ، أَوِ الْغَلَطُ أَمْسَكْنَا أَيْضًا عَنْ حَدِيثِهِمْ، وَعَلَامَةُ الْمُنْكَرِ فِي حَدِيثِ الْمُحَدِّثِ، إِذَا مَا عُرِضَتْ رِوَايَتُهُ لِلْحَدِيثِ عَلَى رِوَايَةِ غَيْرِهِ مَنْ أَهْلِ الْحِفْظِ وَالرِّضَا، خَالَفَتْ رِوَايَتُهُ رِوَايَتَهُمْ، أَوْ لَمْ تَكَدْ تُوَافِقُهَا، فَإِذَا كَانَ الْأَغْلَبُ مِنْ حَدِيثِهِ كَذَلِكَ كَانَ مَهْجُورَ الْحَدِيثِ، غَيْرَ مَقْبُولِهِ، وَلَا مُسْتَعْمَلِهِ، فَمِنْ هَذَا الضَّرْبِ مِنَ الْمُحَدِّثِينَ: عَبْدُ اللهِ بْنُ مُحَرَّرٍ، وَيَحْيَى بْنُ أَبِي أُنَيْسَةَ، وَالْجَرَّاحُ بْنُ الْمِنْهَالِ أَبُو الْعَطُوفِ، وَعَبَّادُ بْنُ كَثِيرٍ، وَحُسَيْنُ بْنُ عَبْدِ اللهِ بْنِ ضُمَيْرَةَ، وَعُمَرُ بْنُ صُهْبَانَ، وَمَنْ نَحَا نَحْوَهُمْ فِي رِوَايَةِ الْمُنْكَرِ مِنَ الْحَدِيثِ، فَلَسْنَا نُعَرِّجُ عَلَى حَدِيثِهِمْ، وَلَا نَتَشَاغَلُ بِهِ، لِأَنَّ حُكْمَ أَهْلِ الْعِلْمِ، وَالَّذِي نَعْرِفُ مِنْ مَذْهَبِهِمْ فِي قَبُولِ مَا يَتَفَرَّدُ بِهِ الْمُحَدِّثُ مِنَ الْحَدِيثِ أَنْ يَكُونَ قَدْ شَارَكَ الثِّقَاتِ مِنْ أَهْلِ الْعِلْمِ وَالْحِفْظِ فِي بَعْضِ مَا رَوَوْا، وَأَمْعَنَ فِي ذَلِكَ عَلَى الْمُوَافَقَةِ لَهُمْ، فَإِذَا وُجِدَ كَذَلِكَ، ثُمَّ زَادَ بَعْدَ ذَلِكَ شَيْئًا لَيْسَ عِنْدَ أَصْحَابِهِ قُبِلَتْ زِيَادَتُهُ، فَأَمَّا مَنْ تَرَاهُ يَعْمِدُ لِمِثْلِ الزُّهْرِيِّ فِي جَلَالَتِهِ، وَكَثْرَةِ أَصْحَابِهِ الْحُفَّاظِ الْمُتْقِنِينَ لِحَدِيثِهِ وَحَدِيثِ غَيْرِهِ، أَوْ لِمِثْلِ هِشَامِ بْنِ عُرْوَةَ، وَحَدِيثُهُمَا عِنْدَ أَهْلِ الْعِلْمِ مَبْسُوطٌ مُشْتَرَكٌ، قَدْ نَقَلَ أَصْحَابُهُمَا عَنْهُمَا حَدِيثَهُمَا عَلَى الِاتِّفَاقِ مِنْهُمْ فِي أَكْثَرِهِ، فَيَرْوِي عَنْهُمَا، أَوْ عَنْ أَحَدِهِمَا الْعَدَدَ مِنَ الْحَدِيثِ مِمَّا لَا يَعْرِفُهُ أَحَدٌ مِنْ أَصْحَابِهِمَا، وَلَيْسَ مِمَّنْ قَدْ شَارَكَهُمْ فِي الصَّحِيحِ مِمَّا عِنْدَهُمْ، فَغَيْرُ جَائِزٍ قَبُولُ حَدِيثِ هَذَا الضَّرْبِ مِنَ النَّاسِ وَاللهُ أَعْلَمُ.\n\nTujuan kita menggariskan dua tahapan ini dengan nama-nama contohnya, agar ia menjadi kaedah untuk menjelaskan letak duduk seseorang perawi yang sebenar; maka tidak direndahkan perawi yang jitu dan berkualiti, serta tidak diangkat perawi yang rendah duduknya melebihi kedudukan sebenarnya. Bahkan setiap empunya hak diberikan haknya, diletakkan pada tempatnya. Diriwayatkan daripada ‘A’isyah , beliau berkata: “Rasulullah ﷺ menyuruh kami untuk meletakkan manusia pada kedudukan sebenar mereka.” Al-Quran juga menyebutkan, “Atas setiap yang berilmu ada yang lebih berilmu.”\n\nAtas manfaat yang kita sebutkan ini, kita susun sebuah buku seperti yang tuan pinta menghimpun beberapa khabar berkenaan Nabi ﷺ.\n\nSebarang khabar yang direkodkan oleh perawi yang tertuduh di sisi semua atau kebanyakan ahli hadis, kita tidak akan menyibukkan diri mengeluarkannya di dalam buku ini; seperti Abdullah bin Miswar Abu Ja‘far al-Mada’ini, ‘Amr bin Khalid, Abdul Quddus al-Syami, Muhammad bin Sa‘id al-Mashlub, Ghiyats bin Ibrahim, Sulayman bin ‘Amr Abu Dawud al-Nakha‘i, dan seumpama mereka yang tertuduh melakukan hadis palsu dan merekayasa khabar.\n\nBegitu juga kita tahan diri kita daripada memuatkan perawi yang kebanyakan hadisnya adalah munkar atau banyak salah. Petanda ke-munkar-an hadis seseorang adalah apabila ia dibandingkan dengan hadis-hadis perawinya thiqah, kita dapati ia saling bersalahan, atau tidak bersetujuan. Jika kebanyakan riwayatnya begitu, maka perawi itu hadisnya diabaikan, tidak diterima dan tidak diamalkan.  Antara perawi sebegini: Abdullah bin Muharrar, Yahya bin Abu Unaysah, al-Jarrah bin al-Minhal Abu al-‘Athuf, ‘Abbad bin Katsir, Husayn bin Abdullah bin Dhumayrah, ‘Umar bin Shuhban, dan selain mereka. Kita tidak akan membawa hadis mereka atau tambahan mereka.\nKerana keputusan rasmi para ulama adalah hanya menerima riwayat persendirian yang membawa makna tambahan daripada perawi thiqah sahaja. Cuma tokoh-tokoh agung seperti al-Zuhri dan Hisyam bin ‘Urwah yang memiliki banyak anak-anak murid yang thiqah, yang meriwayatkan daripada dua tokoh ini secara selari, sekiranya terdapat tambahan yang tidak diketahui pelajar yang thiqah dari pelajar yang kurang thiqah, maka tambahan sebegini juga tidak diterima. Wallahu a’lam.\n\nقَدْ شَرَحْنَا مِنْ مَذْهَبِ الْحَدِيثِ وَأَهْلِهِ بَعْضَ مَا يَتَوَجَّهُ بِهِ مَنْ أَرَادَ سَبِيلَ الْقَوْمِ، وَوُفِّقَ لَهَا، وَسَنَزِيدُ، إِنْ شَاءَ اللهُ تَعَالَى شَرْحًا وَإِيضَاحًا فِي مَوَاضِعَ مِنَ الْكِتَابِ عِنْدَ ذِكْرِ الْأَخْبَارِ الْمُعَلَّلَةِ، إِذَا أَتَيْنَا عَلَيْهَا فِي الْأَمَاكِنِ الَّتِي يَلِيقُ بِهَا الشَّرْحُ وَالْإِيضَاحُ، إِنْ شَاءَ اللهُ تَعَالَى، وَبَعْدُ، يَرْحَمُكَ اللهُ، فَلَوْلَا الَّذِي رَأَيْنَا مِنْ سُوءِ صَنِيعِ كَثِيرٍ مِمَّنْ نَصَبَ نَفْسَهُ مُحَدِّثًا، فِيمَا يَلْزَمُهُمْ مِنْ طَرْحِ الْأَحَادِيثِ الضَّعِيفَةِ، وَالرِّوَايَاتِ الْمُنْكَرَةِ، وَتَرْكِهِمُ الِاقْتِصَارَ عَلَى الْأَحَادِيثِ الصَّحِيحَةِ الْمَشْهُورَةِ مِمَّا نَقَلَهُ الثِّقَاتُ الْمَعْرُوفُونَ بِالصِّدْقِ وَالْأَمَانَةِ، بَعْدَ مَعْرِفَتِهِمْ وَإِقْرَارِهِمْ بِأَلْسِنَتِهِمْ أَنَّ كَثِيرًا مِمَّا يَقْذِفُونَ بِهِ إِلَى الْأَغْبِيَاءِ مِنَ النَّاسِ هُوَ مُسْتَنْكَرٌ، وَمَنْقُولٌ عَنْ قَوْمٍ غَيْرِ مَرْضِيِّينَ مِمَّنْ ذَمَّ الرِّوَايَةِ عَنْهُمْ أَئِمَّةُ أَهْلِ الْحَدِيثِ مِثْلُ مَالِكِ بْنِ أَنَسٍ، وَشُعْبَةَ بْنِ الْحَجَّاجِ، وَسُفْيَانَ بْنِ عُيَيْنَةَ، وَيَحْيَى بْنِ سَعِيدٍ الْقَطَّانِ، وَعَبْدِ الرَّحْمَنِ بْنِ مَهْدِيٍّ، وَغَيْرِهِمْ مِنَ الْأَئِمَّةِ، لَمَا سَهُلَ عَلَيْنَا الِانْتِصَابُ لِمَا سَأَلْتَ مِنَ التَّمْيِيزِ، وَالتَّحْصِيلِ، وَلَكِنْ مِنْ أَجْلِ مَا أَعْلَمْنَاكَ مِنْ نَشْرِ الْقَوْمِ الْأَخْبَارَ الْمُنْكَرَةَ بِالْأَسَانِيدِ الضِّعَافِ الْمَجْهُولَةِ، وَقَذْفِهِمْ بِهَا إِلَى الْعَوَامِّ الَّذِينَ لَا يَعْرِفُونَ عُيُوبَهَا، خَفَّ عَلَى قُلُوبِنَا إِجَابَتُكَ إِلَى مَا سَأَلْتَ.\n\nTelah kita jelaskan pendirian ahli hadis untuk dijadikan pedoman sesiapa yang mahu menuruti mereka. Kita akan tambah lagi, insya-Allah, penerangannya pada topik-topik mendatang ketika membawa contoh-contoh khabar bermasalah yang sesuai diberi penjelasan lanjut.\n\n***\n\nJika bukan kerana fenomena yang kita lihat dalam kalangan pengaku ahli hadis, yang mengabaikan kewajipan mereka untuk membuang hadis-hadis daif dan riwayat-riwayat munkar, serta bercukupan dengan hadis-hadis sahih yang masyhur, yang dinukilkan para perawi yang thiqah, yang dikenali dengan ketelusan dan amanah, setelah mereka mengakui secara zahirnya bahawa kebanyakan riwayat orang-orang bodoh itu adalah munkar, tidak diredai di sisi ulama ahli hadis seperti Malik bin Anas, Syu‘bah bin al-Hajjaj, Sufyan bin ‘Uyaynah, Yahya bin Sa‘id al-Qaththan, Abdul Rahman bin Mahdi dan selain mereka; pasti kami sendiri ragu untuk memenuhi permintaan tuan untuk menapis dan menyimpulkan hadis-hadis Nabi ﷺ. Tetapi justeru kerana sebab yang kami telah sebutkan, iaitu kedegilan mereka menyebarkan khabar yang munkar dengan sanad yang lemah dan tidak dikenali, menyampaikan hadis-hadis yang tidak mereka ketahui kelemahannya, tenang hati kami untuk menyahut permintaan tuan.\n\n",
        "ar": ""
      },
      "chapter_id": "",
      "chapter_name": "",
      "chapter_transliteration": {
        "en": "",
        "ms": ""
      },
      "chapter_title": {
        "en": "",
        "ms": "",
        "ar": ""
      },
      "volume_id": "2b1bc287-cdea-4e51-b5d3-f6fa0ce31235",
      "volume_name": "",
      "volume_transliteration": {
        "en": "",
        "ms": ""
      },
      "volume_title": {
        "en": "",
        "ms": "Pengantar",
        "ar": ""
      },
      "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
      "book_name": "sahih_muslim",
      "book_title": {
        "en": "",
        "ms": "Sahih Muslim",
        "ar": ""
      }
    },
    {
        "id": "8af980e0-a0ff-40e0-a93d-3c4390a9e2f0",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "Ketahuilah, semoga Allah membimbingmu, bahawasanya wajib untuk setiap individu [yang menyampaikan hadis] untuk membezakan antara riwayat yang sahih dan riwayat yang bermasalah, antara perawi yang thiqah dan perawi yang dituduh berdusta; agar dia tidak meriwayatkan melainkan yang sahih belaka, atau bersumberkan perawi yang mastur, serta menjauhi dari golongan tertuduh dan ahli bidaah yang degil. Dalilnya adalah firman Allah, “Wahai orang-orang beriman, sekiranya seorang fasiq datang membawa suatu khabar kepadamu, hendaklah kamu memastikan terlebih dahulu kebenaran khabar tersebut; takut-takut kamu tersilap berkenaan sekumpulan orang kerana kejahilan, maka kamu menjadi sesal atas tindakanmu,” dan firman Allah, “Lantiklah saksi daripada orang-orang yang kamu redai kejujurannya,” dan firman Allah, “Lantiklah saksi dua orang yang adil daripada kalangan kamu.”\n\nAyat-ayat ini menjadi dalil bahawa khabar yang dibawa orang fasiq adalah tidak bernilai, tidak diterima; persaksian orang yang tidak adil juga tertolak. Meskipun khabar berbeza maknanya dengan persaksian pada sesetengah aspek, tetapi keduanya berkongsi pada aspek terbesar; justeru itu khabar yang dibawa fasiq tidak dapat diterima sebagaimana persaksiannya ditolak menurut ijmak.\n\nSunnah juga menjadi dalil untuk menolak periwayatan khabar munkar sama seperti al-Quran, iaitu hadis Rasulullah ﷺ yang terkenal, “Sesiapa yang menyampaikan sebuah hadis daripadaku, padahal dia sangka ia adalah dusta, maka dia adalah salah seorang daripada para pendusta.” Abu Bakr bin Abu Syaybah menyampaikan kepada kami, beliau berkata: Waki‘ menyampaikan kepada kami, daripada Syu‘bah, daripada Abdul Rahman bin Abu Layla, daripada Samurah bin Jundab. Dalam sanad yang lain, Abu Bakr bin Abu Syaybah menyampaikan kepada kami, beliau berkata: Waki‘ menyampaikan kepada kami, daripada Syu‘bah, daripada Habib, daripada Maymun bin Abu Syabib, daripada al-Mughirah bin Syu‘bah. Beliau dan Samurah berkata: Rasulullah ﷺ bersabda... seperti yang telah kita nyatakan.",
          "ar": "وَاعْلَمْ وَفَّقَكَ اللهُ تَعَالَى أَنَّ الْوَاجِبَ عَلَى كُلِّ أَحَدٍ عَرَفَ التَّمْيِيزِ بَيْنَ صَحِيحِ الرِّوَايَاتِ وَسَقِيمِهَا، وَثِقَاتِ النَّاقِلِينَ لَهَا مِنَ الْمُتَّهَمِينَ، أَنْ لَا يَرْوِيَ مِنْهَا إِلَّا مَا عَرَفَ صِحَّةَ مَخَارِجِهِ، وَالسِّتَارَةَ فِي نَاقِلِيهِ، وَأَنْ يَتَّقِيَ مِنْهَا مَا كَانَ مِنْهَا عَنْ أَهْلِ التُّهَمِ وَالْمُعَانِدِينَ مِنْ أَهْلِ الْبِدَعِ، وَالدَّلِيلُ عَلَى أَنَّ الَّذِي قُلْنَا مِنْ هَذَا هُوَ اللَّازِمُ دُونَ مَا خَالَفَهُ، قَوْلُ اللهُ جَلَّ ذِكْرُهُ: {يَا أَيُّهَا الَّذِينَ آمَنُوا إِنْ جَاءَكُمْ فَاسِقٌ بِنَبَأٍ فَتَبَيَّنُوا أَنْ تُصِيبُوا قَوْمًا بِجَهَالَةٍ فَتُصْبِحُوا عَلَى مَا فَعَلْتُمْ نَادِمِينَ} [الحجرات: 6]، وَقَالَ جَلَّ ثَنَاؤُهُ: {مِمَّنْ تَرْضَوْنَ مِنَ الشُّهَدَاءِ} [البقرة: 282]، وَقَالَ عَزَّ وَجَلَّ: {وَأَشْهِدُوا ذَوَيْ عَدْلٍ مِنْكُمْ} [الطلاق: 2]، فَدَلَّ بِمَا ذَكَرْنَا مِنْ هَذِهِ الْآيِ أَنَّ خَبَرَ الْفَاسِقِ سَاقِطٌ غَيْرُ مَقْبُولٍ، وَأَنَّ شَهَادَةَ غَيْرِ الْعَدْلِ مَرْدُودَةٌ، وَالْخَبَرُ وَإِنْ فَارَقَ مَعْنَاهُ مَعْنَى الشَّهَادَةِ فِي بَعْضِ الْوُجُوهِ، فَقَدْ يَجْتَمِعَانِ فِي أَعْظَمِ مَعَانِيهِمَا، إِذْ كَانَ خَبَرُ الْفَاسِقِ غَيْرَ مَقْبُولٍ عِنْدَ أَهْلِ الْعِلْمِ كَمَا أَنَّ شَهَادَتَهُ مَرْدُودَةٌ عِنْدَ جَمِيعِهِمْ، وَدَلَّتِ السُّنَّةُ عَلَى نَفْيِ رِوَايَةِ الْمُنْكَرِ مِنَ الْأَخْبَارِ كَنَحْوِ دَلَالَةِ الْقُرْآنِ عَلَى نَفْيِ خَبَرِ الْفَاسِقِ، وَهُوَ الْأَثَرُ الْمَشْهُورُ عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «مَنْ حَدَّثَ عَنِّي بِحَدِيثٍ يُرَى أَنَّهُ كَذِبٌ، فَهُوَ أَحَدُ الْكَاذِبِينَ». حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ شُعْبَةَ، عَنِ الْحَكَمِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ سَمُرَةَ بْنِ جُنْدَبٍ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ أَيْضًا، حَدَّثَنَا وَكِيعٌ، عَنْ شُعْبَةَ، وَسُفْيَانَ، عَنْ حَبِيبٍ، عَنْ مَيْمُونِ بْنِ أَبِي شَبِيبٍ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، قَالَا: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ذَلِكَ"
        },
        "chapter_id": "51533b87-dc21-49e5-aa55-b54ef8974f22",
        "chapter_name": "",
        "chapter_transliteration": {
            "en": "",
            "ms": "Bāb Wujūb al-Riwāyah ʿan al-Thiqāt wa Tark al-Kadhdhābīn"
        },
        "chapter_title": {
            "en": "",
            "ms": "Bab Wajib Hanya Meriwayatkan Hadis daripada Thiqah Sahaja, dan Meninggalkan Riwayat Para Pendusta",
            "ar": "َابُ وُجُوبِ الرِّوَايَةِ عَنِ الثِّقَاتِ، وَتَرْكِ الْكَذَّابِينَ"
        },
        "volume_id": "",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": ""
        },
        "volume_title": {
          "en": "",
          "ms": "",
          "ar": ""
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "e58b678e-630e-4379-893a-2645a375aeef",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "",
          "ar": " "
        },
        "chapter_id": "",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": ""
        },
        "chapter_title": {
          "en": "",
          "ms": "",
          "ar": ""
        },
        "volume_id": "2b1bc287-cdea-4e51-b5d3-f6fa0ce31235",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": ""
        },
        "volume_title": {
            "en": "",
            "ms": "Pengantar",
            "ar": ""
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "c1c613c3-4099-44d1-96a0-16d3af52126f",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "1 – (1) Abu Bakar bin Abu Syaybah menyampaikan kepada kami, beliau berkata: Ghundar menyampaikan kepada kami, daripada Syu‘bah… Dalam sanad yang lain, Muhammad bin al-Mutsanna dan ibn Basysyar juga menyampaikan kepada kami, mereka berkata: Muhammad bin Jaafar menyampaikan kepada kami, beliau berkata: Syu‘bah menyampaikan kepada kami, daripada Manshur, daripada Rib‘i bin Hirasy, beliau mendengar ‘Ali  berucap dalam sebuah khutbah: Rasulullah ﷺ bersabda, “Janganlah kalian berdusta atas namaku, kerana sesiapa yang berdusta atas namaku, pasti akan masuk neraka.”",
          "ar": "1 - (1) وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا غُنْدَرٌ، عَنْ شُعْبَةَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةَ، عَنْ مَنْصُورٍ، عَنْ رِبْعِيِّ بْنِ حِرَاشٍ، أَنَّهُ سَمِعَ عَلِيًّا رَضِيَ اللهُ عَنْهُ يَخْطُبُ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا تَكْذِبُوا عَلَيَّ، فَإِنَّهُ مَنْ يَكْذِبْ عَلَيَّ يَلِجِ النَّارَ»"
        },
        "chapter_id": "5aeb2203-056c-4075-a873-96ea7e0ef75f",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb fī al-Taḥdhīr min al-Kadhib ʿalā Rasūlillāh Ṣallallāhu Taʿālā ʿAlayhi wa Sallam"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab Peringatan Daripada Perbuatan Berdusta atas Nama Rasulullah ﷺ",
          "ar": "بَابُ فِي التَّحْذِيرِ مِنَ الْكَذِبِ عَلَى رَسُولِ اللهِ صَلَّى اللهُ تَعَالَى عَلَيْهِ وَسَلَّمَ"
        },
        "volume_id": "2b1bc287-cdea-4e51-b5d3-f6fa0ce31235",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": ""
        },
        "volume_title": {
          "en": "",
          "ms": "Pengantar",
          "ar": ""
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "597141d8-fb6a-4205-9843-49e94e109503",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "2 – (2) Zuhayr bin Harb menyampaikan kepada saya, beliau berkata: Isma‘il – ibn ‘Ulayyah – menyampaikan kepada kami, daripada ‘Abdul ‘Aziz bin Shuhayb, daripada Anas bin Malik , beliau berkata: Yang benar-benar menghalang saya daripada menyampaikan banyak hadis kepada kalian adalah sabdaan Rasulullah ﷺ, “Sesiapa yang sengaja berdusta atas namaku, maka tempahlah tempat duduknya dalam neraka.”",
          "ar": "2 - (2) وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ يَعْنِي ابْنَ عُلَيَّةَ، عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّهُ قَالَ: إِنَّهُ لَيَمْنَعُنِي أَنْ أُحَدِّثَكُمْ حَدِيثًا كَثِيرًا أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «مَنْ تَعَمَّدَ عَلَيَّ كَذِبًا، فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ»"
        },
        "chapter_id": "5aeb2203-056c-4075-a873-96ea7e0ef75f",
        "chapter_name": "",
        "chapter_transliteration": {
            "en": "",
            "ms": "Bāb fī al-Taḥdhīr min al-Kadhib ʿalā Rasūlillāh Ṣallallāhu Taʿālā ʿAlayhi wa Sallam"
        },
        "chapter_title": {
            "en": "",
            "ms": "Bab Peringatan Daripada Perbuatan Berdusta atas Nama Rasulullah ﷺ",
            "ar": "بَابُ فِي التَّحْذِيرِ مِنَ الْكَذِبِ عَلَى رَسُولِ اللهِ صَلَّى اللهُ تَعَالَى عَلَيْهِ وَسَلَّمَ"
        },
        "volume_id": "2b1bc287-cdea-4e51-b5d3-f6fa0ce31235",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": ""
        },
        "volume_title": {
          "en": "",
          "ms": "Pengantar",
          "ar": ""
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "072b14c9-2ea7-46d2-962b-a7e17f5eaadd",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "4 – (4) Muhammad bin Abdullah bin Numayr juga menyampaikan kepada kami, beliau berkata: Bapa saya menyampaikan kepada kami, beliau berkata: Sa‘id bin ‘Ubayd menyampaikan kepada kami, beliau berkata: ‘Ali bin Rabi‘ah menyampaikan kepada kami, beliau berkata: Saya pernah ke Masjid [Kufah] ketika al-Mughirah menjadi datuk bandar di sana, beliau berucap: Saya mendengar Rasulullah ﷺ bersabda, “Sungguh! Berdusta atas namaku tidak seperti berdusta dengan orang lain. Sesiapa yang berdusta atas namaku dengan sengaja, maka persiapkanlah tempatnya di dalam neraka.”\n\n(...) ‘Ali bin Hujr al-Sa‘di juga menyampaikan kepada saya, beliau berkata: ‘Ali bin Mushir menyampaikan kepada kami, beliau berkata: Muhammad bin Qays al-Asadi mengkhabarkan kepada kami, daripada ‘Ali bin Rabi‘ah al-Asadi, daripada al-Mughirah bin Syu‘bah, daripada Nabi ﷺ, dengan riwayat yang serupa, tanpa lafaz: “Sungguh! Berdusta atas namaku tidak seperti berdusta dengan orang lain.”",
          "ar": "4 - (4) وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا سَعِيدُ بْنُ عُبَيْدٍ، حَدَّثَنَا عَلِيُّ بْنُ رَبِيعَةَ، قَالَ: أَتَيْتُ الْمَسْجِدَ وَالْمُغِيرَةُ أَمِيرُ الْكُوفَةِ، قَالَ: فَقَالَ الْمُغِيرَةُ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ: «إِنَّ كَذِبًا عَلَيَّ لَيْسَ كَكَذِبٍ عَلَى أَحَدٍ، فَمَنْ كَذَبَ عَلَيَّ مُتَعَمِّدًا، فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ» وحَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، أَخْبَرَنَا مُحَمَّدُ بْنُ قَيْسٍ الْأَسَدِيُّ، عَنْ عَلِيِّ بْنِ رَبِيعَةَ الْأَسَدِيِّ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ، وَلَمْ يَذْكُرْ: «إِنَّ كَذِبًا عَلَيَّ لَيْسَ كَكَذِبٍ عَلَى أَحَدٍ»"
        },
        "chapter_id": "5aeb2203-056c-4075-a873-96ea7e0ef75f",
        "chapter_name": "",
        "chapter_transliteration": {
            "en": "",
            "ms": "Bāb fī al-Taḥdhīr min al-Kadhib ʿalā Rasūlillāh Ṣallallāhu Taʿālā ʿAlayhi wa Sallam"
        },
        "chapter_title": {
            "en": "",
            "ms": "Bab Peringatan Daripada Perbuatan Berdusta atas Nama Rasulullah ﷺ",
            "ar": "بَابُ فِي التَّحْذِيرِ مِنَ الْكَذِبِ عَلَى رَسُولِ اللهِ صَلَّى اللهُ تَعَالَى عَلَيْهِ وَسَلَّمَ"
        },
        "volume_id": "2b1bc287-cdea-4e51-b5d3-f6fa0ce31235",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": ""
        },
        "volume_title": {
          "en": "",
          "ms": "Pengantar",
          "ar": ""
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "34b0041d-d031-4a98-ab93-de398046aad9",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "(...) ‘Ubaydullah bin Mu‘adz al-‘Anbari menyampaikan kepada kami, beliau berkata: Bapa saya menyampaikan kepada kami... Dalam sanad yang lain, Muhammad bin al-Mutsanna meyampaikan kepada kami, ‘Abdul Rahman bin Mahdi menyampaikan kepada kami; mereka berdua berkata: Syu‘bah menyampaikan kepada kami, daripada Khubayb bin Abdul Rahman, daripada Hafsh bin ‘Ashim, daripada Abu Hurayrah , beliau berkata: Rasulullah ﷺ bersabda: “Cukuplah seseorang itu dikira berdosa apabila dia menyampaikan setiap berita yang didengari.”",
          "ar": "وَحَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ قَالَا: حَدَّثَنَا شُعْبَةُ، عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «كَفَى بِالْمَرْءِ كَذِبًا أَنْ يُحَدِّثَ بِكُلِّ مَا سَمِعَ»"
        },
        "chapter_id": "7352d727-f7b9-4ca2-ae68-0050b22e2888",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb al-Nahy ʿan al-Ḥadīth bi Kulli Mā Samiʿa"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab Larangan Menyampaikan Setiap Berita yang Didengari",
          "ar": "بَابُ النَّهْيِ عَنِ الْحَدِيثِ بِكُلِّ مَا سَمِعَ"
        },
        "volume_id": "",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": ""
        },
        "volume_title": {
            "en": "",
            "ms": "Pengantar",
            "ar": ""
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "6061f65f-d57e-40b3-8adf-3d58524d2100",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "(...) Abu Bakar bin Abu Syaybah menyampaikan kepada kami, beliau berkata: ‘Ali bin Hafsh menyampaikan kepada kami, beliau berkata: Syu‘bah menyampaikan kepada kami, daripada Khubayb bin ‘Abdul Rahman, daripada Hafsh bin ‘Ashim, daripada Abu Hurayrah , daripada Nabi ﷺ dengan teks hadis yang lebih kurang sama.",
          "ar": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ حَفْصِ، حَدَّثَنَا شُعْبَةُ، عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ ذَلِكَ"
        },
        "chapter_id": "7352d727-f7b9-4ca2-ae68-0050b22e2888",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb al-Nahy ʿan al-Ḥadīth bi Kulli Mā Samiʿa"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab Larangan Menyampaikan Setiap Berita yang Didengari",
          "ar": "بَابُ النَّهْيِ عَنِ الْحَدِيثِ بِكُلِّ مَا سَمِعَ"
        },
        "volume_id": "",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": ""
        },
        "volume_title": {
            "en": "",
            "ms": "Pengantar",
            "ar": ""
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "2e7bfa47-ecba-48e3-8ee8-795efc39ffc3",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "5 – (5) Yahya bin Yahya juga menyampaikan kepada kami, beliau berkata: Husyaym mengkhabarkan kepada kami, daripada Sulayman al-Taymi, daripada Abu ‘Utsman al-Nahdi, beliau berkata: ‘Umar bin al-Khattab  berkata: “Sudah-sudahlah seseorang itu berdusta, apabila dia menyampaikan setiap yang dia dengar.”",
          "ar": "5 - (5) وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا هُشَيْمٌ، عَنْ سُلَيْمَانَ التَّيْمِيِّ، عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ، قَالَ: قَالَ عُمَرُ بْنُ الْخَطَّابِ رَضِيَ اللهُ تَعَالَى عَنْهُ: «بِحَسْبِ الْمَرْءِ مِنَ الْكَذِبِ أَنْ يُحَدِّثَ بِكُلِّ مَا سَمِعَ»"
        },
        "chapter_id": "7352d727-f7b9-4ca2-ae68-0050b22e2888",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb al-Nahy ʿan al-Ḥadīth bi Kulli Mā Samiʿa"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab Larangan Menyampaikan Setiap Berita yang Didengari",
          "ar": "بَابُ النَّهْيِ عَنِ الْحَدِيثِ بِكُلِّ مَا سَمِعَ"
        },
        "volume_id": "",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": ""
        },
        "volume_title": {
            "en": "",
            "ms": "Pengantar",
            "ar": ""
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "70e926c0-fe6e-44f0-a0e3-50f184c3923d",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "(...) Abu al-Thahir Ahmad bin bin ‘Amr bin Sarh menyampaikan kepada saya, beliau berkata: Ibn Wahb mengkhabarkan kepada kami, beliau berkata: Malik berkata kepada saya: “Ketahuilah, seseorang yang menyampaikan setiap yang dia dengar tidak akan selamat. Dia tidak akan menjadi tokoh agama jika dia menyampaikan setiap yang dia dengar.”",
          "ar": "وحَدَّثَنِي أَبُو الطَّاهِرِ أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ، قَالَ: أَخْبَرَنَا ابْنُ وَهْبٍ، قَالَ: قَالَ لِي مَالِكٌ: «اعْلَمْ أَنَّهُ لَيْسَ يَسْلَمُ رَجُلٌ حَدَّثَ بِكُلِّ مَا سَمِعَ، وَلَا يَكُونُ إِمَامًا أَبَدًا وَهُوَ يُحَدِّثُ بِكُلِّ مَا سَمِعَ»"
        },
        "chapter_id": "7352d727-f7b9-4ca2-ae68-0050b22e2888",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb al-Nahy ʿan al-Ḥadīth bi Kulli Mā Samiʿa"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab Larangan Menyampaikan Setiap Berita yang Didengari",
          "ar": "بَابُ النَّهْيِ عَنِ الْحَدِيثِ بِكُلِّ مَا سَمِعَ"
        },
        "volume_id": "",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": ""
        },
        "volume_title": {
            "en": "",
            "ms": "Pengantar",
            "ar": ""
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "7257d369-c569-4145-8964-411c6c637691",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "(...) Muhammad bin al-Mutsanna menyampaikan kepada kami, beliau berkata: ‘Abdul Rahman menyampaikan kepada kami, beliau berkata: Sufyan menyampaikan kepada kami, daripada Abu Ishaq, daripada Abu al-Ahwash, daripada Abdullah [bin Mas‘ud] , beliau berkata: “Cukup-cukuplah seseorang itu berdusta dengan menyampaikan setiap yang dia dengari.”",
          "ar": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ: حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ: حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي الْأَحْوَصِ، عَنْ عَبْدِ اللهِ، قَالَ: «بِحَسْبِ الْمَرْءِ مِنَ الْكَذِبِ أَنْ يُحَدِّثَ بِكُلِّ مَا سَمِعَ»"
        },
        "chapter_id": "7352d727-f7b9-4ca2-ae68-0050b22e2888",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb al-Nahy ʿan al-Ḥadīth bi Kulli Mā Samiʿa"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab Larangan Menyampaikan Setiap Berita yang Didengari",
          "ar": "بَابُ النَّهْيِ عَنِ الْحَدِيثِ بِكُلِّ مَا سَمِعَ"
        },
        "volume_id": "",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": ""
        },
        "volume_title": {
            "en": "",
            "ms": "Pengantar",
            "ar": ""
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "b27bad94-8256-49f4-a49a-ea6ef25a41f1",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "(...) Muhammad bin al-Mutsanna menyampaikan kepada kami, beliau berkata: Saya mendengar Abdul Rahman bin Mahdi berkata: “Seseorang itu tidak akan menjadi tokoh ikutan dalam agama, sehingga dia tahu untuk menahan diri daripada menyampaikan sebahagian ilmu yang dia dengari.”",
          "ar": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ: سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ مَهْدِيٍّ، يَقُولُ: «لَا يَكُونُ الرَّجُلُ إِمَامًا يُقْتَدَى بِهِ حَتَّى يُمْسِكَ عَنْ بَعْضِ مَا سَمِعَ»"
        },
        "chapter_id": "7352d727-f7b9-4ca2-ae68-0050b22e2888",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb al-Nahy ʿan al-Ḥadīth bi Kulli Mā Samiʿa"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab Larangan Menyampaikan Setiap Berita yang Didengari",
          "ar": "بَابُ النَّهْيِ عَنِ الْحَدِيثِ بِكُلِّ مَا سَمِعَ"
        },
        "volume_id": "",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": ""
        },
        "volume_title": {
            "en": "",
            "ms": "Pengantar",
            "ar": ""
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "e6ab719d-2f1d-4ee3-b468-9acf5900b969",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "(...) Yahya bin Yahya menyampaikan kepada kami, beliau berkata: ‘Umar bin ‘Ali bin Muqaddam mengkhabarkan kepada kami, daripada Sufyan bin Husayn, beliau berkata: Iyas bin Mu‘awiyah bertanya kepada saya, “Saya perhatikan tuan ini begitu sibuk mempelajari ilmu Quran, ajarkanlah saya sebuah surah dengan tafsirannya untuk saya lihat pengetahuan tuan.” Saya pun melakukannya. Lalu Iyas berkata kepada saya, “Ingatlah baik-baik pesanan saya ini: Elakkanlah menyampaikan riwayat-riwayat munkar, kerana hampir setiap orang yang menyampaikannya akan menjadi hina, dan dituduh berdusta dalam menyampaikan.”",
          "ar": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا عُمَرُ بْنُ عَلِيِّ بْنِ مُقَدَّمٍ، عَنْ سُفْيَانَ بْنِ حُسَيْنٍ، قَالَ: سَأَلَنِي إِيَاسُ بْنُ مُعَاوِيَةَ، فَقَالَ: إِنِّي أَرَاكَ قَدْ كَلِفْتَ بِعِلْمِ الْقُرْآنِ، فَاقْرَأْ عَلَيَّ سُورَةً، وَفَسِّرْ حَتَّى أَنْظُرَ فِيمَا عَلِمْتَ، قَالَ: فَفَعَلْتُ، فَقَالَ لِيَ: احْفَظْ عَلَيَّ مَا أَقُولُ لَكَ: «إِيَّاكَ وَالشَّنَاعَةَ فِي الْحَدِيثِ، فَإِنَّهُ قَلَّمَا حَمَلَهَا أَحَدٌ إِلَّا ذَلَّ فِي نَفْسِهِ، وَكُذِّبَ فِي حَدِيثِهِ»"
        },
        "chapter_id": "7352d727-f7b9-4ca2-ae68-0050b22e2888",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb al-Nahy ʿan al-Ḥadīth bi Kulli Mā Samiʿa"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab Larangan Menyampaikan Setiap Berita yang Didengari",
          "ar": "بَابُ النَّهْيِ عَنِ الْحَدِيثِ بِكُلِّ مَا سَمِعَ"
        },
        "volume_id": "",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": ""
        },
        "volume_title": {
            "en": "",
            "ms": "Pengantar",
            "ar": ""
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "90d23e25-92f0-45a0-9654-aa14a7ef1ce9",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "(...) Abu al-Thahir dan Harmalah bin Yahya menyampaikan kepada saya, mereka berkata: Ibn Wahb mengkhabarkan kepada kami, beliau berkata: Yunus mengkhabarkan kepada saya, daripada ibn Syihab, daripada ‘Ubaydullah bin Abdullah bin ‘Utbah, bahawa ‘Abdullah bin Mas‘ud  berkata: “Jika kamu sampaikan sebuah ilmu kepada kumpulan yang tidak sesuai dengan kapasiti akal mereka, ilmu tersebut pasti akan menjadi fitnah buat sebahagian mereka.”",
          "ar": "وحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ بْنُ يَحْيَى، قَالَا: أَخْبَرَنَا ابْنُ وَهْبٍ، قَالَ: أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللهِ بْنِ عَبْدِ اللهِ بْنِ عُتْبَةَ، أَنَّ عَبْدَ اللهِ بْنَ مَسْعُودٍ، قَالَ: «مَا أَنْتَ بِمُحَدِّثٍ قَوْمًا حَدِيثًا لَا تَبْلُغُهُ عُقُولُهُمْ، إِلَّا كَانَ لِبَعْضِهِمْ فِتْنَةً»"
        },
        "chapter_id": "7352d727-f7b9-4ca2-ae68-0050b22e2888",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb al-Nahy ʿan al-Ḥadīth bi Kulli Mā Samiʿa"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab Larangan Menyampaikan Setiap Berita yang Didengari",
          "ar": "بَابُ النَّهْيِ عَنِ الْحَدِيثِ بِكُلِّ مَا سَمِعَ"
        },
        "volume_id": "",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": ""
        },
        "volume_title": {
            "en": "",
            "ms": "Pengantar",
            "ar": ""
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "1724239f-aab5-4487-bd34-5db0f9869979",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "6 – (6) Muhammad bin Abdullah bin Numayr dan Zuhayr bin Harb menyampaikan kepada saya, mereka berkata: ‘Abdullah bin Yazid menyampaikan kepada kami, beliau berkata: Sa‘id bin Abu Ayyub menyampaikan kepada saya, beliau berkata: Abu Hani’ menyampaikan kepada saya, daripada Abu ‘Utsman Muslim bin Yasar, daripada Abu Hurayrah , daripada Rasulullah ﷺ, baginda bersabda, “Akan muncul pada akhir zaman dalam kalangan umatku, orang-orang yang menyampaikan ilmu kepada kalian, kalian tidak pernah tahu, dan para salaf kalian juga tidak pernah tahu. Jauhilah mereka sejauh-jauhnya.”",
          "ar": "6 - (6) وحَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالَا: حَدَّثَنَا عَبْدُ اللهِ بْنُ يَزِيدَ، قَالَ: حَدَّثَنِي سَعِيدُ بْنُ أَبِي أَيُّوبَ، قَالَ: حَدَّثَنِي أَبُو هَانِئٍ، عَنْ أَبِي عُثْمَانَ مُسْلِمِ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، أَنَّهُ قَالَ: «سَيَكُونُ فِي آخِرِ أُمَّتِي أُنَاسٌ يُحَدِّثُونَكُمْ مَا لَمْ تَسْمَعُوا أَنْتُمْ، وَلَا آبَاؤُكُمْ، فَإِيَّاكُمْ وَإِيَّاهُمْ»"
        },
        "chapter_id": "ce75483a-ea68-4d7d-880b-e0e5ebe71067",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb fī al-Ḍuʿafāʾ wa al-Kadhdhābīn wa Man Yarghab ʿan Ḥadīthihim"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab Berkenaan Perawi, Pendusta, dan Orang-orang yang Dibenci Riwayat Mereka.",
          "ar": "بَابٌ فِي الضُّعَفَاءِ وَالْكَذَّابِينَ وَمَنْ يُرْغَبُ عَنْ حَدِيثِهِمْ"
        },
        "volume_id": "",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": ""
        },
        "volume_title": {
            "en": "",
            "ms": "Pengantar",
            "ar": ""
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "43289232-3a41-4f38-a42f-00a41fc37039",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "7 – (7) Harmalah bin Yahya bin Abdulah bin Harmalah bin ‘Imran  al-Tujibi menyampaikan kepada saya, beliau berkata: Ibn Wahb menyampaikan kepada kami, beliau berkata: Abu Syurayh menyampaikan kepada saya, bahawa beliau mendengar Syarahil bin Yazid berkata: Muslim bin Yasar mengkhabarkan kepada saya, beliau berkata: beliau mendengar Abu Hurayrah  berkata: Rasulullah ﷺ bersabda, “Akan muncul pada akhir zaman kelak sekumpulan dajal kaki dusta, mereka menyampaikan hadis-hadis yang kamu tidak pernah dengar, para salaf kamu juga tidak pernah dengar. Jauhilah mereka sejauh-jauhnya, jangan sampai mereka menyesatkan kalian, atau merosakkan agama kalian.”",
          "ar": "7 - (7) وحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى بْنِ عَبْدِ اللهِ بْنِ حَرْمَلَةَ بْنِ عِمْرَانَ التُّجِيبِيُّ، قَالَ: حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ: حَدَّثَنِي أَبُو شُرَيْحٍ أَنَّهُ سَمِعَ شَرَاحِيلَ بْنَ يَزِيدَ، يَقُولُ: أَخْبَرَنِي مُسْلِمُ بْنُ يَسَارٍ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «يَكُونُ فِي آخِرِ الزَّمَانِ دَجَّالُونَ كَذَّابُونَ، يَأْتُونَكُمْ مِنَ الْأَحَادِيثِ بِمَا لَمْ تَسْمَعُوا أَنْتُمْ، وَلَا آبَاؤُكُمْ، فَإِيَّاكُمْ وَإِيَّاهُمْ، لَا يُضِلُّونَكُمْ، وَلَا يَفْتِنُونَكُمْ»"
        },
        "chapter_id": "ce75483a-ea68-4d7d-880b-e0e5ebe71067",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb fī al-Ḍuʿafāʾ wa al-Kadhdhābīn wa Man Yarghab ʿan Ḥadīthihim"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab Berkenaan Perawi, Pendusta, dan Orang-orang yang Dibenci Riwayat Mereka.",
          "ar": "بَابٌ فِي الضُّعَفَاءِ وَالْكَذَّابِينَ وَمَنْ يُرْغَبُ عَنْ حَدِيثِهِمْ"
        },
        "volume_id": "",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": ""
        },
        "volume_title": {
            "en": "",
            "ms": "Pengantar",
            "ar": ""
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "04b4882a-6704-4592-856a-d5c559a9e59a",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "(...) Abu Sa‘id al-Asyajj menyampaikan kepada saya, beliau berkata: Waki‘ menyampaikan kepada kami, beliau berkata: al-A‘masy menyampaikan kepada kami, daripada al-Musayyab bin Rafi‘, daripada ‘Amir bin ‘Abdah, beliau berkata: Abdullah [bin Mas‘ud]  berkata, “Kadang-kadang syaitan menjelma dalam rupa seorang lelaki, lalu lelaki itu menyampaikan hadis-hadis dusta kepada orang ramai menyebabkan mereka berpecah-belah. Seseorang mereka akan menyampaikan: Saya dengar seorang lelaki– saya cam mukanya, tetapi tidak tahu namanya – menyampaikan,...”",
          "ar": "وحَدَّثَنِي أَبُو سَعِيدٍ الْأَشَجُّ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا الْأَعْمَشُ، عَنِ الْمُسَيَّبِ بْنِ رَافِعٍ، عَنْ عَامِرِ بْنِ عَبْدَةَ، قَالَ: قَالَ عَبْدُ اللهِ: \" إِنَّ الشَّيْطَانَ لِيَتَمَثَّلُ فِي صُورَةِ الرَّجُلِ، فَيَأْتِي الْقَوْمَ، فَيُحَدِّثُهُمْ بِالْحَدِيثِ مِنَ الْكَذِبِ، فَيَتَفَرَّقُونَ، فَيَقُولُ الرَّجُلُ مِنْهُمْ: سَمِعْتُ رَجُلًا أَعْرِفُ وَجْهَهُ، وَلَا أَدْرِي مَا اسْمُهُ يُحَدِّثُ \""
        },
        "chapter_id": "ce75483a-ea68-4d7d-880b-e0e5ebe71067",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb fī al-Ḍuʿafāʾ wa al-Kadhdhābīn wa Man Yarghab ʿan Ḥadīthihim"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab Berkenaan Perawi, Pendusta, dan Orang-orang yang Dibenci Riwayat Mereka.",
          "ar": "بَابٌ فِي الضُّعَفَاءِ وَالْكَذَّابِينَ وَمَنْ يُرْغَبُ عَنْ حَدِيثِهِمْ"
        },
        "volume_id": "",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": ""
        },
        "volume_title": {
            "en": "",
            "ms": "Pengantar",
            "ar": ""
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "f8f13199-74d3-4ef4-bac6-c8b2ff1bf3c6",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "(...) Muhammad bin Rafi‘ menyampaikan kepada saya, beliau berkata: Abdul Razzaq menyampaikan kepada kami, beliau berkata: Ma‘mar mengkhabarkan kepada kami, daripada ibn Thawus, daripada bapanya, daripada Abdullah bin ‘Amr bin al-Ash , beliau berkata: “Di laut sana ada sekumpulan syaitan yang masih terpenjara, mereka diikat oleh Sulayman. Sedikit masa lagi mereka akan terlepas, lalu menyampaikan quran baru kepada orang ramai.”",
          "ar": "وحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللهِ بْنِ عَمْرِو بْنِ الْعَاصِ، قَالَ: «إِنَّ فِي الْبَحْرِ شَيَاطِينَ مَسْجُونَةً، أَوْثَقَهَا سُلَيْمَانُ، يُوشِكُ أَنْ تَخْرُجَ، فَتَقْرَأَ عَلَى النَّاسِ قُرْآنًا»"
        },
        "chapter_id": "ce75483a-ea68-4d7d-880b-e0e5ebe71067",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb fī al-Ḍuʿafāʾ wa al-Kadhdhābīn wa Man Yarghab ʿan Ḥadīthihim"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab Berkenaan Perawi, Pendusta, dan Orang-orang yang Dibenci Riwayat Mereka.",
          "ar": "بَابٌ فِي الضُّعَفَاءِ وَالْكَذَّابِينَ وَمَنْ يُرْغَبُ عَنْ حَدِيثِهِمْ"
        },
        "volume_id": "",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": ""
        },
        "volume_title": {
            "en": "",
            "ms": "Pengantar",
            "ar": ""
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "37b45ca5-b623-4732-914f-507f7843c05a",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "(...) Muhammad bin ‘Abbad dan Sa‘id bin ‘Amr al-Asy‘astsi menyampaikan kepada saya; masing-masing meriwayatkan daripada ibn ‘Uyaynah – Sa‘id dengan lafaz “Sufyan mengkhabarkan kepada kami,” – daripada Hisyam bin Hujayr, daripada Thawus, beliau berkata: Busyayr bin Kaab datang kepada ibn ‘Abbas lalu menyampaikan hadis kepada beliau.\n\nSeketika kemudian ibn ‘Abbas berkata: “Ulang hadis itu dan itu.” Busyayr pun mengulanginya, lalu menyampaikan lagi hadis-hadisnya. Sampai hadis yang sama, ibn ‘Abbas berkata lagi, “Ulang hadis itu dan itu.” Busyayr pun mengulanginya. Beliau bertanya, “Saya tidak pasti sama ada tuan bersetuju dengan semua hadis saya selain ini, atau tuan mengingkari semua hadis saya selain ini?”\n\nIbn ‘Abbas  menjawab, “Kami dahulu menyampaikan hadis daripada Rasulullah ﷺ, tidak ada yang sanggup berdusta atas nama baginda. Apabila manusia mula menunggang apa cara – baik atau buruk –, kami tinggalkan periwayatan hadis daripada baginda.”",
          "ar": "وحَدَّثَنِي مُحَمَّدُ بْنُ عَبَّادٍ، وَسَعِيدُ بْنُ عَمْرٍو الْأَشْعَثِيُّ جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ، قَالَ سَعِيدٌ: أَخْبَرَنَا سُفْيَانُ، عَنْ هِشَامِ بْنِ حُجَيْرٍ، عَنْ طَاوُسٍ، قَالَ: جَاءَ هَذَا إِلَى ابْنِ عَبَّاسٍ - يَعْنِي بُشَيْرَ بْنَ كَعْبٍ - فَجَعَلَ يُحَدِّثُهُ، فَقَالَ لَهُ ابْنُ عَبَّاسٍ: عُدْ لِحَدِيثِ كَذَا وَكَذَا، فَعَادَ لَهُ، ثُمَّ حَدَّثَهُ، فَقَالَ لَهُ: عُدْ لِحَدِيثِ كَذَا وَكَذَا، فَعَادَ لَهُ، فَقَالَ لَهُ: مَا أَدْرِي أَعَرَفْتَ حَدِيثِي كُلَّهُ، وَأَنْكَرْتَ هَذَا؟ أَمْ أَنْكَرْتَ حَدِيثِي كُلَّهُ، وَعَرَفْتَ هَذَا؟ فَقَالَ لَهُ ابْنُ عَبَّاسٍ: «إِنَّا كُنَّا نُحَدِّثُ عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِذْ لَمْ يَكُنْ يُكْذَبُ عَلَيْهِ، فَلَمَّا رَكِبَ النَّاسُ الصَّعْبَ وَالذَّلُولَ، تَرَكْنَا الْحَدِيثَ عَنْهُ»"
        },
        "chapter_id": "ce75483a-ea68-4d7d-880b-e0e5ebe71067",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb fī al-Ḍuʿafāʾ wa al-Kadhdhābīn wa Man Yarghab ʿan Ḥadīthihim"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab Berkenaan Perawi, Pendusta, dan Orang-orang yang Dibenci Riwayat Mereka.",
          "ar": "بَابٌ فِي الضُّعَفَاءِ وَالْكَذَّابِينَ وَمَنْ يُرْغَبُ عَنْ حَدِيثِهِمْ"
        },
        "volume_id": "",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": ""
        },
        "volume_title": {
            "en": "",
            "ms": "Pengantar",
            "ar": ""
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "9230b7a6-727c-4724-abad-06a790e416b3",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "(...) Muhammad bin Rafi‘ menyampaikan kepada saya, beliau berkata: Abdul Razzaq menyampaikan kepada kami, beliau berkata: Ma‘mar mengkhabarkan kepada kami, daripada ibn Thawus, daripada bapanya, daripada ibn ‘Abbas , beliau berkata: “Dahulu kami menghafaz hadis, dan hadis-hadis tersebut terpelihara daripada Nabi ﷺ. Sekarang apabila kalian tidak peduli menunggang baik atau buruk, maka sudah-sudahlah.”",
          "ar": "وحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ: «إِنَّمَا كُنَّا نَحْفَظُ الْحَدِيثَ، وَالْحَدِيثُ يُحْفَظُ عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَأَمَّا إِذْ رَكِبْتُمْ كُلَّ صَعْبٍ وَذَلُولٍ، فَهَيْهَاتَ»"
        },
        "chapter_id": "ce75483a-ea68-4d7d-880b-e0e5ebe71067",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb fī al-Ḍuʿafāʾ wa al-Kadhdhābīn wa Man Yarghab ʿan Ḥadīthihim"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab Berkenaan Perawi, Pendusta, dan Orang-orang yang Dibenci Riwayat Mereka.",
          "ar": "بَابٌ فِي الضُّعَفَاءِ وَالْكَذَّابِينَ وَمَنْ يُرْغَبُ عَنْ حَدِيثِهِمْ"
        },
        "volume_id": "",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": ""
        },
        "volume_title": {
            "en": "",
            "ms": "Pengantar",
            "ar": ""
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "27ea928f-41ca-4e6f-b673-09a44441236b",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "(...) Abu Ayyub Sulayman bin ‘Ubaydullah al-Ghaylani menyampaikan kepada saya, beliau berkata: Abu ‘Amir – al-‘Aqadi – menyampaikan kepada kami, beliau berkata: Rabah menyampaikan kepada kami, daripada Qays bin Sa‘ad, daripada Mujahid, beliau berkata: Busyayr al-‘Adawi datang menemui ibn ‘Abbas , beliau membacakan beberapa hadis di hadapannya.\n\nSetiap kali Busyayr menyebut, “Rasulullah ﷺ bersabda, ... Rasulullah ﷺ bersabda...” ibn ‘Abbas tidak memasang telinga, tidak memandang kepadanya. Busyayr meningkah, “Wahai ibn ‘Abbas, mengapa saya lihat kamu tidak dengar hadisku, padahal saya sedang membacakan hadis Rasulullah ﷺ ini?” Ibn ‘Abbas menjawab, “Dahulu, jika kami mendengar sesiapa menyebut ‘Rasulullah ﷺ bersabda…’ mata kami akan menancap padanya, telinga kami akan terpasang untuknya. Tetapi apabila manusia sudah tidak peduli yang betul dan salah, kami hanya menerima hadis-hadis yang kami ketahui sahaja.” ",
          "ar": "وحَدَّثَنِي أَبُو أَيُّوبَ سُلَيْمَانُ بْنُ عُبَيْدِ اللهِ الْغَيْلَانِيُّ، حَدَّثَنَا أَبُو عَامِرٍ يَعْنِي الْعَقَدِيَّ، حَدَّثَنَا رَبَاحٌ، عَنْ قَيْسِ بْنِ سَعْدٍ، عَنْ مُجَاهِدٍ، قَالَ: جَاءَ بُشَيْرٌ الْعَدَوِيُّ إِلَى ابْنِ عَبَّاسٍ، فَجَعَلَ يُحَدِّثُ، وَيَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَجَعَلَ ابْنُ عَبَّاسٍ لَا يَأْذَنُ لِحَدِيثِهِ، وَلَا يَنْظُرُ إِلَيْهِ، فَقَالَ: يَا ابْنَ عَبَّاسٍ، مَالِي لَا أَرَاكَ تَسْمَعُ لِحَدِيثِي، أُحَدِّثُكَ عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَلَا تَسْمَعُ، فَقَالَ ابْنُ عَبَّاسٍ: «إِنَّا كُنَّا مَرَّةً إِذَا سَمِعْنَا رَجُلًا يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، ابْتَدَرَتْهُ أَبْصَارُنَا، وَأَصْغَيْنَا إِلَيْهِ بِآذَانِنَا، فَلَمَّا رَكِبَ النَّاسُ الصَّعْبَ، وَالذَّلُولَ، لَمْ نَأْخُذْ مِنَ النَّاسِ إِلَّا مَا نَعْرِفُ»"
        },
        "chapter_id": "ce75483a-ea68-4d7d-880b-e0e5ebe71067",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb fī al-Ḍuʿafāʾ wa al-Kadhdhābīn wa Man Yarghab ʿan Ḥadīthihim"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab Berkenaan Perawi, Pendusta, dan Orang-orang yang Dibenci Riwayat Mereka.",
          "ar": "بَابٌ فِي الضُّعَفَاءِ وَالْكَذَّابِينَ وَمَنْ يُرْغَبُ عَنْ حَدِيثِهِمْ"
        },
        "volume_id": "",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": ""
        },
        "volume_title": {
            "en": "",
            "ms": "Pengantar",
            "ar": ""
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "9804bba2-8e49-4095-ae6b-f153570ce1d3",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "(...) Dawud bin ‘Amr al-Dhabbi menyampaikan kepada kami, beliau berkata: Nafi‘ bin ‘Umar menyampaikan kepada kami, daripada ibn Abu Mulaykah, beliau berkata: Saya mengutus surat kepada ibn ‘Abbas memintanya untuk menuliskan sebuah rujukan agama untuk saya, dan menyembunyikan apa yang tidak penting daripada saya. \n\nIbn ‘Abbas berkata, “Dia ini anak yang bijak, saya akan pilihkan beberapa ilmu yang dia perlu tahu, dan sembunyikan yang lain daripadanya.” Ibn ‘Abbas mengambil rang undang-undang ‘Ali, lalu beliau menyalin sebahagian dan meninggalkan sebahagian yang lain. Beliau berkata, “Demi Allah, jika ‘Ali benar-benar memutuskan hukum berdasarkan ini, pasti dia tersilap .”",
          "ar": "حَدَّثَنَا دَاوُدُ بْنُ عَمْرٍو الضَّبِّيُّ، حَدَّثَنَا نَافِعُ بْنُ عُمَرَ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، قَالَ: كَتَبْتُ إِلَى ابْنِ عَبَّاسٍ أَسْأَلُهُ أَنْ يَكْتُبَ لِي كِتَابًا، وَيُخْفِي عَنِّي، فَقَالَ: «وَلَدٌ نَاصِحٌ أَنَا أَخْتَارُ لَهُ الْأُمُورَ اخْتِيَارًا، وَأُخْفِي عَنْهُ»، قَالَ: فَدَعَا بِقَضَاءِ عَلِيٍّ، فَجَعَلَ يَكْتُبُ مِنْهُ أَشْيَاءَ، وَيَمُرُّ بِهِ الشَّيْءُ، فَيَقُولُ: «وَاللهِ مَا قَضَى بِهَذَا عَلِيٌّ إِلَّا أَنْ يَكُونَ ضَلَّ»"
        },
        "chapter_id": "ce75483a-ea68-4d7d-880b-e0e5ebe71067",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb fī al-Ḍuʿafāʾ wa al-Kadhdhābīn wa Man Yarghab ʿan Ḥadīthihim"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab Berkenaan Perawi, Pendusta, dan Orang-orang yang Dibenci Riwayat Mereka.",
          "ar": "بَابٌ فِي الضُّعَفَاءِ وَالْكَذَّابِينَ وَمَنْ يُرْغَبُ عَنْ حَدِيثِهِمْ"
        },
        "volume_id": "",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": ""
        },
        "volume_title": {
            "en": "",
            "ms": "Pengantar",
            "ar": ""
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "5c99366e-cf72-4d6d-be8f-aaef91a1884f",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "(...) ‘Amr al-Naqid menyampaikan kepada kami, beliau berkata: Sufyan bin ‘Uyaynah menyampaikan kepada kami, daripada Hisyam bin Hujayr, daripada Thawus, beliau berkata: Keputusan bertulis undang-undang ‘Ali  dibawa kepada ibn ‘Abbas , lalu beliau memadamkan semuanya, kecuali sekadar ini,” Sufyan bin ‘Uyaynah memberi isyarat sehasta dengan sikunya.",
          "ar": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ هِشَامِ بْنِ حُجَيْرٍ، عَنْ طَاوُسٍ، قَالَ: «أُتِيَ ابْنُ عَبَّاسٍ بِكِتَابٍ فِيهِ قَضَاءُ عَلِيٍّ رَضِيَ اللهُ عَنْهُ، فَمَحَاهُ إِلَّا قَدْرَ»، وَأَشَارَ سُفْيَانُ بْنُ عُيَيْنَةَ بِذِرَاعِهِ"
        },
        "chapter_id": "ce75483a-ea68-4d7d-880b-e0e5ebe71067",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb fī al-Ḍuʿafāʾ wa al-Kadhdhābīn wa Man Yarghab ʿan Ḥadīthihim"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab Berkenaan Perawi, Pendusta, dan Orang-orang yang Dibenci Riwayat Mereka.",
          "ar": "بَابٌ فِي الضُّعَفَاءِ وَالْكَذَّابِينَ وَمَنْ يُرْغَبُ عَنْ حَدِيثِهِمْ"
        },
        "volume_id": "",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": ""
        },
        "volume_title": {
            "en": "",
            "ms": "Pengantar",
            "ar": ""
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "e73a877e-52ce-49c5-872f-fc396b6507bb",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "(...) Hasan bin ‘Ali al-Hulwani menyampaikan kepada kami, beliau berkata: Yahya bin Adam menyampaikan kepada kami, beliau berkata: Ibn Idris menyampaikan kepada kami, daripada al-A‘masy, daripada Abu Ishaq, beliau berkata: “Apabila mereka (golongan Rafidah) merekayasa bidaah-bidaah baru selepas ketiadaan ‘Ali , seorang anak murid beliau berkata: Semoga Allah melaknat golongan ini! Betapa banyak ilmu ‘Ali yang mereka selewengkan!”",
          "ar": "حَدَّثَنَا حَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، حَدَّثَنَا ابْنُ إِدْرِيسَ، عَنِ الْأَعْمَشِ، عَنْ أَبِي إِسْحَاقَ، قَالَ: \" لَمَّا أَحْدَثُوا تِلْكَ الْأَشْيَاءَ بَعْدَ عَلِيٍّ رَضِيَ اللهُ عَنْهُ، قَالَ رَجُلٌ مِنْ أَصْحَابِ عَلِيٍّ: قَاتَلَهُمُ اللهُ، أَيَّ عِلْمٍ أَفْسَدُوا \""
        },
        "chapter_id": "ce75483a-ea68-4d7d-880b-e0e5ebe71067",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb fī al-Ḍuʿafāʾ wa al-Kadhdhābīn wa Man Yarghab ʿan Ḥadīthihim"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab Berkenaan Perawi, Pendusta, dan Orang-orang yang Dibenci Riwayat Mereka.",
          "ar": "بَابٌ فِي الضُّعَفَاءِ وَالْكَذَّابِينَ وَمَنْ يُرْغَبُ عَنْ حَدِيثِهِمْ"
        },
        "volume_id": "",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": ""
        },
        "volume_title": {
            "en": "",
            "ms": "Pengantar",
            "ar": ""
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "325176e8-6eb1-4c68-aaec-de4f7035ddf2",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "(...) ‘Ali bin Khasyram menyampaikan kepada kami, beliau berkata: Abu Bakar – ibn ‘Ayyasy – mengkhabarkan kepada kami, beliau berkata: Saya mendengar al-Mughirah berkata: “Hampir semua hadis yang dinisbahkan kepada ‘Ali  tidak boleh dipercayai, kecuali yang disampaikan melalui jalur murid-murid Abdullah bin Mas‘ud .”",
          "ar": "حَدَّثَنَا عَلِيُّ بْنُ خَشْرَمٍ، أَخْبَرَنَا أَبُو بَكْرٍ يَعْنِي ابْنَ عَيَّاشٍ، قَالَ: سَمِعْتُ الْمُغِيرَةَ، يَقُولُ: «لَمْ يَكُنْ يَصْدُقُ عَلَى عَلِيٍّ رَضِيَ اللهُ عَنْهُ فِي الْحَدِيثِ عَنْهُ إِلَّا مِنْ أَصْحَابِ عَبْدِ اللهِ بْنِ مَسْعُودٍ»"
        },
        "chapter_id": "ce75483a-ea68-4d7d-880b-e0e5ebe71067",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb fī al-Ḍuʿafāʾ wa al-Kadhdhābīn wa Man Yarghab ʿan Ḥadīthihim"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab Berkenaan Perawi, Pendusta, dan Orang-orang yang Dibenci Riwayat Mereka.",
          "ar": "بَابٌ فِي الضُّعَفَاءِ وَالْكَذَّابِينَ وَمَنْ يُرْغَبُ عَنْ حَدِيثِهِمْ"
        },
        "volume_id": "",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": ""
        },
        "volume_title": {
            "en": "",
            "ms": "Pengantar",
            "ar": ""
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "d98de468-0be8-40df-ac7c-d564244a4b7d",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "(...) Hasan bin al-Rabi‘ menyampaikan kepada kami, beliau berkata: Hammad bin Zayd menyampaikan kepada kami, daripada Ayyub dan Hisyam, daripada Muhammad. Dalam sanad yang lain, Fudhayl juga menyampaikan kepada kami, daripada Hisyam. Dalam sanad yang lain, Makhlad bin Husayn menyampaikan kepada kami, daripada Hisyam, daripada Muhammad bin Sirin, beliau berkata: “Sesungguhnya ilmu [hadis] ini adalah agama; maka perhatikanlah daripada siapa kamu menerima agama kamu.”",
          "ar": "حَدَّثَنَا حَسَنُ بْنُ الرَّبِيعِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، وَهِشَامٍ، عَنْ مُحَمَّدٍ، وَحَدَّثَنَا فُضَيْلٌ، عَنْ هِشَامٍ قَالَ: وَحَدَّثَنَا مَخْلَدُ بْنُ حُسَيْنٍ، عَنْ هِشَامٍ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، قَالَ: «إِنَّ هَذَا الْعِلْمَ دِينٌ، فَانْظُرُوا عَمَّنْ تَأْخُذُونَ دِينَكُمْ»"
        },
        "chapter_id": "fcdec5da-7d1f-470b-b09a-d25568910a8f",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb fī Anna al-Isnād min al-Dīn, wa Anna al-Riwayah Lā Takūn Illā ʿan al-Thiqāt, wa Anna Jarḥ al-Ruwāt bimā Huwa fīhim Jāʾiz, bal Wājib wa Annahu Laysa min al-Ghībah al-Muḥarramah, bal min al-Dhabb ʿan al-Sharīʿah al-Mukarramah"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab: Isnad Adalah Sebahagian Agama; Riwayat Hanya Diterima daripada Thiqat; Kritikan Perawi Hadis Kerana Kekurangan Mereka Adalah Harus, Bahkan Wajib, Tidak Termasuk Dalam Mengumpat, Bahkan Ia Adalah Pemeliharaan Terhadap Syariah yang Mulia.",
          "ar": "بَابٌ في أَنَّ الْإِسْنَادَ مِنَ الدِّينِ، وأنَّ الرِّوَايَةَ لَا تَكُون إلا عن الثقات، وأن جرح الرواة بما هو فيهم جائز بل واجب وأنه ليس من الغيبة المحرمة بل من الذب عن الشريعة المكرمة"
        },
        "volume_id": "",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": ""
        },
        "volume_title": {
            "en": "",
            "ms": "Pengantar",
            "ar": ""
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "bd07c345-025f-4602-a563-bd289eae61cc",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "(…) Abu Jaafar Muhammad bin al-Shabbah menyampaikan kepada kami, beliau berkata: Isma‘il bin Zakariyya’ menyampaikan kepada kami, daripada ‘Ashim al-Ahwal, daripada ibn Sirin, beliau berkata: “Dahulu para salaf tidak bertanya tentang isnad. Tetapi apabila berlaku fitnah [pembunuhan ‘Utsman ], mereka mula bertanya: “Beritahu kami siapa yang meriwayatkan hadis kalian ini?!” Lalu diperhatikan, jika ahli al-Sunnah, diterima hadisnya. Jika ahli bidaah, tidak diterima hadisnya.”",
          "ar": "حَدَّثَنَا أَبُو جَعْفَرٍ مُحَمَّدُ بْنُ الصَّبَّاحِ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ زَكَرِيَّاءَ، عَنْ عَاصِمٍ الْأَحْوَلِ، عَنِ ابْنِ سِيرِينَ، قَالَ: «لَمْ يَكُونُوا يَسْأَلُونَ عَنِ الْإِسْنَادِ، فَلَمَّا وَقَعَتِ الْفِتْنَةُ، قَالُوا: سَمُّوا لَنَا رِجَالَكُمْ، فَيُنْظَرُ إِلَى أَهْلِ السُّنَّةِ فَيُؤْخَذُ حَدِيثُهُمْ، وَيُنْظَرُ إِلَى أَهْلِ الْبِدَعِ فَلَا يُؤْخَذُ حَدِيثُهُمْ» "
        },
        "chapter_id": "fcdec5da-7d1f-470b-b09a-d25568910a8f",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb fī Anna al-Isnād min al-Dīn, wa Anna al-Riwayah Lā Takūn Illā ʿan al-Thiqāt, wa Anna Jarḥ al-Ruwāt bimā Huwa fīhim Jāʾiz, bal Wājib wa Annahu Laysa min al-Ghībah al-Muḥarramah, bal min al-Dhabb ʿan al-Sharīʿah al-Mukarramah"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab: Isnad Adalah Sebahagian Agama; Riwayat Hanya Diterima daripada Thiqat; Kritikan Perawi Hadis Kerana Kekurangan Mereka Adalah Harus, Bahkan Wajib, Tidak Termasuk Dalam Mengumpat, Bahkan Ia Adalah Pemeliharaan Terhadap Syariah yang Mulia.",
          "ar": "بَابٌ في أَنَّ الْإِسْنَادَ مِنَ الدِّينِ، وأنَّ الرِّوَايَةَ لَا تَكُون إلا عن الثقات، وأن جرح الرواة بما هو فيهم جائز بل واجب وأنه ليس من الغيبة المحرمة بل من الذب عن الشريعة المكرمة"
        },
        "volume_id": "",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": ""
        },
        "volume_title": {
            "en": "",
            "ms": "Pengantar",
            "ar": ""
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "cd925be1-1abf-4522-8d19-0972feb19c97",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "(...) Ishaq bin Ibrahim al-Hanzhali menyampaikan kepada kami, beliau berkata: ‘Isa – ibn Yunus – mengkhabarkan kepada kami, beliau berkata: al-Awza‘i menyampaikan kepada kami, daripada Sulayman bin Musa, beliau berkata: Saya memberitahu Thawus, “Si anu menyampaikan kepada saya hadis ini dan hadis itu.” Thawus menjawab, “Jika si anu itu thiqah, terimalah.”",
          "ar": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا عِيسَى وَهُوَ ابْنُ يُونُسَ، حَدَّثَنَا الْأَوْزَاعِيُّ، عَنْ سُلَيْمَانَ بْنِ مُوسَى، قَالَ: لَقِيتُ طَاوُسًا فَقُلْتُ: حَدَّثَنِي فُلَانٌ كَيْتَ وَكَيْتَ، قَالَ: «إِنْ كَانَ صَاحِبُكَ مَلِيًّا، فَخُذْ عَنْهُ»"
        },
        "chapter_id": "fcdec5da-7d1f-470b-b09a-d25568910a8f",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb fī Anna al-Isnād min al-Dīn, wa Anna al-Riwayah Lā Takūn Illā ʿan al-Thiqāt, wa Anna Jarḥ al-Ruwāt bimā Huwa fīhim Jāʾiz, bal Wājib wa Annahu Laysa min al-Ghībah al-Muḥarramah, bal min al-Dhabb ʿan al-Sharīʿah al-Mukarramah"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab: Isnad Adalah Sebahagian Agama; Riwayat Hanya Diterima daripada Thiqat; Kritikan Perawi Hadis Kerana Kekurangan Mereka Adalah Harus, Bahkan Wajib, Tidak Termasuk Dalam Mengumpat, Bahkan Ia Adalah Pemeliharaan Terhadap Syariah yang Mulia.",
          "ar": "بَابٌ في أَنَّ الْإِسْنَادَ مِنَ الدِّينِ، وأنَّ الرِّوَايَةَ لَا تَكُون إلا عن الثقات، وأن جرح الرواة بما هو فيهم جائز بل واجب وأنه ليس من الغيبة المحرمة بل من الذب عن الشريعة المكرمة"
        },
        "volume_id": "",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": ""
        },
        "volume_title": {
            "en": "",
            "ms": "Pengantar",
            "ar": ""
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "d708f0b8-68ec-40e4-97b4-055c0c0e0af8",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "(…) Abdullah bin Abdul Rahman al-Darimi juga menyampaikan kepada kami, beliau berkata: Marwan – ibn Muhammad al-Dimasyqi – mengkhabarkan kepada kami, beliau berkata: Sa‘id bin Abdul Aziz menyampaikan kepada kami, daripada Sulayman bin Musa, beliau berkata: Saya memberitahu Thawus, “Si anu menyampaikan kepada saya hadis ini dan hadis itu.” Thawus menjawab, “Jika si anu itu thiqah, terimalah.”",
          "ar": "وَحَدَّثَنَا عَبْدُ اللهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، أَخْبَرَنَا مَرْوَانُ يَعْنِي ابْنَ مُحَمَّدٍ الدِّمَشْقِيَّ، حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الْعَزِيزِ، عَنْ سُلَيْمَانَ بْنِ مُوسَى قَالَ: قُلْتُ لِطَاوُسٍ: إِنَّ فُلَانًا حَدَّثَنِي بِكَذَا وَكَذَا، قَالَ: «إِنْ كَانَ صَاحِبُكَ مَلِيًّا، فَخُذْ عَنْهُ»"
        },
        "chapter_id": "fcdec5da-7d1f-470b-b09a-d25568910a8f",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb fī Anna al-Isnād min al-Dīn, wa Anna al-Riwayah Lā Takūn Illā ʿan al-Thiqāt, wa Anna Jarḥ al-Ruwāt bimā Huwa fīhim Jāʾiz, bal Wājib wa Annahu Laysa min al-Ghībah al-Muḥarramah, bal min al-Dhabb ʿan al-Sharīʿah al-Mukarramah"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab: Isnad Adalah Sebahagian Agama; Riwayat Hanya Diterima daripada Thiqat; Kritikan Perawi Hadis Kerana Kekurangan Mereka Adalah Harus, Bahkan Wajib, Tidak Termasuk Dalam Mengumpat, Bahkan Ia Adalah Pemeliharaan Terhadap Syariah yang Mulia.",
          "ar": "بَابٌ في أَنَّ الْإِسْنَادَ مِنَ الدِّينِ، وأنَّ الرِّوَايَةَ لَا تَكُون إلا عن الثقات، وأن جرح الرواة بما هو فيهم جائز بل واجب وأنه ليس من الغيبة المحرمة بل من الذب عن الشريعة المكرمة"
        },
        "volume_id": "",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": ""
        },
        "volume_title": {
            "en": "",
            "ms": "Pengantar",
            "ar": ""
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "338018f0-5c08-4969-b08f-eca60a9036fe",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "(...) Nashr bin ‘Ali al-Jahdhami menyampaikan kepada kami, beliau berkata: al-Ashma‘i menyampaikan kepada kami, daripada ibn Abu al-Zinad, daripada bapanya, beliau berkata: “Saya kenal ratusan orang di Madinah, semuanya amanah [pada harta kebendaan], tetapi hadis mereka tidak boleh diterima.” Mereka bukan daripada ahlinya.",
          "ar": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنَا الْأَصْمَعِيُّ، عَنِ ابْنِ أَبِي الزِّنَادِ، عَنْ أَبِيهِ قَالَ: «أَدْرَكْتُ بِالْمَدِينَةِ مِائَةً، كُلُّهُمْ مَأْمُونٌ، مَا يُؤْخَذُ عَنْهُمُ الْحَدِيثُ، يُقَالُ: لَيْسَ مِنْ أَهْلِهِ.»"
        },
        "chapter_id": "fcdec5da-7d1f-470b-b09a-d25568910a8f",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb fī Anna al-Isnād min al-Dīn, wa Anna al-Riwayah Lā Takūn Illā ʿan al-Thiqāt, wa Anna Jarḥ al-Ruwāt bimā Huwa fīhim Jāʾiz, bal Wājib wa Annahu Laysa min al-Ghībah al-Muḥarramah, bal min al-Dhabb ʿan al-Sharīʿah al-Mukarramah"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab: Isnad Adalah Sebahagian Agama; Riwayat Hanya Diterima daripada Thiqat; Kritikan Perawi Hadis Kerana Kekurangan Mereka Adalah Harus, Bahkan Wajib, Tidak Termasuk Dalam Mengumpat, Bahkan Ia Adalah Pemeliharaan Terhadap Syariah yang Mulia.",
          "ar": "بَابٌ في أَنَّ الْإِسْنَادَ مِنَ الدِّينِ، وأنَّ الرِّوَايَةَ لَا تَكُون إلا عن الثقات، وأن جرح الرواة بما هو فيهم جائز بل واجب وأنه ليس من الغيبة المحرمة بل من الذب عن الشريعة المكرمة"
        },
        "volume_id": "",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": ""
        },
        "volume_title": {
            "en": "",
            "ms": "Pengantar",
            "ar": ""
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "ebcac381-ff8e-4bf5-af08-2fc609993a36",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "Muhammad bin Abu ‘Ummar al-Makki menyampaikan kepada kami, beliau berkata: Sufyan menyampaikan kepada kami. Dalam sanad yang lain, Abu Bakar bin Khallad al-Bahili menyampaikan kepada saya – dan ini lafaz beliau –, beliau berkata: Saya mendengar Sufyan bin ‘Uyaynah menyampaikan daripada Mis‘ar, beliau berkata: Saya mendengar Sa‘d bin Ibrahim berkata: “Tidak boleh sesiapa menyampaikan hadis daripada Rasulullah ﷺ, melainkan orang-orang yang thiqah sahaja.”",
          "ar": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ الْمَكِّيُّ، حَدَّثَنَا سُفْيَانُ، وحَدَّثَنِي أَبُو بَكْرِ بْنُ خَلَّادٍ الْبَاهِلِيُّ - وَاللَّفْظُ لَهُ - قَالَ: سَمِعْتُ سُفْيَانَ بْنَ عُيَيْنَةَ، عَنْ مِسْعَرٍ قَالَ: سَمِعْتُ سَعْدَ بْنَ إِبْرَاهِيمَ يَقُولُ: «لَا يُحَدِّثُ عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِلَّا الثِّقَاتُ»"
        },
        "chapter_id": "fcdec5da-7d1f-470b-b09a-d25568910a8f",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb fī Anna al-Isnād min al-Dīn, wa Anna al-Riwayah Lā Takūn Illā ʿan al-Thiqāt, wa Anna Jarḥ al-Ruwāt bimā Huwa fīhim Jāʾiz, bal Wājib wa Annahu Laysa min al-Ghībah al-Muḥarramah, bal min al-Dhabb ʿan al-Sharīʿah al-Mukarramah"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab: Isnad Adalah Sebahagian Agama; Riwayat Hanya Diterima daripada Thiqat; Kritikan Perawi Hadis Kerana Kekurangan Mereka Adalah Harus, Bahkan Wajib, Tidak Termasuk Dalam Mengumpat, Bahkan Ia Adalah Pemeliharaan Terhadap Syariah yang Mulia.",
          "ar": "بَابٌ في أَنَّ الْإِسْنَادَ مِنَ الدِّينِ، وأنَّ الرِّوَايَةَ لَا تَكُون إلا عن الثقات، وأن جرح الرواة بما هو فيهم جائز بل واجب وأنه ليس من الغيبة المحرمة بل من الذب عن الشريعة المكرمة"
        },
        "volume_id": "",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": ""
        },
        "volume_title": {
            "en": "",
            "ms": "Pengantar",
            "ar": ""
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "9f97a51e-5992-4ee1-bce2-5d53235af3c5",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "(...) Muhammad bin Abdullah bin Quhzad, penduduk Marw juga menyampaikan kepada saya, beliau berkata: Saya mendengar ‘Abdan bin ‘Utsman berkata: Saya mendengar Abdullah bin al-Mubarak berkata: “Sanad adalah sebahagian daripada agama. Jika bukan kerana sanad, sesiapa boleh mendakwa apa-apa yang dia suka.”",
          "ar": "وَحَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ قُهْزَاذَ مِنْ أَهْلِ مَرْوَ، قَالَ: سَمِعْتُ عَبْدَانَ بْنَ عُثْمَانَ يَقُولُ: سَمِعْتُ عَبْدَ اللهِ بْنَ الْمُبَارَكِ، يَقُولُ: «الْإِسْنَادُ مِنَ الدِّينِ، وَلَوْلَا الْإِسْنَادُ لَقَالَ مَنْ شَاءَ مَا شَاءَ»"
        },
        "chapter_id": "fcdec5da-7d1f-470b-b09a-d25568910a8f",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb fī Anna al-Isnād min al-Dīn, wa Anna al-Riwayah Lā Takūn Illā ʿan al-Thiqāt, wa Anna Jarḥ al-Ruwāt bimā Huwa fīhim Jāʾiz, bal Wājib wa Annahu Laysa min al-Ghībah al-Muḥarramah, bal min al-Dhabb ʿan al-Sharīʿah al-Mukarramah"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab: Isnad Adalah Sebahagian Agama; Riwayat Hanya Diterima daripada Thiqat; Kritikan Perawi Hadis Kerana Kekurangan Mereka Adalah Harus, Bahkan Wajib, Tidak Termasuk Dalam Mengumpat, Bahkan Ia Adalah Pemeliharaan Terhadap Syariah yang Mulia.",
          "ar": "بَابٌ في أَنَّ الْإِسْنَادَ مِنَ الدِّينِ، وأنَّ الرِّوَايَةَ لَا تَكُون إلا عن الثقات، وأن جرح الرواة بما هو فيهم جائز بل واجب وأنه ليس من الغيبة المحرمة بل من الذب عن الشريعة المكرمة"
        },
        "volume_id": "",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": ""
        },
        "volume_title": {
            "en": "",
            "ms": "Pengantar",
            "ar": ""
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "7421a8d0-80e3-4bcc-a8ac-f77bc40792ef",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "(...) Muhammad bin Abdullah berkata lagi: al-‘Abbas bin Abu Rizmah menyampaikan kepada saya, beliau berkata: Saya mendengar Abdullah berkata: “Pemutus antara kita dan ahli bidaah adalah tiang-tiang,” iaitu sanad. ",
          "ar": "وقَالَ مُحَمَّدُ بْنُ عَبْدِ اللهِ: حَدَّثَنِي الْعَبَّاسُ بْنُ أَبِي رِزْمَةَ، قَالَ: سَمِعْتُ عَبْدَ اللهِ، يَقُولُ: «بَيْنَنَا وَبَيْنَ الْقَوْمِ الْقَوَائِمُ» يَعْنِي الْإِسْنَادَ"
        },
        "chapter_id": "fcdec5da-7d1f-470b-b09a-d25568910a8f",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb fī Anna al-Isnād min al-Dīn, wa Anna al-Riwayah Lā Takūn Illā ʿan al-Thiqāt, wa Anna Jarḥ al-Ruwāt bimā Huwa fīhim Jāʾiz, bal Wājib wa Annahu Laysa min al-Ghībah al-Muḥarramah, bal min al-Dhabb ʿan al-Sharīʿah al-Mukarramah"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab: Isnad Adalah Sebahagian Agama; Riwayat Hanya Diterima daripada Thiqat; Kritikan Perawi Hadis Kerana Kekurangan Mereka Adalah Harus, Bahkan Wajib, Tidak Termasuk Dalam Mengumpat, Bahkan Ia Adalah Pemeliharaan Terhadap Syariah yang Mulia.",
          "ar": "بَابٌ في أَنَّ الْإِسْنَادَ مِنَ الدِّينِ، وأنَّ الرِّوَايَةَ لَا تَكُون إلا عن الثقات، وأن جرح الرواة بما هو فيهم جائز بل واجب وأنه ليس من الغيبة المحرمة بل من الذب عن الشريعة المكرمة"
        },
        "volume_id": "",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": ""
        },
        "volume_title": {
            "en": "",
            "ms": "Pengantar",
            "ar": ""
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "3f786dd6-fe8a-49b4-855e-510e6b472ef3",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "(...) Muhammad berkata lagi: Saya mendengar Abu Ishaq Ibrahim bin ‘Isa al-Thalqani berkata: Saya bertanya kepada Abdullah bin al-Mubarak, “Wahai Abu ‘Abdul Rahman, apakah status hadis: “Antara kebaikan selepas kebaikan itu adalah kamu solat untuk ibu bapa kamu dengan solatmu, dan kamu berpuasa untuk mereka dengan puasamu.” \n\nAbdullah bin al-Mubarak bertanya, “Wahai Abu Ishaq, daripada siapa kamu dengar hadis ini?” Saya menjawab, “Daripada Syihab bin Khirasy.” Beliau berkata, “Dia thiqah, daripada siapa dia dengar?” Saya menjawab, “Daripada al-Hajjaj bin Dinar.” Beliau berkata, “Dia thiqah, daripada siapa dia dengar?” Saya menjawab, “Rasulullah ﷺ.”\n\nAbdullah berkata, “Wahai Abu Ishaq, antara al-Hajjaj bin Dinar dengan Nabi ﷺ terdapat padang sahara yang perlu ditempuhi dengan berekor-ekor unta. Tetapi hukum tentang sedekah [bagi pihak ibu bapa] tiada khilaf.”",
          "ar": "وقَالَ مُحَمَّدٌ: سَمِعْتُ أَبَا إِسْحَاقَ إِبْرَاهِيمَ بْنَ عِيسَى الطَّالْقَانِيَّ قَالَ: قُلْتُ لِعَبْدِ اللهِ بْنِ الْمُبَارَكِ، يَا أَبَا عَبْدِ الرَّحْمَنِ: الْحَدِيثُ الَّذِي جَاءَ «إِنَّ مِنَ الْبِرِّ بَعْدَ الْبِرِّ أَنْ تُصَلِّيَ لِأَبَوَيْكَ مَعَ صَلَاتِكَ، وَتَصُومَ لَهُمَا مَعَ صَوْمِكَ». قَالَ: فَقَالَ عَبْدُ اللهِ: يَا أَبَا إِسْحَاقَ، عَمَّنْ هَذَا؟ قَالَ: قُلْتُ لَهُ: هَذَا مِنْ حَدِيثِ شِهَابِ بْنِ خِرَاشٍ فَقَالَ: ثِقَةٌ، عَمَّنْ قَالَ؟ قُلْتُ: عَنِ الْحَجَّاجِ بْنِ دِينَارٍ، قَالَ: ثِقَةٌ، عَمَّنْ قَالَ؟ \" قُلْتُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ. قَالَ: يَا أَبَا إِسْحَاقَ، إِنَّ بَيْنَ الْحَجَّاجِ بْنِ دِينَارٍ وَبَيْنَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مَفَاوِزَ تَنْقَطِعُ فِيهَا أَعْنَاقُ الْمَطِيِّ، وَلَكِنْ لَيْسَ فِي الصَّدَقَةِ اخْتِلَافٌ"
        },
        "chapter_id": "fcdec5da-7d1f-470b-b09a-d25568910a8f",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb fī Anna al-Isnād min al-Dīn, wa Anna al-Riwayah Lā Takūn Illā ʿan al-Thiqāt, wa Anna Jarḥ al-Ruwāt bimā Huwa fīhim Jāʾiz, bal Wājib wa Annahu Laysa min al-Ghībah al-Muḥarramah, bal min al-Dhabb ʿan al-Sharīʿah al-Mukarramah"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab: Isnad Adalah Sebahagian Agama; Riwayat Hanya Diterima daripada Thiqat; Kritikan Perawi Hadis Kerana Kekurangan Mereka Adalah Harus, Bahkan Wajib, Tidak Termasuk Dalam Mengumpat, Bahkan Ia Adalah Pemeliharaan Terhadap Syariah yang Mulia.",
          "ar": "بَابٌ في أَنَّ الْإِسْنَادَ مِنَ الدِّينِ، وأنَّ الرِّوَايَةَ لَا تَكُون إلا عن الثقات، وأن جرح الرواة بما هو فيهم جائز بل واجب وأنه ليس من الغيبة المحرمة بل من الذب عن الشريعة المكرمة"
        },
        "volume_id": "",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": ""
        },
        "volume_title": {
            "en": "",
            "ms": "Pengantar",
            "ar": ""
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "ac9017c5-478f-4a2c-9df8-90833031151a",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "Muhammad juga berkata: Saya mendengar ‘Ali bin Syaqiq berkata: Saya mendengar Abdullah bin al-Mubarak berkata di hadapan keramaian manusia, “Tinggalkan hadis-hadis ‘Amr bin Tsabit, dia kuat mencela para salaf (para sahabat ).”",
          "ar": "وَقَالَ مُحَمَّدٌ: سَمِعْتُ عَلِيَّ بْنَ شَقِيقٍ، يَقُولُ: سَمِعْتُ عَبْدَ اللهُ بْنَ الْمُبَارَكِ، يَقُولُ عَلَى رُءُوسِ النَّاسِ: «دَعُوا حَدِيثَ عَمْرِو بْنِ ثَابِتٍ فَإِنَّهُ كَانَ يَسُبَّ السَّلَفَ»"
        },
        "chapter_id": "cd99a569-a6ce-4897-b7e1-c358b85e959c",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb al-Kashf ʿan Maʿāyib Ruwāt al-Ḥadīth wa Naqalat al-Akhbār wa Qawl al-ʾAʾimmah fī Dhālik"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab Mendedahkan Aib-Aib Para Perawi dan Pembawa Khabar, Serta Nukilan Para Ilmuwan Berkenaan Ini.",
          "ar": "َابُ الْكَشْفِ عَنْ مَعَايِبِ رُوَاةِ الْحَدِيثِ وَنَقَلَةِ الْأَخْبَارِ وَقَوْلُ الْأَئِمَّةِ فِي ذَلِكَ"
        },
        "volume_id": "",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": ""
        },
        "volume_title": {
            "en": "",
            "ms": "Pengantar",
            "ar": ""
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "b4bd68f3-e7c9-4a4c-965a-7ffab61a61e2",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "(...) Abu Bakar bin al-Nadhr bin Abu al-Nadhr menyampaikan kepada saya, beliau berkata: Abu al-Nadhr Hasyim bin al-Qasim menyampaikan kepada saya, beliau berkata: Abu ‘Aqil, pelajar Buhayyah, menyampaikan kepada kami, beliau berkata: Saya pernah bersama al-Qasim bin ‘Ubaydullah dan Yahya bin Sa‘id. Lalu Yahya berkata kepada al-Qasim, “Buruk benarlah jika orang sepertimu ditanya tentang apa-apa urusan agama ini, tetapi tidak mengetahui jawapannya.” \n\nAl-Qasim bertanya, “Mengapa begitu pula?” Yahya menjawab, “Kerana kamu keturunan dua imam agung, anak Abu Bakar dan ‘Umar.” Lalu al-Qasim membalas, “Sebenarnya yang lebih buruk – bagi orang yang kenal Allah – adalah jika saya bercakap tanpa ilmu, atau saya mengambil ilmu daripada orang yang tidak thiqah.” Yahya terdiam mendengar jawapan itu.",
          "ar": "وحَدَّثَنِي أَبُو بَكْرِ بْنُ النَّضْرِ بْنِ أَبِي النَّضْرِ، قَالَ: حَدَّثَنِي أَبُو النَّضْرِ هَاشِمُ بْنُ الْقَاسِمِ، حَدَّثَنَا أَبُو عَقِيلٍ، صَاحِبُ بُهَيَّةَ، قَالَ: كُنْتُ جَالِسًا عِنْدَ الْقَاسِمِ بْنِ عُبَيْدِ اللهِ، وَيَحْيَى بْنِ سَعِيدٍ، فَقَالَ يَحْيَى لِلْقَاسِمِ: يَا أَبَا مُحَمَّدٍ إِنَّهُ قَبِيحٌ عَلَى مِثْلِكَ، عَظِيمٌ أَنْ تُسْأَلَ عَنْ شَيْءٍ مِنْ أَمْرِ هَذَا الدِّينِ، فَلَا يُوجَدَ عِنْدَكَ مِنْهُ عِلْمٌ، وَلَا فَرَجٌ - أَوْ عِلْمٌ، وَلَا مَخْرَجٌ - فَقَالَ لَهُ الْقَاسِمُ: وَعَمَّ ذَاكَ؟، قَالَ: لِأَنَّكَ ابْنُ إِمَامَيْ هُدًى. ابْنُ أَبِي بَكْرٍ، وَعُمَرَ، قَالَ: يَقُولُ لَهُ الْقَاسِمُ: أَقْبَحُ مِنْ ذَاكَ عِنْدَ مَنْ عَقَلَ عَنِ اللهِ أَنْ أَقُولَ بِغَيْرِ عِلْمٍ، أَوْ آخُذَ عَنْ غَيْرُ ثِقَةٍ، قَالَ: فَسَكَتَ فَمَا أَجَابَهُ"
        },
        "chapter_id": "cd99a569-a6ce-4897-b7e1-c358b85e959c",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb al-Kashf ʿan Maʿāyib Ruwāt al-Ḥadīth wa Naqalat al-Akhbār wa Qawl al-ʾAʾimmah fī Dhālik"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab Mendedahkan Aib-Aib Para Perawi dan Pembawa Khabar, Serta Nukilan Para Ilmuwan Berkenaan Ini.",
          "ar": "َابُ الْكَشْفِ عَنْ مَعَايِبِ رُوَاةِ الْحَدِيثِ وَنَقَلَةِ الْأَخْبَارِ وَقَوْلُ الْأَئِمَّةِ فِي ذَلِكَ"
        },
        "volume_id": "",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": ""
        },
        "volume_title": {
            "en": "",
            "ms": "Pengantar",
            "ar": ""
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "5b21d46e-efb6-4d56-9bce-1e8dd6053549",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "(...) Bisyr bin al-Hakam al-‘Abdi menyampaikan kepada saya, beliau berkata: Saya mendengar Sufyan bin ‘Uyaynah berkata: Mereka menyampaikan kepada saya, daripada Abu ‘Aqil, pelajar Buhayyah, bahawa orang ramai bertanya kepada seorang keturunan ‘Abdullah bin ‘Umar tentang sesuatu yang dia tidak ketahui. \n\nLalu Yahya bin Sa‘id berkata, “Demi Allah, saya rasa berat sungguh jika orang sepertimu – padahal kamu anak dua tokoh, ‘Umar dan ibn ‘Umar – ditanya, tetapi kamu tidak tahu jawapannya.” Keturunan ‘Abdullah bin ‘Umar tersebut menjawab, “Yang lebih berat daripada itu di sisi Allah, dan di sisi orang-orang yang mengenali Allah: jika saya bercakap tanpa ilmu, atau saya menyampaikan ilmu daripada sumber yang tidak dipercayai.”\n\nAbu ‘Aqil Yahya bin al-Mutawakkil menyaksikan perbualan dua tokoh ini.",
          "ar": "وحَدَّثَنِي بِشْرُ بْنُ الْحَكَمِ الْعَبْدِيُّ، قَالَ: سَمِعْتُ سُفْيَانَ بْنَ عُيَيْنَةَ، يَقُولُ: أَخْبَرُونِي عَنْ أَبِي عَقِيلٍ صَاحِبِ بُهَيَّةَ، أَنَّ أَبْنَاءً لِعَبْدِ اللهِ بْنِ عُمَرَ سَأَلُوهُ عَنْ شَيْءٍ لَمْ يَكُنْ عِنْدَهُ فِيهِ عِلْمٌ، فَقَالَ لَهُ يَحْيَى بْنُ سَعِيدٍ: وَاللهِ إِنِّي لَأُعْظِمُ أَنْ يَكُونَ مِثْلُكَ، وَأَنْتَ ابْنُ إِمَامَيِ الْهُدَى - يَعْنِي عُمَرَ، وَابْنَ عُمَرَ - تُسْأَلُ عَنْ أَمْرٍ لَيْسَ عِنْدَكَ فِيهِ عِلْمٌ، فَقَالَ: «أَعْظَمُ مِنْ ذَلِكَ وَاللهِ عِنْدَ اللهِ، وَعِنْدَ مَنْ عَقَلَ عَنِ اللهِ، أَنْ أَقُولَ بِغَيْرِ عِلْمٍ، أَوْ أُخْبِرَ عَنْ غَيْرِ ثِقَةٍ» قَالَ: وَشَهِدَهُمَا أَبُو عَقِيلٍ يَحْيَى بْنُ الْمُتَوَكِّلِ حِينَ قَالَا ذَلِكَ."
        },
        "chapter_id": "cd99a569-a6ce-4897-b7e1-c358b85e959c",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb al-Kashf ʿan Maʿāyib Ruwāt al-Ḥadīth wa Naqalat al-Akhbār wa Qawl al-ʾAʾimmah fī Dhālik"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab Mendedahkan Aib-Aib Para Perawi dan Pembawa Khabar, Serta Nukilan Para Ilmuwan Berkenaan Ini.",
          "ar": "َابُ الْكَشْفِ عَنْ مَعَايِبِ رُوَاةِ الْحَدِيثِ وَنَقَلَةِ الْأَخْبَارِ وَقَوْلُ الْأَئِمَّةِ فِي ذَلِكَ"
        },
        "volume_id": "",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": ""
        },
        "volume_title": {
            "en": "",
            "ms": "Pengantar",
            "ar": ""
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "9c23dd9c-74e4-4c0d-af77-7aa0c9019de0",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "(…) Abu Hafsh ‘Amr bin ‘Ali menyampaikan kepada kami, beliau berkata: Saya mendengar Yahya bin Sa‘id berkata: Saya bertanya Sufyan al-Tsawri, Syu‘bah, Malik dan ibn ‘Uyaynah tentang seseorang yang tidak boleh dipercayai dalam ilmu hadis. Jika ada orang lain bertanya saya tentangnya, apakah yang perlu dilakukan? Mereka menjawab, “Beritahu dia, bahawa orang itu tidak boleh dipercayai.”",
          "ar": "وَحَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ أَبُو حَفْصٍ، قَالَ: سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ، قَالَ: سَأَلْتُ سُفْيَانَ الثَّوْرِيَّ، وَشُعْبَةَ، وَمَالِكًا، وَابْنَ عُيَيْنَةَ، عَنِ الرَّجُلِ لَا يَكُونُ ثَبْتًا فِي الْحَدِيثِ، فَيَأْتِينِي الرَّجُلُ، فَيَسْأَلُنِي عَنْهُ، قَالُوا: «أَخْبِرْ عَنْهُ أَنَّهُ لَيْسَ بِثَبْتٍ»"
        },
        "chapter_id": "cd99a569-a6ce-4897-b7e1-c358b85e959c",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb al-Kashf ʿan Maʿāyib Ruwāt al-Ḥadīth wa Naqalat al-Akhbār wa Qawl al-ʾAʾimmah fī Dhālik"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab Mendedahkan Aib-Aib Para Perawi dan Pembawa Khabar, Serta Nukilan Para Ilmuwan Berkenaan Ini.",
          "ar": "َابُ الْكَشْفِ عَنْ مَعَايِبِ رُوَاةِ الْحَدِيثِ وَنَقَلَةِ الْأَخْبَارِ وَقَوْلُ الْأَئِمَّةِ فِي ذَلِكَ"
        },
        "volume_id": "",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": ""
        },
        "volume_title": {
            "en": "",
            "ms": "Pengantar",
            "ar": ""
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "afe01ba8-ac54-443e-b906-845966c155db",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "(...) ‘Ubaydullah bin Sa‘id menyampaikan kepada kami, beliau berkata: Saya mendengar al-Nadhr berkata: Ketika ibn ‘Awn sedang berjalan keluar dari rumahnya, beliau ditanya berkenaan hadis Syahr [bin Hawsyab]. Beliau menjawab, “Syahr ini, mereka mengkritiknya keras. Syahr ini, mereka mengkritiknya keras.”\n\nMuslim  berkata: Lidah ahli hadis tidak putus-putus mengkritiknya.",
          "ar": "وَحَدَّثَنَا عُبَيْدُ اللهِ بْنُ سَعِيدٍ، قَالَ: سَمِعْتُ النَّضْرَ، يَقُولُ: سُئِلَ ابْنُ عَوْنٍ، عَنْ حَدِيثٍ لِشَهْرٍ وَهُوَ قَائِمٌ عَلَى أُسْكُفَّةِ الْبَابِ، فَقَالَ: «إِنَّ شَهْرًا نَزَكُوهُ، إِنَّ شَهْرًا نَزَكُوهُ». قَالَ مُسْلِمٌ رَحِمَهُ اللهُ: \" يَقُولُ: أَخَذَتْهُ أَلْسِنَةُ النَّاسِ تَكَلَّمُوا فِيهِ \""
        },
        "chapter_id": "cd99a569-a6ce-4897-b7e1-c358b85e959c",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb al-Kashf ʿan Maʿāyib Ruwāt al-Ḥadīth wa Naqalat al-Akhbār wa Qawl al-ʾAʾimmah fī Dhālik"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab Mendedahkan Aib-Aib Para Perawi dan Pembawa Khabar, Serta Nukilan Para Ilmuwan Berkenaan Ini.",
          "ar": "َابُ الْكَشْفِ عَنْ مَعَايِبِ رُوَاةِ الْحَدِيثِ وَنَقَلَةِ الْأَخْبَارِ وَقَوْلُ الْأَئِمَّةِ فِي ذَلِكَ"
        },
        "volume_id": "",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": ""
        },
        "volume_title": {
            "en": "",
            "ms": "Pengantar",
            "ar": ""
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "9e493bbb-f98a-48db-8591-30685f16e81c",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "(...) Hajjaj bin al-Sya‘ir menyampaikan kepada saya, beliau berkata: Syababah menyampaikan kepada kami, beliau berkata: Syu‘bah berkata: “Saya sudah jumpa Syahr, dan saya tidak percaya dengan dia.”",
          "ar": "وحَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنَا شَبَابَةُ، قَالَ: قَالَ شُعْبَةُ: «وَقَدْ لَقِيتُ شَهْرًا فَلَمْ أَعْتَدَّ بِهِ» "
        },
        "chapter_id": "cd99a569-a6ce-4897-b7e1-c358b85e959c",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb al-Kashf ʿan Maʿāyib Ruwāt al-Ḥadīth wa Naqalat al-Akhbār wa Qawl al-ʾAʾimmah fī Dhālik"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab Mendedahkan Aib-Aib Para Perawi dan Pembawa Khabar, Serta Nukilan Para Ilmuwan Berkenaan Ini.",
          "ar": "َابُ الْكَشْفِ عَنْ مَعَايِبِ رُوَاةِ الْحَدِيثِ وَنَقَلَةِ الْأَخْبَارِ وَقَوْلُ الْأَئِمَّةِ فِي ذَلِكَ"
        },
        "volume_id": "",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": ""
        },
        "volume_title": {
            "en": "",
            "ms": "Pengantar",
            "ar": ""
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "9132687b-1de2-4e60-8c7c-6633ee2ba0db",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "(...) Muhamad bin Abdullah bin Quhzad, orang Marw, menyampaikan kepada saya, beliau berkata: ‘Ali bin Husayn bin Waqid mengkhabarkan kepada saya, beliau berkata: Abdullah bin al-Mubarak berkata: Saya bertanya kepada Sufyan al-Tsawri, “Tentang ‘Abbad bin Katsir, kamu pun tahu statusnya yang suka menyampaikan hal-hal aneh yang besar. Pada pendapatmu, patutkah saya menasihatkan orang ramai untuk tidak mengambil ilmu daripadanya?” Sufyan menjawab, “Sudah tentu!”\n\nAbdullah bin al-Mubarak berkata: Selepas itu, apabila saya mendengar ada orang menukilkan hadis daripada ‘Abbad, saya akan memuji kewarakannya, lalu memberi pesanan: “Tetapi jangan ambil ilmu daripadanya.”\n\nMuhammad [ibn Quhzad] juga berkata: ‘Abdullah bin ‘Utsman berkata: Bapa saya berkata: Abdullah bin al-Mubarak berkata: Saya pergi ke majlis Syu‘bah, lalu beliau berpesan, “Ini ‘Abbad bin Katsir, hati-hati dengan dia.”\n\nAl-Fadhl bin Sahl juga menyampaikan kepada saya, beliau berkata: Saya bertanya kepada Mu‘alla al-Razi, tentang Muhammad bin Sa‘id, guru yang ‘Abbad riwayatkan hadis daripadanya. Beliau pun mengkhabarkan kepada saya, daripada ‘Isa bin Yunus, beliau berkata: Saya pernah berada di depan pintu rumahnya, sementara Sufyan bersamanya di dalam. Apabila Sufyan keluar, saya bertanya kepada beliau tentang Muhammad bin Sa‘id. Sufyan menjawab, “Dia kaki dusta!”",
          "ar": "وحَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ قُهْزَاذَ، مِنْ أَهْلِ مَرْوَ، قَالَ: أَخْبَرَنِي عَلِيُّ بْنُ حُسَيْنِ بْنِ وَاقِدٍ، قَالَ: قَالَ عَبْدُ اللهِ بْنُ الْمُبَارَكِ: قُلْتُ لِسُفْيَانَ الثَّوْرِيِّ: \" إِنَّ عَبَّادَ بْنَ كَثِيرٍ مَنْ تَعْرِفُ حَالَهُ، وَإِذَا حَدَّثَ جَاءَ بِأَمْرٍ عَظِيمٍ، فَتَرَى أَنْ أَقُولَ لِلنَّاسِ: لَا تَأْخُذُوا عَنْهُ؟ \" قَالَ سُفْيَانُ: «بَلَى»، قَالَ عَبْدُ اللهِ: فَكُنْتُ إِذَا كُنْتُ فِي مَجْلِسٍ ذُكِرَ فِيهِ عَبَّادٌ، أَثْنَيْتُ عَلَيْهِ فِي دِينِهِ، وَأَقُولُ: «لَا تَأْخُذُوا عَنْهُ» وَقَالَ مُحَمَّدٌ: حَدَّثَنَا عَبْدُ اللهِ بْنُ عُثْمَانَ، قَالَ: قَالَ أَبِي، قَالَ عَبْدُ اللهِ بْنُ الْمُبَارَكِ: انْتَهَيْتُ إِلَى شُعْبَةَ، فَقَالَ: هَذَا عَبَّادُ بْنُ كَثِيرٍ، فَاحْذَرُوهُ وحَدَّثَنِي الْفَضْلُ بْنُ سَهْلٍ، قَالَ: سَأَلْتُ مُعَلًّى الرَّازِيَّ، عَنْ مُحَمَّدِ بْنِ سَعِيدٍ، الَّذِي رَوَى عَنْهُ عَبَّادٌ، فَأَخْبَرَنِي عَنْ عِيسَى بْنِ يُونُسَ، قَالَ: «كُنْتُ عَلَى بَابِهِ، وَسُفْيَانُ عِنْدَهُ، فَلَمَّا خَرَجَ سَأَلْتُهُ عَنْهُ، فَأَخْبَرَنِي أَنَّهُ كَذَّابٌ»"
        },
        "chapter_id": "cd99a569-a6ce-4897-b7e1-c358b85e959c",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb al-Kashf ʿan Maʿāyib Ruwāt al-Ḥadīth wa Naqalat al-Akhbār wa Qawl al-ʾAʾimmah fī Dhālik"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab Mendedahkan Aib-Aib Para Perawi dan Pembawa Khabar, Serta Nukilan Para Ilmuwan Berkenaan Ini.",
          "ar": "َابُ الْكَشْفِ عَنْ مَعَايِبِ رُوَاةِ الْحَدِيثِ وَنَقَلَةِ الْأَخْبَارِ وَقَوْلُ الْأَئِمَّةِ فِي ذَلِكَ"
        },
        "volume_id": "",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": ""
        },
        "volume_title": {
            "en": "",
            "ms": "Pengantar",
            "ar": ""
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "e82f3b2a-6d9e-4bba-8c70-9bef5b59a15a",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "(...) Muhammad bin Abu ‘Attab menyampaikan kepada saya, beliau berkata: ‘Affan menyampaikan kepada saya, daripada Muhammad bin Yahya bin Sa‘id al-Qaththan, daripada bapanya, beliau berkata: “Saya tidak pernah lihat ada orang soleh yang lebih kuat berdusta daripada mereka.”\n\nIbn Abu ‘Attab berkata: Lalu saya bertemu Muhammad bin Yahya dan bertanya tentang ucapan bapanya ini. Beliau pun meriwayatkan bapanya berkata: “Kamu belum pernah jumpa orang-orang baik yang lebih kuat berdusta daripada mereka dalam hadis.”\n\nImam Muslim menjelaskan: Maksudnya, hadis-hadis dusta meluncur laju dari mulut mereka, tetapi mereka bukan sengaja mahu berdusta.",
          "ar": "وحَدَّثَنِي مُحَمَّدُ بْنُ أَبِي عَتَّابٍ، قَالَ: حَدَّثَنِي عَفَّانُ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ سَعِيدٍ الْقَطَّانِ، عَنْ أَبِيهِ، قَالَ: «لَمْ نَرَ الصَّالِحِينَ فِي شَيْءٍ أَكْذَبَ مِنْهُمْ فِي الْحَدِيثِ» [ص:18] قَالَ ابْنُ أَبِي عَتَّابٍ: فَلَقِيتُ أَنَا مُحَمَّدَ بْنَ يَحْيَى بْنِ سَعِيدٍ الْقَطَّانَ، فَسَأَلْتُهُ عَنْهُ، فَقَالَ: عَنْ أَبِيهِ، «لَمْ تَرَ أَهْلَ الْخَيْرِ فِي شَيْءٍ أَكْذَبَ مِنْهُمْ فِي الْحَدِيثِ». قَالَ مُسْلِمٌ: \" يَقُولُ: يَجْرِي الْكَذِبُ عَلَى لِسَانِهِمْ، وَلَا يَتَعَمَّدُونَ الْكَذِبَ \""
        },
        "chapter_id": "cd99a569-a6ce-4897-b7e1-c358b85e959c",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb al-Kashf ʿan Maʿāyib Ruwāt al-Ḥadīth wa Naqalat al-Akhbār wa Qawl al-ʾAʾimmah fī Dhālik"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab Mendedahkan Aib-Aib Para Perawi dan Pembawa Khabar, Serta Nukilan Para Ilmuwan Berkenaan Ini.",
          "ar": "َابُ الْكَشْفِ عَنْ مَعَايِبِ رُوَاةِ الْحَدِيثِ وَنَقَلَةِ الْأَخْبَارِ وَقَوْلُ الْأَئِمَّةِ فِي ذَلِكَ"
        },
        "volume_id": "",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": ""
        },
        "volume_title": {
            "en": "",
            "ms": "Pengantar",
            "ar": ""
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "4678a4ac-f6b1-4f74-9f48-6fd8333c6856",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "(...) al-Fadhl bin Sahl menyampaikan kepada saya, beliau berkata: Yazid bin Harun menyampaikan kepada kami, beliau berkata: Khalifah bin Musa mengkhabarkan kepada saya, beliau berkata: Saya menghadiri kelas Ghalib bin ‘Ubaydullah, lalu beliau membacakan hadisnya kepada saya, “Makhul menyampaikan kepada saya,... Makhul menyampaikan kepada saya...” Kemudian beliau berehat untuk ke tandas.\n\nSaya mengambil kesempatan tersebut untuk membaca catatan hadis beliau, saya dapati dalamnya tertulis: “Aban menyampaikan kepada saya, daripada Anas.... Aban daripada si anu...” Lalu saya pergi meninggalkan kelasnya itu.",
          "ar": "حَدَّثَنِي الْفَضْلُ بْنُ سَهْلٍ، قَالَ: حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، قَالَ: أَخْبَرَنِي خَلِيفَةُ بْنُ مُوسَى، قَالَ: «دَخَلْتُ عَلَى غَالِبِ بْنِ عُبَيْدِ اللهِ فَجَعَلَ يُمْلِي عَلَيَّ، حَدَّثَنِي مَكْحُولٌ، حَدَّثَنِي مَكْحُولٌ، فَأَخَذَهُ الْبَوْلُ، فَقَامَ فَنَظَرْتُ فِي الْكُرَّاسَةِ، فَإِذَا فِيهَا حَدَّثَنِي أَبَانُ، عَنْ أَنَسٍ، وَأَبَانُ عَنْ فُلَانٍ، فَتَرَكْتُهُ، وَقُمْتُ»"
        },
        "chapter_id": "cd99a569-a6ce-4897-b7e1-c358b85e959c",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb al-Kashf ʿan Maʿāyib Ruwāt al-Ḥadīth wa Naqalat al-Akhbār wa Qawl al-ʾAʾimmah fī Dhālik"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab Mendedahkan Aib-Aib Para Perawi dan Pembawa Khabar, Serta Nukilan Para Ilmuwan Berkenaan Ini.",
          "ar": "َابُ الْكَشْفِ عَنْ مَعَايِبِ رُوَاةِ الْحَدِيثِ وَنَقَلَةِ الْأَخْبَارِ وَقَوْلُ الْأَئِمَّةِ فِي ذَلِكَ"
        },
        "volume_id": "",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": ""
        },
        "volume_title": {
            "en": "",
            "ms": "Pengantar",
            "ar": ""
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "867b4b8e-5c83-4b7a-b424-bf0472708283",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "(...) Beliau berkata: Saya juga mendengar al-Hasan bin ‘Ali al-Hulwani berkata: Saya menemui dalam catatan ‘Affan, hadis Hisyam Abu al-Miqdam, hadis ‘Umar bin Abdul ‘Aziz. Hisyam berkata: Seorang lelaki bernama Yahya bin si anu menyampaikan kepada saya, daripada Muhammad bin Kaab...” \n\nSaya pun bertanya kepada ‘Affan, “Ahli hadis mengatakan bahawa Hisyam mendengar hadis ini daripada Muhammad bin Kaab?” ‘Affan menjawab, “Hisyam diuji dengan hadis ini. Hisyam selalu menyebut: “Yahya menyampaikan kepada kami, daripada Muhammad,” kemudian selepas itu beliau mendakwa beliau mendengar terus daripada Muhmmad.”",
          "ar": "قَالَ: وَسَمِعْتُ الْحَسَنَ بْنَ عَلِيٍّ الْحُلْوَانِيَّ، يَقُولُ: رَأَيْتُ فِي كِتَابِ عَفَّانَ، حَدِيثَ هِشَامٍ أَبِي الْمِقْدَامِ، حَدِيثَ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ، قَالَ هِشَامٌ: حَدَّثَنِي رَجُلٌ يُقَالُ لَهُ يَحْيَى بْنُ فُلَانٍ، عَنْ مُحَمَّدِ بْنِ كَعْبٍ، قَالَ: قُلْتُ لِعَفَّانَ: إِنَّهُمْ يَقُولُونَ هِشَامٌ، سَمِعَهُ مِنْ مُحَمَّدِ بْنِ كَعْبٍ، فَقَالَ: \" إِنَّمَا ابْتُلِيَ مِنْ قِبَلِ هَذَا الْحَدِيثِ، كَانَ يَقُولُ: حَدَّثَنِي يَحْيَى، عَنْ مُحَمَّدٍ، ثُمَّ ادَّعَى بَعْدُ أَنَّهُ سَمِعَهُ مِنْ مُحَمَّدٍ \""
        },
        "chapter_id": "cd99a569-a6ce-4897-b7e1-c358b85e959c",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb al-Kashf ʿan Maʿāyib Ruwāt al-Ḥadīth wa Naqalat al-Akhbār wa Qawl al-ʾAʾimmah fī Dhālik"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab Mendedahkan Aib-Aib Para Perawi dan Pembawa Khabar, Serta Nukilan Para Ilmuwan Berkenaan Ini.",
          "ar": "َابُ الْكَشْفِ عَنْ مَعَايِبِ رُوَاةِ الْحَدِيثِ وَنَقَلَةِ الْأَخْبَارِ وَقَوْلُ الْأَئِمَّةِ فِي ذَلِكَ"
        },
        "volume_id": "",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": ""
        },
        "volume_title": {
            "en": "",
            "ms": "Pengantar",
            "ar": ""
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "aea95973-cc3f-4a7b-8e76-17742faf0809",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "(...) Muhammad bin Abdullah bin Quhzad menyampaikan kepada saya, beliau berkata: Saya mendengar Abdullah bin ‘Utsman bin Jabalah berkata: Saya bertanya kepada Abdullah bin al-Mubarak, “Siapa lelaki yang kamu riwayatkan daripadanya hadis Abdullah bin ‘Amr: Hari raya Aidulifitri adalah hari anugerah?” Beliau menjawab, “Sulayman bin al-Hajjaj. Lihat apa yang kamu letakkan dalam tanganmu dari hadisnya itu. ”",
          "ar": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ قُهْزَاذَ، قَالَ: سَمِعْتُ عَبْدَ اللهِ بْنَ عُثْمَانَ بْنِ جَبَلَةَ، يَقُولُ: قُلْتُ لِعَبْدِ اللهِ بْنِ الْمُبَارَكِ: مَنْ هَذَا الرَّجُلُ الَّذِي رَوَيْتَ عَنْهُ حَدِيثَ عَبْدِ اللهِ بْنِ عَمْرٍو يَوْمُ الْفِطْرِ يَوْمُ الْجَوَائِزِ؟ قَالَ: «سُلَيْمَانُ بْنُ الْحَجَّاجِ انْظُرْ مَا وَضَعْتَ فِي يَدِكَ مِنْهُ»"
        },
        "chapter_id": "cd99a569-a6ce-4897-b7e1-c358b85e959c",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb al-Kashf ʿan Maʿāyib Ruwāt al-Ḥadīth wa Naqalat al-Akhbār wa Qawl al-ʾAʾimmah fī Dhālik"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab Mendedahkan Aib-Aib Para Perawi dan Pembawa Khabar, Serta Nukilan Para Ilmuwan Berkenaan Ini.",
          "ar": "َابُ الْكَشْفِ عَنْ مَعَايِبِ رُوَاةِ الْحَدِيثِ وَنَقَلَةِ الْأَخْبَارِ وَقَوْلُ الْأَئِمَّةِ فِي ذَلِكَ"
        },
        "volume_id": "",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": ""
        },
        "volume_title": {
            "en": "",
            "ms": "Pengantar",
            "ar": ""
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "aeb2b3e7-75c2-4765-a066-f70d1908dec2",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "(...) Ibn Quhzad berkata: Saya juga mendengar Wahab bin Zam‘ah meriwayatkan daripada Sufyan bin Abdul Malik, beliau berkata: Abdullah – ibn al-Mubarak – berkata: “Saya pernah bertemu Rawh bin Ghuthayf, empunya hadis “darah sekadar dirham,” dan duduk di majlisnya. Saya jadi malu kalau-kalau kawan saya melihat saya duduk di majlisnya,” kerana beliau benci riwayatnya.",
          "ar": "قَالَ ابْنُ قُهْزَاذَ: وَسَمِعْتُ وَهْبَ بْنَ زَمْعَةَ، يَذْكُرُ عَنْ سُفْيَانَ بْنِ عَبْدِ الْمَلِكِ، قَالَ: قَالَ عَبْدُ اللهِ يَعْنِي ابْنَ الْمُبَارَكِ: «رَأَيْتُ رَوْحَ بْنَ غُطَيْفٍ صَاحِبَ الدَّمِ قَدْرِ الدِّرْهَمِ، وَجَلَسْتُ إِلَيْهِ مَجْلِسًا، فَجَعَلْتُ أَسْتَحْيِي مِنْ أَصْحَابِي أَنْ يَرَوْنِي جَالِسًا مَعَهُ كُرْهَ حَدِيثِهِ»"
        },
        "chapter_id": "cd99a569-a6ce-4897-b7e1-c358b85e959c",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb al-Kashf ʿan Maʿāyib Ruwāt al-Ḥadīth wa Naqalat al-Akhbār wa Qawl al-ʾAʾimmah fī Dhālik"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab Mendedahkan Aib-Aib Para Perawi dan Pembawa Khabar, Serta Nukilan Para Ilmuwan Berkenaan Ini.",
          "ar": "َابُ الْكَشْفِ عَنْ مَعَايِبِ رُوَاةِ الْحَدِيثِ وَنَقَلَةِ الْأَخْبَارِ وَقَوْلُ الْأَئِمَّةِ فِي ذَلِكَ"
        },
        "volume_id": "",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": ""
        },
        "volume_title": {
            "en": "",
            "ms": "Pengantar",
            "ar": ""
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "6b6ff565-ee40-454c-895b-fc60e78ae3df",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "(...) Ibn Quhzad menyampaikan kepada saya, beliau berkata: Saya mendengar Wahb meriwayatkan daripada Sufyan, daripada ibn al-Mubarak, beliau berkata: “Baqiyyah ini jujur, tetapi dia sejenis mengambil ilmu daripada semua jenis orang.”",
          "ar": "حَدَّثَنِي ابْنُ قُهْزَاذَ، قَالَ: سَمِعْتُ وَهْبًا، يَقُولُ: عَنْ سُفْيَانَ، عَنْ ابْنِ الْمُبَارَكِ، قَالَ: بَقِيَّةُ صَدُوقُ اللِّسَانِ، وَلَكِنَّهُ يَأْخُذُ عَمَّنْ أَقْبَلَ وَأَدْبَرَ \""
        },
        "chapter_id": "cd99a569-a6ce-4897-b7e1-c358b85e959c",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb al-Kashf ʿan Maʿāyib Ruwāt al-Ḥadīth wa Naqalat al-Akhbār wa Qawl al-ʾAʾimmah fī Dhālik"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab Mendedahkan Aib-Aib Para Perawi dan Pembawa Khabar, Serta Nukilan Para Ilmuwan Berkenaan Ini.",
          "ar": "َابُ الْكَشْفِ عَنْ مَعَايِبِ رُوَاةِ الْحَدِيثِ وَنَقَلَةِ الْأَخْبَارِ وَقَوْلُ الْأَئِمَّةِ فِي ذَلِكَ"
        },
        "volume_id": "",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": ""
        },
        "volume_title": {
            "en": "",
            "ms": "Pengantar",
            "ar": ""
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "412189fe-f67d-44dd-a13f-47bf05706e41",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "1 – (8) Abu Khaytsamah Zuhayr bin Harb menyampaikan kepada saya, beliau berkata: Waki‘ menyampaikan kepada kami, daripada Kahmas, daripada Abdullah bin Buraydah, daripada Yahya bin Ya‘mar. Dalam sanad yang lain, ‘Ubaydullah bin Mu‘adz al-‘Anbari menyampaikan kepada kami – dan ini lafaznya –, beliau berkata: Bapa saya menyampaikan kepada kami, beliau berkata: Kahmas menyampaikan kepada kami, daripada ibn Buraydah, daripada Yahya bin Ya‘mar, beliau berkata: Orang pertama yang menolak Qadar di Basrah adalah Ma‘bad al-Juhani. Apabila saya dan Humayd bin Abdul Rahman al-Himyari merancang perjalanan untuk melaksanakan haji –atau umrah–, kami berpakat untuk bertanya kepada mana-mana sahabat Rasulullah ﷺ yang kami temui, tentang teori mereka tentang Qadar. \n\nKami direzekikan bertemu dengan Abdullah bin ‘Umar bin al-Khattab  di dalam Masjidilharam, lalu kami menemui beliau, seorang di kanan, dan seorang di kiri. Saya rasa teman saya mewakilkan saya untuk bercakap, maka saya pun menyuarakan: “Wahai Abu Abdul Rahman, muncul di tempat kami sekumpulan orang yang mengkaji al-Quran, menggali-gali keilmuan, mereka begitu dan begini. Tetapi mereka mendakwa Qadar itu tiada, dan setiap perkara berlaku secara spontan.” \n\nAbdullah berkata, “Jika kamu jumpa mereka, beritahu: Bahawa saya berlepas diri daripada mereka, dan mereka tiada kaitan dengan saya. Demi Zat yang ibn ‘Umar bersumpah dengan-Nya; jika seorang mereka memiliki segunung emas untuk disedekahkan, Allah tidak akan menerimanya langsung sehinggalah mereka mengimani Qadar.”\n\nBeliau berkata lagi: Bapa saya menyampaikan kepada saya, beliau berkata: Pernah suatu hari kami bersama Rasulullah ﷺ, tiba-tiba muncul seorang lelaki yang sangat putih jubahnya, sangat berkilat rambutnya, dalam kalangan kami tiada yang mengenalinya; dia terus berjalan sehingga duduk menghadap Nabi ﷺ, dia menyandarkan lututnya dengan lutut baginda, dan meletakkan tapak tangannya pada pahanya. \n\nLelaki berkata, “Wahai Muhammad, khabarkan kepada saya berkenaan Islam.” Rasulullah ﷺ pun menjawab, “Islam itu: Kamu bersaksi tiada yang berhak disembah selain Allah, dan Muhammad itu utusan Allah, kamu mendirikan solat, menunaikan zakat, berpuasa Ramadan, melaksanakan haji di Kaabah sekiranya kamu mampu.”\n\nLelaki itu berkata, “Engkau berkata benar.” Kami pun berasa hairan kerana dia yang bertanya, namun dia juga yang membenarkannya. Lelaki itu bertanya lagi, “Beritahu kepada aku tentang Iman?” Rasulullah ﷺ bersabda: “Iman itu ialah kamu beriman dengan Allah, para malaikat-Nya, kitab-kitab-Nya, para utusan-Nya (Nabi dan Rasul), hari kiamat dan ketentuan Allah; samada baik mahupun buruk (Qada dan Qadar).”\n\nLelaki itu bertanya lagi, “Beritahu kepada aku tentang Ihsan?” Rasulullah ﷺ bersabda, “Ihsan itu keadaanmu menyembah Allah seakan-akan kamu melihat-Nya. Jika tidak mampu sedemikian, maka Dia sentiasa melihatmu.”\n\nLelaki itu bertanya lagi, “Beritahu kepada aku tentang Hari Kiamat?” Rasulullah ﷺ  bersabda: “Kamu tidak tahu, apatah lagi saya.” Lelaki itu bertanya lagi: “Beritahu kepada aku tentang beberapa petandanya?” Rasulullah ﷺ bersabda: “Hamba-hamba sahaya perempuan melahirkan tuannya, dan kamu dapat melihat orang-orang yang asalnya tidak memakai sebarang alas kaki mahupun pakaian-pakaian, mereka itu fakir miskin; namun kelak mereka akan berlumba-lumba membina bangunan yang tinggi.”\n\nKemudian lelaki itu pun beredar. Setelah beberapa hari, Rasulullah ﷺ bertanya kepadaku, “Wahai Umar, adakah kamu tahu siapa penyoal yang datang pada hari itu?”  Saya berkata: “Allah dan Rasul-Nya lebih mengetahui.” Rasulullah ﷺ bersabda: “Sesungguhnya, dia itu Jibrail, datang untuk mengajar agama kalian.”",
          "ar": "1 - (8) حَدَّثَنِي أَبُو خَيْثَمَةَ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا وَكِيعٌ، عَنْ كَهْمَسٍ، عَنْ عَبْدِ اللهِ بْنِ بُرَيْدَةَ، عَنْ يَحْيَى بْنِ يَعْمَرَ، ح وحَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ - وَهَذَا حَدِيثُهُ - حَدَّثَنَا أَبِي، حَدَّثَنَا كَهْمَسٌ، عَنِ ابْنِ بُرَيْدَةَ، عَنْ يَحْيَى بْنِ يَعْمَرَ، قَالَ: كَانَ أَوَّلَ مَنْ قَالَ فِي الْقَدَرِ بِالْبَصْرَةِ مَعْبَدٌ الْجُهَنِيُّ، فَانْطَلَقْتُ أَنَا وَحُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ الْحِمْيَرِيُّ حَاجَّيْنِ - أَوْ مُعْتَمِرَيْنِ - فَقُلْنَا: لَوْ لَقِينَا أَحَدًا مَنْ أَصْحَابِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَسَأَلْنَاهُ عَمَّا يَقُولُ هَؤُلَاءِ فِي الْقَدَرِ، فَوُفِّقَ لَنَا عَبْدُ اللهِ بْنُ عُمَرَ بْنِ الْخَطَّابِ دَاخِلًا الْمَسْجِدَ، فَاكْتَنَفْتُهُ أَنَا وَصَاحِبِي أَحَدُنَا عَنْ يَمِينِهِ، وَالْآخَرُ عَنْ شِمَالِهِ، فَظَنَنْتُ أَنَّ صَاحِبِي سَيَكِلُ الْكَلَامَ إِلَيَّ، فَقُلْتُ [ص:37]: أَبَا عَبْدِ الرَّحْمَنِ إِنَّهُ قَدْ ظَهَرَ قِبَلَنَا نَاسٌ يَقْرَءُونَ الْقُرْآنَ، وَيَتَقَفَّرُونَ الْعِلْمَ، وَذَكَرَ مِنْ شَأْنِهِمْ، وَأَنَّهُمْ يَزْعُمُونَ أَنْ لَا قَدَرَ، وَأَنَّ الْأَمْرَ أُنُفٌ، قَالَ: «فَإِذَا لَقِيتَ أُولَئِكَ فَأَخْبِرْهُمْ أَنِّي بَرِيءٌ مِنْهُمْ، وَأَنَّهُمْ بُرَآءُ مِنِّي»، وَالَّذِي يَحْلِفُ بِهِ عَبْدُ اللهِ بْنُ عُمَرَ «لَوْ أَنَّ لِأَحَدِهِمْ مِثْلَ أُحُدٍ ذَهَبًا، فَأَنْفَقَهُ مَا قَبِلَ اللهُ مِنْهُ حَتَّى يُؤْمِنَ بِالْقَدَرِ» ثُمَّ قَالَ: حَدَّثَنِي أَبِي عُمَرُ بْنُ الْخَطَّابِ قَالَ: بَيْنَمَا نَحْنُ عِنْدَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ذَاتَ يَوْمٍ، إِذْ طَلَعَ عَلَيْنَا رَجُلٌ شَدِيدُ بَيَاضِ الثِّيَابِ، شَدِيدُ سَوَادِ الشَّعَرِ، لَا يُرَى عَلَيْهِ أَثَرُ السَّفَرِ، وَلَا يَعْرِفُهُ مِنَّا أَحَدٌ، حَتَّى جَلَسَ إِلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَأَسْنَدَ رُكْبَتَيْهِ إِلَى رُكْبَتَيْهِ، وَوَضَعَ كَفَّيْهِ عَلَى فَخِذَيْهِ، وَقَالَ: يَا مُحَمَّدُ أَخْبِرْنِي عَنِ الْإِسْلَامِ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الْإِسْلَامُ أَنْ تَشْهَدَ أَنْ لَا إِلَهَ إِلَّا اللهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَتُقِيمَ الصَّلَاةَ، وَتُؤْتِيَ الزَّكَاةَ، وَتَصُومَ رَمَضَانَ، وَتَحُجَّ الْبَيْتَ إِنِ اسْتَطَعْتَ إِلَيْهِ سَبِيلًا»، قَالَ: صَدَقْتَ، قَالَ: فَعَجِبْنَا لَهُ يَسْأَلُهُ، وَيُصَدِّقُهُ، قَالَ: فَأَخْبِرْنِي عَنِ الْإِيمَانِ، قَالَ: «أَنْ تُؤْمِنَ بِاللهِ، وَمَلَائِكَتِهِ، وَكُتُبِهِ، وَرُسُلِهِ، وَالْيَوْمِ الْآخِرِ، وَتُؤْمِنَ بِالْقَدَرِ خَيْرِهِ وَشَرِّهِ»، قَالَ: صَدَقْتَ، قَالَ: فَأَخْبِرْنِي عَنِ الْإِحْسَانِ، قَالَ: «أَنْ تَعْبُدَ اللهَ كَأَنَّكَ تَرَاهُ، فَإِنْ لَمْ تَكُنْ تَرَاهُ فَإِنَّهُ يَرَاكَ»، قَالَ: فَأَخْبِرْنِي عَنِ السَّاعَةِ، قَالَ: «مَا الْمَسْئُولُ عَنْهَا بِأَعْلَمَ مِنَ السَّائِلِ» قَالَ: فَأَخْبِرْنِي عَنْ أَمَارَتِهَا، قَالَ: «أَنْ تَلِدَ الْأَمَةُ رَبَّتَهَا، وَأَنْ تَرَى الْحُفَاةَ الْعُرَاةَ الْعَالَةَ رِعَاءَ الشَّاءِ يَتَطَاوَلُونَ فِي الْبُنْيَانِ»، قَالَ: ثُمَّ انْطَلَقَ فَلَبِثْتُ مَلِيًّا، ثُمَّ قَالَ لِي: «يَا عُمَرُ أَتَدْرِي مَنِ السَّائِلُ؟» قُلْتُ: اللهُ وَرَسُولُهُ أَعْلَمُ، قَالَ: «فَإِنَّهُ جِبْرِيلُ أَتَاكُمْ يُعَلِّمُكُمْ دِينَكُمْ»"
        },
        "chapter_id": "006fdc9d-f7c2-422c-9e4b-5175cfb5f764",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb Maʿrifat al-Īmān wa al-Islām wa al-Qadr wa ʿAlāmat al-Sāʿah"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab: Mengenal Iman, Islam, Qadar dan Petanda Kiamat",
          "ar": "بَابُ معرفة الْإِيمَانِ، وَالْإِسْلَامِ، والقَدَرِ وَعَلَامَةِ السَّاعَةِ"
        },
        "volume_id": "2ac64e58-56c5-4012-a0f2-5d619bbb637b",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": "Kitāb al-Īmān"
        },
        "volume_title": {
          "en": "",
          "ms": "Kitab al-Iman",
          "ar": "كِتَابُ الْإِيمَانَ"
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "e610b5e2-834a-4adc-b956-287721043947",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "2 – (8) Muhammad bin ‘Ubayd al-Ghubari, Abu Kamil al-Jahdari dan Ahmad bin ‘Abdah menyampaikan kepada saya, mereka berkata: Hammad bin Zayd menyampaikan kepada kami, daripada Mathar al-Warraq, daripada Abdullah bin Buraydah, daripada Yahya bin Ya‘mar, beliau berkata: Apabila Ma‘bad mula menyuarakan teorinya berkenaan al-Qadar, kami mengingkari teori tersebut. Kemudian saya dan Humayd bin Abdul Rahman al-Himyari pergi melaksanakan haji,... lalu mereka menyebutkan hadis yang semakna dengan riwayat Kahmas, dengan sedikit tambahan dan pengurangan pada teks.",
          "ar": "2 - (8) حَدَّثَنِي مُحَمَّدُ بْنُ عُبَيْدٍ الْغُبَرِيُّ، وَأَبُو كَامِلٍ الْجَحْدَرِيُّ، وَأَحْمَدُ بْنُ عَبْدَةَ قَالُوا: حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ مَطَرٍ الْوَرَّاقِ، عَنْ عَبْدِ اللهِ بْنِ بُرَيْدَةَ، عَنْ يَحْيَى بْنِ يَعْمَرَ، قَالَ: لَمَّا تَكَلَّمَ مَعْبَدٌ بِمَا تَكَلَّمَ بِهِ فِي شَأْنِ الْقَدَرِ أَنْكَرْنَا ذَلِكَ، قَالَ: فَحَجَجْتُ أَنَا وَحُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ الْحِمْيَرِيُّ حَجَّةً، وَسَاقُوا الْحَدِيثَ بِمَعْنَى حَدِيثِ كَهْمَسٍ وَإِسْنَادِهِ، وَفِيهِ بَعْضُ زِيَادَةٍ وَنُقْصَانُ أَحْرُفٍ."
        },
        "chapter_id": "006fdc9d-f7c2-422c-9e4b-5175cfb5f764",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb Maʿrifat al-Īmān wa al-Islām wa al-Qadr wa ʿAlāmat al-Sāʿah"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab: Mengenal Iman, Islam, Qadar dan Petanda Kiamat",
          "ar": "بَابُ معرفة الْإِيمَانِ، وَالْإِسْلَامِ، والقَدَرِ وَعَلَامَةِ السَّاعَةِ"
        },
        "volume_id": "2ac64e58-56c5-4012-a0f2-5d619bbb637b",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": "Kitāb al-Īmān"
        },
        "volume_title": {
          "en": "",
          "ms": "Kitab al-Iman",
          "ar": "كِتَابُ الْإِيمَانَ"
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "16fd0c09-61a6-4edd-b24e-978d00eec1b9",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "3 – (8) Muhammad bin Hatim menyampaikan kepada saya, beliau berkata: Yahya bin Sa’id al-Qaththan menyampaikan kepada kami, beliau berkata: ‘Utsman bin Ghiyats menyampaikan kepada kami, beliau berkata: Abdullah bin Buraydah menyampaikan kepada kami, daripada Yahya bin Ya‘mar dan Humayd bin Abdul Rahman, mereka berkata: Kami bertemu dengan Abdullah bin ‘Umar , lalu kami menyebut berkenaan Qadar dan teori Qadariyyah..., lalu Muhammad bin Hatim menyebutkan hadis yang sama sebelum ini, daripada ‘Umar , daripada Nabi ﷺ, dengan lafaz lebih kurang.",
          "ar": "3 - (8) وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ، حَدَّثَنَا عُثْمَانُ بْنُ غِيَاثٍ، حَدَّثَنَا عَبْدُ اللهِ بْنُ بُرَيْدَةَ، عَنْ يَحْيَى بْنِ يَعْمَرَ، وَحُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ قَالَا: لَقِينَا عَبْدَ اللهِ بْنَ عُمَرَ، فَذَكَرْنَا الْقَدَرَ، وَمَا يَقُولُونَ فِيهِ، فَاقْتَصَّ الْحَدِيثَ كَنَحْوِ حَدِيثِهِمْ، عَنْ عُمَرَ رَضِيَ اللهُ عَنْهُ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَفِيهِ شَيْءٌ مِنْ زِيَادَةٍ وَقَدْ نَقَصَ مِنْهُ شَيْئًا."
        },
        "chapter_id": "006fdc9d-f7c2-422c-9e4b-5175cfb5f764",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb Maʿrifat al-Īmān wa al-Islām wa al-Qadr wa ʿAlāmat al-Sāʿah"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab: Mengenal Iman, Islam, Qadar dan Petanda Kiamat",
          "ar": "بَابُ معرفة الْإِيمَانِ، وَالْإِسْلَامِ، والقَدَرِ وَعَلَامَةِ السَّاعَةِ"
        },
        "volume_id": "2ac64e58-56c5-4012-a0f2-5d619bbb637b",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": "Kitāb al-Īmān"
        },
        "volume_title": {
          "en": "",
          "ms": "Kitab al-Iman",
          "ar": "كِتَابُ الْإِيمَانَ"
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "b44265f9-632b-40a0-a9ad-2f2239206dfc",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "4 – (8) Hajjaj bin al-Sya‘ir menyampaikan kepada saya, beliau berkata: Yunus bin Muhammad menyampaikan kepada kami, beliau berkata: al-Mu‘tamir menyampaikan kepada kami, daripada bapanya, daripada Yahya bin Ya‘mar, daripada ibn ‘Umar, daripada ‘Umar, daripada Nabi ﷺ, dengan lafaz lebih kurang hadis-hadis sebelum ini.",
          "ar": "4 - (8) وحَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ، حَدَّثَنَا الْمُعْتَمِرُ، عَنْ أَبِيهِ، عَنْ يَحْيَى بْنِ يَعْمَرَ، عَنِ ابْنِ عُمَرَ، عَنْ عُمَرَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِ حَدِيثِهِمْ"
        },
        "chapter_id": "006fdc9d-f7c2-422c-9e4b-5175cfb5f764",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb Maʿrifat al-Īmān wa al-Islām wa al-Qadr wa ʿAlāmat al-Sāʿah"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab: Mengenal Iman, Islam, Qadar dan Petanda Kiamat",
          "ar": "بَابُ معرفة الْإِيمَانِ، وَالْإِسْلَامِ، والقَدَرِ وَعَلَامَةِ السَّاعَةِ"
        },
        "volume_id": "2ac64e58-56c5-4012-a0f2-5d619bbb637b",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": "Kitāb al-Īmān"
        },
        "volume_title": {
          "en": "",
          "ms": "Kitab al-Iman",
          "ar": "كِتَابُ الْإِيمَانَ"
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "c71d0dfa-351b-4c26-a6f1-2e115ba3306c",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "5 – (9) Abu Bakar bin Abu Syaybah dan Zuhayr bin Harb menyampaikan kepada kami, daripada ibn ‘Ulayyah , daripada Abu Hayyan, daripada Abu Zur‘ah bin ‘Amr bin Jarir, daripada Abu Hurayrah , beliau berkata: Suatu hari, ketika Nabi ﷺ keluar untuk bertemu masyarakat, seorang lelaki mendekati baginda bertanya, “Wahai Rasulullah, apakah itu iman?” Baginda menjawab, “Iman itu kamu beriman dengan Allah, para malaikat-Nya, kitab-Nya, pertemuan dengan-Nya, para rasul-Nya, dan kamu beriman dengan kebangkitan terakhir.” \n\nDia bertanya lagi, “Wahai Rasulullah, apakah itu Islam?” Baginda menjawab, “Islam itu, kamu menyembah Allah dan tidak mensyirikkan-Nya sedikit pun, kamu mendirikan solat yang wajib, membayar zakat yang wajib, dan puasa Ramadan.” \n\nLelaki itu bertanya lagi, “Wahai Rasulullah, apakah itu Ihsan?” Baginda menjawab, “Ihsan itu keadaanmu menyembah Allah seakan-akan kamu melihat-Nya. Jika tidak mampu sedemikian, maka Dia sentiasa melihatmu.”\n\nLelaki itu bertanya lagi, “Wahai Rasulullah, bilakah hari Kiamat?” Baginda menjawab, “Kamu tidak tahu, saya lagilah tidak. Tetapi saya akan beritahu kamu tentang tanda-tandanya: Apabila hamba wanita mula melahirkan tuannya, itulah petanda Kiamat. Apabila kaum yang berbogel, berkaki ayam, mula menjadi pemimpin, itu petanda Kiamat. Apabila pengembala kambing berlumba-lumba meninggikan bangunan, itulah petandanya.” \n\nBaginda bersabda lagi, “Ada lima perkara yang tidak diketahui sesiapa selain Allah,” kemudian baginda membaca firman Allah, “Sesungguhnya di sisi Allah pengetahuan yang tepat tentang hari kiamat. Dan Dia lah jua yang menurunkan hujan, dan yang mengetahui dengan sebenar-benarnya tentang apa yang ada dalam rahim (ibu yang mengandung). Dan tiada seseorang pun yang betul mengetahui apa yang akan diusahakannya esok (sama ada baik atau jahat); dan tiada seorangpun yang dapat mengetahui di bumi negeri manakah ia akan mati. Sesungguhnya Allah Maha Mengetahui, lagi Amat Meliputi pengetahuan-Nya.”\n\nKemudian lelaki itu berlalu pergi. Baginda meminta agar para sahabatnya memanggil semula, namun mereka tidak menemuinya setelah mencuba. Lalu Rasulullah ﷺ menjelaskan, “Itu adalah Jibrail, datang untuk mengajar manusia tentang agama mereka.”",
          "ar": "5 - (9) وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، جَمِيعًا عَنِ ابْنِ عُلَيَّةَ، قَالَ زُهَيْرٌ: حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ أَبِي حَيَّانَ، عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَوْمًا بَارِزًا لِلنَّاسِ، فَأَتَاهُ رَجُلٌ، فَقَالَ: يَا رَسُولُ اللهِ، مَا الْإِيمَانُ؟ قَالَ: «أَنْ تُؤْمِنَ بِاللهِ، وَمَلَائِكَتِهِ، وَكِتَابِهِ، وَلِقَائِهِ، وَرُسُلِهِ، وَتُؤْمِنَ بِالْبَعْثِ الْآخِرِ»، قَالَ: يَا رَسُولَ اللهِ، مَا الْإِسْلَامُ؟ قَالَ: «الْإِسْلَامُ أَنْ تَعْبُدَ اللهَ، وَلَا تُشْرِكَ بِهِ شَيْئًا، وَتُقِيمَ الصَّلَاةَ الْمَكْتُوبَةَ، وَتُؤَدِّيَ الزَّكَاةَ الْمَفْرُوضَةَ، وَتَصُومَ رَمَضَانَ» قَالَ: يَا رَسُولَ اللهِ، مَا الْإِحْسَانُ؟ قَالَ: «أَنْ تَعْبُدَ اللهَ كَأَنَّكَ تَرَاهُ، فَإِنَّكَ إِنْ لَا تَرَاهُ فَإِنَّهُ يَرَاكَ»، قَالَ: يَا رَسُولَ اللهَ، مَتَى السَّاعَةُ؟ قَالَ: \" مَا الْمَسْئُولُ عَنْهَا بِأَعْلَمَ مِنَ السَّائِلِ، وَلَكِنْ سَأُحَدِّثُكَ عَنْ أَشْرَاطِهَا: إِذَا وَلَدَتِ الْأَمَةُ رَبَّهَا، فَذَاكَ مِنْ أَشْرَاطِهَا، وَإِذَا كَانَتِ الْعُرَاةُ الْحُفَاةُ رُءُوسَ النَّاسِ، فَذَاكَ مِنْ أَشْرَاطِهَا، وَإِذَا تَطَاوَلَ رِعَاءُ الْبَهْمِ فِي الْبُنْيَانِ، فَذَاكَ مِنْ أَشْرَاطِهَا فِي خَمْسٍ لَا يَعْلَمُهُنَّ إِلَّا اللهُ، ثُمَّ تَلَا صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: ﴿إِنَّ ٱللَّهَ عِندَهُۥ عِلۡمُ ٱلسَّاعَةِ وَيُنَزِّلُ ٱلۡغَيۡثَ وَيَعۡلَمُ مَا فِي ٱلۡأَرۡحَامِۖ وَمَا تَدۡرِي نَفۡسٞ مَّاذَا تَكۡسِبُ غَدٗاۖ وَمَا تَدۡرِي نَفۡسُۢ بِأَيِّ أَرۡضٖ تَمُوتُۚ إِنَّ ٱللَّهَ عَلِيمٌ خَبِيرُۢ٣٤﴾ [لقمان: 34] قَالَ: ثُمَّ أَدْبَرَ الرَّجُلُ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «رُدُّوا عَلَيَّ الرَّجُلَ»، فَأَخَذُوا لِيَرُدُّوهُ، فَلَمْ يَرَوْا شَيْئًا، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «هَذَا جِبْرِيلُ جَاءَ لِيُعَلِّمَ النَّاسَ دِينَهُمْ»"
        },
        "chapter_id": "6cf4af83-9d6d-4cb8-8d12-cad54f290447",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb al-Īmān Mā Huwa wa Bayān Khiṣālihi"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab: Apakah Itu Iman dan Ciri-cirinya",
          "ar": "بَابٌ: الْإِيمَانُ مَا هُوَ وَبَيَانُ خِصَالِهِ"
        },
        "volume_id": "2ac64e58-56c5-4012-a0f2-5d619bbb637b",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": "Kitāb al-Īmān"
        },
        "volume_title": {
          "en": "",
          "ms": "Kitab al-Iman",
          "ar": "كِتَابُ الْإِيمَانَ"
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "1a169a62-fa91-4eba-8226-c947b413482a",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "6 – (9) Muhammad bin Abdullah bin Numayr menyampaikan kepada kami, beliau berkata: Muhammad bin Bisyr menyampaikan kepada kami, beliau berkata: Abu Hayyan al-Taymi menyampaikan kepada kami, beliau berkata: dengan lanjutan sanad yang sama seperti sebelum, cuma dalam lafaznya, “Apabila hamba melahirkan suaminya,” merujuk kepada para gundik.",
          "ar": "6 - (9) حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، حَدَّثَنَا أَبُو حَيَّانَ التَّيْمِيُّ، بِهَذَا الْإِسْنَادِ مِثْلَهُ، غَيْرَ أَنَّ فِي رِوَايَتِهِ: «إِذَا وَلَدَتِ الْأَمَةُ بَعْلَهَا» يَعْنِي السَّرَارِيَّ"
        },
        "chapter_id": "6cf4af83-9d6d-4cb8-8d12-cad54f290447",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb al-Īmān Mā Huwa wa Bayān Khiṣālihi"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab: Apakah Itu Iman dan Ciri-cirinya",
          "ar": "بَابٌ: الْإِيمَانُ مَا هُوَ وَبَيَانُ خِصَالِهِ"
        },
        "volume_id": "2ac64e58-56c5-4012-a0f2-5d619bbb637b",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": "Kitāb al-Īmān"
        },
        "volume_title": {
          "en": "",
          "ms": "Kitab al-Iman",
          "ar": "كِتَابُ الْإِيمَانَ"
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "0683c8ec-31d7-4cfb-9edc-f7c6bde76ef1",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "7 – (10) Zuhayr bin Harb menyampaikan kepada kami, beliau berkata: Jarir menyampaikan kepada kami, daripada ‘Umarah bin al-Qa‘qa‘, daripada Abu Zur‘ah, daripada Abu Hurayrah , beliau berkata: Rasulullah ﷺ bersabda, “Tanyalah saya sesuatu.” Namun para sahabat berasa segan untuk bertanya. Tiba-tiba seorang lelaki datang dan duduk berlaga lutut dengan baginda. Dia bertanya, “Wahai Rasulullah, apakah itu Islam?” Baginda menjawab, “Kamu tidak mensyirikkan Allah dengan apa-apa, kamu mendirikan solat, membayar zakat, dan berpuasa Ramadan.” Lelaki itu berkata, “Kamu betul.”\n\nDia bertanya lagi, “Wahai Rasulullah, apakah itu Iman?” Baginda menjawab, “kamu beriman dengan Allah, malaikat-Nya, Kitab-Nya, pertemuan dengan-Nya, para utusan-Nya, dan kamu beriman dengan kebangkitan semula serta Qadar pada setiap perkara.” Lelaki itu berkata, “Kamu betul.”\n\nDia bertanya lagi, “Wahai Rasulullah, apakah itu Ihsan?” Baginda menjawab, “Kamu takut Allah seperti kamu melihat-Nya, sekiranya tidak mampu maka Dia pasti melihatmu.” Lelaki itu berkata, “Kamu betul.” \n\nLelaki itu bertanya lagi, “Wahai Rasulullah, bilakah hari Kiamat?” Baginda menjawab, “Kamu tidak tahu, saya lagilah tidak. Tetapi saya akan beritahu kamu tentang tanda-tandanya: Apabila wanita mula melahirkan tuannya, itulah petanda Kiamat. Apabila kaum yang berbogel, berkaki ayam, bisu dan pekak, mula menjadi pemimpin, itu petanda Kiamat. Apabila pengembala kambing berlumba-lumba meninggikan bangunan, itulah petandanya.” \n\nBaginda bersabda lagi, “Ada lima perkara yang tidak diketahui sesiapa selain Allah,” kemudian baginda membaca firman Allah, “Sesungguhnya di sisi Allah pengetahuan yang tepat tentang hari kiamat. Dan Dia lah jua yang menurunkan hujan, dan yang mengetahui dengan sebenar-benarnya tentang apa yang ada dalam rahim (ibu yang mengandung). Dan tiada seseorang pun yang betul mengetahui apa yang akan diusahakannya esok (sama ada baik atau jahat); dan tiada seorangpun yang dapat mengetahui di bumi negeri manakah ia akan mati. Sesungguhnya Allah Maha Mengetahui, lagi Amat Meliputi pengetahuan-Nya.”\n\nKemudian lelaki itu berlalu pergi. Baginda meminta agar para sahabatnya memanggil semula, namun mereka tidak menemuinya setelah mencuba. Lalu Rasulullah ﷺ menjelaskan, “Itu adalah Jibrail, dia mahu kalian mengajar kerana kalian tidak mahu bertanya.”",
          "ar": "7 - (10) حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ عُمَارَةَ وَهُوَ ابْنُ الْقَعْقَاعِ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «سَلُونِي»، فَهَابُوهُ أَنْ يَسْأَلُوهُ، فَجَاءَ رَجُلٌ، فَجَلَسَ عِنْدَ رُكْبَتَيْهِ، فَقَالَ: يَا رَسُولَ اللهِ، مَا الْإِسْلَامُ؟ قَالَ: «لَا تُشْرِكُ بِاللهِ شَيْئًا، وَتُقِيمُ الصَّلَاةَ، وَتُؤْتِي الزَّكَاةَ، وَتَصُومُ رَمَضَانَ»، قَالَ: صَدَقْتَ، قَالَ: يَا رَسُولَ اللهِ، مَا الْإِيمَانُ؟ قَالَ: «أَنْ تُؤْمِنَ بِاللهِ، وَمَلَائِكَتِهِ، وَكِتَابِهِ، وَلِقَائِهِ، وَرُسُلِهِ، وَتُؤْمِنَ بِالْبَعْثِ، وَتُؤْمِنَ بِالْقَدَرِ كُلِّهِ»، قَالَ: صَدَقْتَ، قَالَ: يَا رَسُولَ اللهِ، مَا الْإِحْسَانُ؟ قَالَ: «أَنْ تَخْشَى اللهَ كَأَنَّكَ تَرَاهُ، فَإِنَّكَ إِنْ لَا تَكُنْ تَرَاهُ فَإِنَّهُ يَرَاكَ»، قَالَ: صَدَقْتَ. قَالَ: يَا رَسُولَ اللهِ، مَتَى تَقُومُ السَّاعَةُ؟ قَالَ: \" مَا الْمَسْئُولُ عَنْهَا بِأَعْلَمَ مِنَ السَّائِلِ، وَسَأُحَدِّثُكَ عَنْ أَشْرَاطِهَا: إِذَا رَأَيْتَ الْمَرْأَةَ تَلِدُ رَبَّهَا، فَذَاكَ مِنْ أَشْرَاطِهَا، وَإِذَا رَأَيْتَ الْحُفَاةَ الْعُرَاةَ الصُّمَّ الْبُكْمَ مُلُوكَ الْأَرْضِ، فَذَاكَ مِنْ أَشْرَاطِهَا، وَإِذَا رَأَيْتَ رِعَاءَ الْبَهْمِ يَتَطَاوَلُونَ فِي الْبُنْيَانِ، فَذَاكَ مِنْ أَشْرَاطِهَا فِي خَمْسٍ مِنَ الْغَيْبِ لَا يَعْلَمُهُنَّ إِلَّا اللهُ \"، ثُمَّ قَرَأَ: {إِنَّ اللهَ عِنْدَهُ عِلْمُ السَّاعَةِ وَيُنَزِّلُ الْغَيْثَ وَيَعْلَمُ مَا فِي الْأَرْحَامِ وَمَا تَدْرِي نَفْسٌ مَاذَا تَكْسِبُ غَدًا وَمَا تَدْرِي نَفْسٌ بِأَيِّ أَرْضٍ تَمُوتُ إِنَّ اللهِ عَلِيمٌ خَبِيرٌ} [لقمان: 34] قَالَ: ثُمَّ قَامَ الرَّجُلُ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «رُدُّوهُ عَلَيَّ»، فَالْتُمِسَ، فَلَمْ يَجِدُوهُ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «هَذَا جِبْرِيلُ، أَرَادَ أَنْ تَعَلَّمُوا إِذْ لَمْ تَسْأَلُوا»"
        },
        "chapter_id": "d3c4505f-a68d-4d9c-abf8-cd2f8e13b677",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb al-Islām Mā Huwa wa Bayān Khiṣālihi"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab Apakah Itu Islam dan Ciri-cirinya?",
          "ar": "بَابُ الْإِسْلَامِ مَا هُوَ وَبَيَانُ خِصَالِهِ"
        },
        "volume_id": "2ac64e58-56c5-4012-a0f2-5d619bbb637b",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": "Kitāb al-Īmān"
        },
        "volume_title": {
          "en": "",
          "ms": "Kitab al-Iman",
          "ar": "كِتَابُ الْإِيمَانَ"
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "212eb9c9-9ca4-4451-82bc-b66d638d994b",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "9 – (11) Yahya bin Ayyub dan Qutaybah bin Sa’id menyampaikan kepada saya, mereka meriwayatkan daripada Isma‘il bin Jaafar, daripada Abu Suhayl, daripada bapanya, daripada Thalhah bin ‘Ubaydullah, daripada Nabi ﷺ, dengan hadis yang sama seperti riwayat Malik; hanya saja ada tambahan, “Jika dia jujur, demi bapanya, pasti dia berjaya.” Atau “Jika dia jujur, demi bapanya, pasti dia masuk syurga.”",
          "ar": "9 - (11) حَدَّثَنِي يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، جَمِيعًا عَنْ إِسْمَاعِيلَ بْنِ جَعْفَرٍ، عَنْ أَبِي سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ طَلْحَةَ بْنِ عُبَيْدِ اللهِ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِهَذَا الْحَدِيثِ نَحْوَ حَدِيثِ مَالِكٍ، غَيْرَ أَنَّهُ قَالَ: فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَفْلَحَ، وَأَبِيهِ إِنْ صَدَقَ، أَوْ دَخَلَ الْجَنَّةَ وَأَبِيهِ إِنْ صَدَقَ»"
        },
        "chapter_id": "d3c4505f-a68d-4d9c-abf8-cd2f8e13b677",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb Bayān al-Ṣalawāt Allatī Hiya Aḥad Arkān al-Islām"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab Penjelasan Solat yang Merupakan Salah Satu Rukun Islam",
          "ar": "بَابُ بَيَانِ الصَّلَوَاتِ الَّتِي هِيَ أَحَدُ أَرْكَانِ الْإِسْلَامِ"
        },
        "volume_id": "2ac64e58-56c5-4012-a0f2-5d619bbb637b",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": "Kitāb al-Īmān"
        },
        "volume_title": {
          "en": "",
          "ms": "Kitab al-Iman",
          "ar": "كِتَابُ الْإِيمَانَ"
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
      },
      {
        "id": "9857e88d-f284-405e-9ce0-5a98fd63ee1c",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "8 – (11) Qutaybah bin Sa‘id bin Jamil bin Tharif bin Abdullah al-Tsaqafi menyampaikan kepada kami, daripada Malik bin Anas sebagaimana yang dibacakan kepadanya, daripada Abu Suhayl, daripada bapanya, beliau mendengar Thalhah bin ‘Ubaydullah berkata: \"Datang seorang lelaki dari kawasan tinggi, rambutnya terpacak-pacak, datang kepada Rasulullah ﷺ. Kami dapat mendengar gumaman suaranya, namun kami tidak memahami perkataan yang dia ucapkan, sehingga dia mendekat dengan Rasulullah ﷺ.\n\nRupanya dia bertanya tentang Islam. Maka Rasulullah ﷺ menjawab: “Islam adalah solat lima waktu sehari semalam.” Dia bertanya lagi, “Apakah ada [solat] wajib selain itu?” Baginda menjawab, “Selain solat sunat, tiada. Dan kamu juga wajib berpuasa Ramadan.” Dia bertanya, “Apakah ada [puasa] lain yang saya wajib lakukan?” Baginda menjawab, “Selain puasa sunat, tiada.” Kemudian baginda menyebutkan kewajipan zakat harta. Lelaki itu bertanya, “Apakah ada sedekah lain yang saya wajib tunaikan?” Baginda menjawab, “Selain sedekah sunat, tiada.”\n\nKemudian lelaki tersebut mengundur diri seraya berkata, “Demi Allah, saya tidak akan menambah daripada [syariat-syariat] ini, dan tidak akan menguranginya sedikit pun.” Baginda bersabda, “Jika dia jujur, pasti dia berjaya.”",
          "ar": "8 - (11) حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدِ بْنِ جَمِيلِ بْنِ طَرِيفِ بْنِ عَبْدِ اللهِ الثَّقَفِيُّ، عَنْ مَالِكِ بْنِ أَنَسٍ فِيمَا قُرِئَ عَلَيْهِ عَنْ أَبِي سُهَيْلٍ، عَنْ أَبِيهِ، أَنَّهُ سَمِعَ طَلْحَةَ بْنَ عُبَيْدِ اللهِ، يَقُولُ: جَاءَ رَجُلٌ إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِنْ أَهْلِ نَجْدٍ ثَائِرُ الرَّأْسِ، نَسْمَعُ دَوِيَّ صَوْتِهِ، وَلَا نَفْقَهُ مَا يَقُولُ حَتَّى دَنَا مِنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَإِذَا هُوَ يَسْأَلُ عَنِ الْإِسْلَامِ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «خَمْسُ صَلَوَاتٍ فِي الْيَوْمِ، وَاللَّيْلَةِ» فَقَالَ: هَلْ عَلَيَّ غَيْرُهُنَّ؟ قَالَ: «لَا، إِلَّا أَنْ تَطَّوَّعَ، وَصِيَامُ شَهْرِ رَمَضَانَ»، فَقَالَ: هَلْ عَلَيَّ غَيْرُهُ؟ فَقَالَ: «لَا، إِلَّا أَنْ تَطَّوَّعَ»، وَذَكَرَ لَهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ الزَّكَاةَ، فَقَالَ: هَلْ عَلَيَّ غَيْرُهَا؟ قَالَ: «لَا، إِلَّا أَنْ تَطَّوَّعَ»، قَالَ: فَأَدْبَرَ الرَّجُلُ، وَهُوَ يَقُولُ: وَاللهِ، لَا أَزِيدُ عَلَى هَذَا، وَلَا أَنْقُصُ مِنْهُ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَفْلَحَ إِنْ صَدَقَ»"
        },
        "chapter_id": "",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb Bayān al-Ṣalawāt Allatī Hiya Aḥad Arkān al-Islām"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab Penjelasan Solat yang Merupakan Salah Satu Rukun Islam",
          "ar": "بَابُ بَيَانِ الصَّلَوَاتِ الَّتِي هِيَ أَحَدُ أَرْكَانِ الْإِسْلَامِ"
        },
        "volume_id": "2ac64e58-56c5-4012-a0f2-5d619bbb637b",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": "Kitāb al-Īmān"
        },
        "volume_title": {
          "en": "",
          "ms": "Kitab al-Iman",
          "ar": "كِتَابُ الْإِيمَانَ"
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
    },
    {
        "id": "4e77ecaf-2229-4439-943f-82befde2f981",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "8 – (11) Qutaybah bin Sa‘id bin Jamil bin Tharif bin Abdullah al-Tsaqafi menyampaikan kepada kami, daripada Malik bin Anas sebagaimana yang dibacakan kepadanya, daripada Abu Suhayl, daripada bapanya, beliau mendengar Thalhah bin ‘Ubaydullah berkata: \"Datang seorang lelaki dari kawasan tinggi, rambutnya terpacak-pacak, datang kepada Rasulullah ﷺ. Kami dapat mendengar gumaman suaranya, namun kami tidak memahami perkataan yang dia ucapkan, sehingga dia mendekat dengan Rasulullah ﷺ.\n\nRupanya dia bertanya tentang Islam. Maka Rasulullah ﷺ menjawab: “Islam adalah solat lima waktu sehari semalam.” Dia bertanya lagi, “Apakah ada [solat] wajib selain itu?” Baginda menjawab, “Selain solat sunat, tiada. Dan kamu juga wajib berpuasa Ramadan.” Dia bertanya, “Apakah ada [puasa] lain yang saya wajib lakukan?” Baginda menjawab, “Selain puasa sunat, tiada.” Kemudian baginda menyebutkan kewajipan zakat harta. Lelaki itu bertanya, “Apakah ada sedekah lain yang saya wajib tunaikan?” Baginda menjawab, “Selain sedekah sunat, tiada.”\n\nKemudian lelaki tersebut mengundur diri seraya berkata, “Demi Allah, saya tidak akan menambah daripada [syariat-syariat] ini, dan tidak akan menguranginya sedikit pun.” Baginda bersabda, “Jika dia jujur, pasti dia berjaya.”",
          "ar": "8 - (11) حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدِ بْنِ جَمِيلِ بْنِ طَرِيفِ بْنِ عَبْدِ اللهِ الثَّقَفِيُّ، عَنْ مَالِكِ بْنِ أَنَسٍ فِيمَا قُرِئَ عَلَيْهِ عَنْ أَبِي سُهَيْلٍ، عَنْ أَبِيهِ، أَنَّهُ سَمِعَ طَلْحَةَ بْنَ عُبَيْدِ اللهِ، يَقُولُ: جَاءَ رَجُلٌ إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِنْ أَهْلِ نَجْدٍ ثَائِرُ الرَّأْسِ، نَسْمَعُ دَوِيَّ صَوْتِهِ، وَلَا نَفْقَهُ مَا يَقُولُ حَتَّى دَنَا مِنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَإِذَا هُوَ يَسْأَلُ عَنِ الْإِسْلَامِ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «خَمْسُ صَلَوَاتٍ فِي الْيَوْمِ، وَاللَّيْلَةِ» فَقَالَ: هَلْ عَلَيَّ غَيْرُهُنَّ؟ قَالَ: «لَا، إِلَّا أَنْ تَطَّوَّعَ، وَصِيَامُ شَهْرِ رَمَضَانَ»، فَقَالَ: هَلْ عَلَيَّ غَيْرُهُ؟ فَقَالَ: «لَا، إِلَّا أَنْ تَطَّوَّعَ»، وَذَكَرَ لَهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ الزَّكَاةَ، فَقَالَ: هَلْ عَلَيَّ غَيْرُهَا؟ قَالَ: «لَا، إِلَّا أَنْ تَطَّوَّعَ»، قَالَ: فَأَدْبَرَ الرَّجُلُ، وَهُوَ يَقُولُ: وَاللهِ، لَا أَزِيدُ عَلَى هَذَا، وَلَا أَنْقُصُ مِنْهُ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَفْلَحَ إِنْ صَدَقَ»"
        },
        "chapter_id": "",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb Bayān al-Ṣalawāt Allatī Hiya Aḥad Arkān al-Islām"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab Penjelasan Solat yang Merupakan Salah Satu Rukun Islam",
          "ar": "بَابُ بَيَانِ الصَّلَوَاتِ الَّتِي هِيَ أَحَدُ أَرْكَانِ الْإِسْلَامِ"
        },
        "volume_id": "2ac64e58-56c5-4012-a0f2-5d619bbb637b",
        "volume_name": "",
        "volume_transliteration": {
          "en": "",
          "ms": "Kitāb al-Īmān"
        },
        "volume_title": {
          "en": "",
          "ms": "Kitab al-Iman",
          "ar": "كِتَابُ الْإِيمَانَ"
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
    },
    {
        "id": "4e77ecaf-2229-4439-943f-82befde2f981",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "1 – (1960) Ahmad bin Yunus menyampaikan kepada kami, katanya, Zuhayr menyampaikan kepada kami, katanya, al-Aswad bin Qays menyampaikan kepada kami. \n\nYahya bin Yahya menyampaikan kepada kami, Abu Khaytsamah mengkhabarkan kepada kami, katanya, daripada al-Aswad bin Qais, Jundab bin Sufyan menyampaikan kepadaku, dia berkata, “Saya hadir solat hari raya Aidiladha bersama Rasulullah ﷺ, tidak lama setelah selesai solat, baginda melihat daging korban yang telah disembelih, maka baginda bersabda, “Sesiapa yang menyembelih haiwan korban sebelum solat, hendaklah dia mengulanginya sebagai ganti. Dan sesiapa yang belum menyembelih, hendaklah dia menyembelih dengan menyebut nama Allah.”",
          "ar": "1 - (1960) حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا الْأَسْوَدُ بْنُ قَيْسٍ، ح وَحَدَّثَنَاهُ يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو خَيْثَمَةَ، عَنِ الْأَسْوَدِ بْنِ قَيْسٍ، حَدَّثَنِي جُنْدَبُ بْنُ سُفْيَانَ، قَالَ: شَهِدْتُ الْأَضْحَى مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَلَمْ يَعْدُ أَنْ صَلَّى وَفَرَغَ مِنْ صَلَاتِهِ سَلَّمَ، فَإِذَا هُوَ يَرَى لَحْمَ أَضَاحِيَّ قَدْ ذُبِحَتْ قَبْلَ أَنْ يَفْرُغَ مِنْ صَلَاتِهِ، فَقَالَ: «مَنْ كَانَ ذَبَحَ أُضْحِيَّتَهُ قَبْلَ أَنْ يُصَلِّيَ - أَوْ نُصَلِّيَ -، فَلْيَذْبَحْ مَكَانَهَا أُخْرَى، وَمَنْ كَانَ لَمْ يَذْبَحْ، فَلْيَذْبَحْ بِاسْمِ اللهِ»"
        },
        "chapter_id": "6dc3486c-2444-4766-8198-670e6e13c317",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb Waqtihā"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab Waktunya",
          "ar": "بَابُ وَقْتِهَا"
        },
        "volume_id": "aea05500-85ea-423e-b18c-fbbc5473b1d2",
        "volume_name": "",
        "volume_transliteration": {
			"en": "",
			"ms": "KITĀB AL-AḌĀḤĪ"
        },
        "volume_title": {
          "en": "",
          "ms": "KITAB HAIWAN KORBAN",
          "ar": "كتاب الْأَضَاحِيِّ"
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
    },
    {
        "id": "dddefbbb-f90c-4712-8730-ed27bd4011c8",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "2 – (1960) Abu Bakar bin Abu Syaybah menyampaikan kepada kami, katanya, Abu al-Ahwash Sallam bin Sulaym menyampaikan kepada kami, katanya, daripada al-Aswad bin Qays, daripada Jundab bin Sufyan, dia berkata, “Saya hadir solat hari raya Aidiladha bersama Rasulullah ﷺ. Setelah baginda selesai solat bersama orang ramai, baginda melihat ada seekor kambing yang telah disembelih, lantas baginda bersabda: “Sesiapa yang menyembelih sebelum solat, hendaklah dia mengulangi sembelihannya lagi sebagai pengganti. Dan sesiapa yang belum menyembelih, hendaklah dia menyembelih dengan nama Allah.”",
          "ar": "2 - (1960) وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو الْأَحْوَصِ سَلَّامُ بْنُ سُلَيْمٍ، عَنِ الْأَسْوَدِ بْنِ قَيْسٍ، عَنْ جُنْدَبِ بْنِ سُفْيَانَ، قَالَ: شَهِدْتُ الْأَضْحَى مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَلَمَّا قَضَى صَلَاتَهُ بِالنَّاسِ نَظَرَ إِلَى غَنَمٍ قَدْ ذُبِحَتْ، فَقَالَ: «مَنْ ذَبَحَ قَبْلَ الصَّلَاةِ، فَلْيَذْبَحْ شَاةً مَكَانَهَا، وَمَنْ لَمْ يَكُنْ ذَبَحَ، فَلْيَذْبَحْ عَلَى اسْمِ اللهِ»،"
        },
        "chapter_id": "6dc3486c-2444-4766-8198-670e6e13c317",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb Waqtihā"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab Waktunya",
          "ar": "بَابُ وَقْتِهَا"
        },
        "volume_id": "aea05500-85ea-423e-b18c-fbbc5473b1d2",
        "volume_name": "",
        "volume_transliteration": {
			"en": "",
			"ms": "KITĀB AL-AḌĀḤĪ"
        },
        "volume_title": {
          "en": "",
          "ms": "KITAB HAIWAN KORBAN",
          "ar": "كتاب الْأَضَاحِيِّ"
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
    },
    {
        "id": "50521f0e-4697-4185-b99d-8f49f29b3c45",
        "footnotes": [],
        "number": "",
        "content": {
            "en": "",
            "ms": "1 – (2065) Yahya bin Yahya menyampaikan kepada kami, beliau berkata, “Aku membacakan kepada Malik, daripada Nafi’, daripada Zayd bin ‘Abdullah, daripada ‘Abdullah bin ‘Abd al-Rahman bin Abu Bakar al-Shiddiq, daripada Ummu Salamah iaitu isteri Nabi ﷺ bahawa Rasulullah ﷺ bersabda, “Orang yang minum menggunakan bekas perak sebenarnya dia memarakkan api neraka jahanam di dalam perutnya.”",
            "ar": "1 - (2065) حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ نَافِعٍ، عَنْ زَيْدِ بْنِ عَبْدِ اللهِ، عَنْ عَبْدِ اللهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ الصِّدِّيقِ، عَنْ أُمِّ سَلَمَةَ، زَوْجِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الَّذِي يَشْرَبُ فِي آنِيَةِ الْفِضَّةِ، إِنَّمَا يُجَرْجِرُ فِي بَطْنِهِ نَارَ جَهَنَّمَ»."
          },
        "chapter_id": "afbac2bc-374e-4693-95de-2d6380ccbc22",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb Taḥrīm Istiʿmāl Awānī al-Dhahab wa al-Fiḍḍah fī al-Shurb wa Ghayrihi ʿalā al-Rijāl wa al-Nisāʾ"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab Pengharaman Penggunaan Bekas-Bekas Daripada Emas Dan Perak Untuk Minum Dan Selainnya Bagi Lelaki Dan Wanita",
          "ar": "َابُ تَحْرِيمِ اسْتِعْمَالِ أَوَانِي الذَّهَبِ وَالْفِضَّةِ فِي الشُّرْبِ وَغَيْرِهِ عَلَى الرِّجَالِ وَالنِّسَاءِ"
        },
        "volume_id": "38e6e1bc-4366-4699-8a31-734dad119ffc",
        "volume_name": "",
        "volume_transliteration": {
			"en": "",
			"ms": "KITĀB AL-LIBĀS WA AL-ZĪNAH"
        },
        "volume_title": {
			"en": "",
			"ms": "KITAB PAKAIAN DAN PERHIASAN",
			"ar": "كتاب اللِّبَاسِ وَالزِّينَةِ"
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
    },
    {
        "id": "50521f0e-4697-4185-b99d-8f49f29b3c45",
        "footnotes": [],
        "number": "",
        "content": {
          "en": "",
          "ms": "(2065) – Qutaybah dan Muhammad bin Rumh menyampaikannya kepada kami, daripada al-Layts bin Sa’ad. (Dalam sanad lain) ‘Ali bin Hujr al-Sa’di menyampaikannya kepadaku, Ismail bin ‘Ulayyah menyampaikan kepada kami, daripada Ayyub. (Dalam sanad lain) Ibn Numayr menyampaikan kepada kami, Muhammad bin Bisyr menyampaikan kepada kami. (Dalam sanad lain) Muhammad bin al-Mutsanna menyampaikan kepada kami, Yahya bin Sa’id menyampaikan kepada kami. (Dalam sanad lain) Abu Bakar bin Abu Syaybah dan al-Walid bin Syuja’ menyampaikan kepada kami, mereka berdua berkata, “’Ali bin Mushir menyampaikan kepada kami, daripada ‘Ubaydullah. (Dalam sanad lain) Muhammad bin Abu Bakar al-Muqaddami menyampaikan kepada kami, al-Fudhayl bin Sulayman menyampaikan kepada kami, Musa bin ‘Uqbah menyampaikan kepada kami. (Dalam sanad lain) Syayban bin Farrukh menyampaikan kepada kami, Jarir bin Hazim menyampaikan kepada kami, daripada ‘Abd al-Rahman al-Sarraj. Mereka semuanya meriwayatkan daripada Nafi’ sama dengan hadits riwayat Malik bin Anas, dengan sanadnya daripada Nafi’. Dan perawi menambah pada hadits ‘Ali bin Mushir, daripada ‘Ubaydullah, “Bahawa orang yang makan dan minum dalam bekas perak dan emas…” Tiada satu pun dalam hadits mereka sebutan tentang makan dan emas melainkan pada hadits riwayat Ibn Mushir.",
          "ar": "(2065) - وَحَدَّثَنَاهُ قُتَيْبَةُ، وَمُحَمَّدُ بْنُ رُمْحٍ، عَنِ اللَّيْثِ بْنِ سَعْدٍ، ح وحَدَّثَنِيهِ عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ، حَدَّثَنَا إِسْمَاعِيلُ يَعْنِي ابْنَ عُلَيَّةَ، عَنْ أَيُّوبَ، ح وحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، ح وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَالْوَلِيدُ بْنُ شُجَاعٍ، قَالَا: حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ عُبَيْدِ اللهِ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، حَدَّثَنَا الْفُضَيْلُ بْنُ سُلَيْمَانَ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، ح وحَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا جَرِيرٌ يَعْنِي ابْنَ حَازِمٍ، عَنْ عَبْدِ الرَّحْمَنِ السَّرَّاجِ، كُلُّ هَؤُلَاءِ عَنْ نَافِعٍ، بِمِثْلِ حَدِيثِ مَالِكِ بْنِ أَنَسٍ، بِإِسْنَادِهِ عَنْ نَافِعٍ، وَزَادَ فِي حَدِيثِ عَلِيِّ بْنِ مُسْهِرٍ، عَنْ عُبَيْدِ اللهِ، أَنَّ الَّذِي يَأْكُلُ أَوْ يَشْرَبُ فِي آنِيَةِ الْفِضَّةِ وَالذَّهَبِ، وَلَيْسَ فِي حَدِيثِ أَحَدٍ مِنْهُمْ ذِكْرُ الْأَكْلِ، وَالذَّهَبِ إِلَّا فِي حَدِيثِ ابْنِ مُسْهِرٍ"
        },
        "chapter_id": "afbac2bc-374e-4693-95de-2d6380ccbc22",
        "chapter_name": "",
        "chapter_transliteration": {
          "en": "",
          "ms": "Bāb Taḥrīm Istiʿmāl Awānī al-Dhahab wa al-Fiḍḍah fī al-Shurb wa Ghayrihi ʿalā al-Rijāl wa al-Nisāʾ"
        },
        "chapter_title": {
          "en": "",
          "ms": "Bab Pengharaman Penggunaan Bekas-Bekas Daripada Emas Dan Perak Untuk Minum Dan Selainnya Bagi Lelaki Dan Wanita",
          "ar": "َابُ تَحْرِيمِ اسْتِعْمَالِ أَوَانِي الذَّهَبِ وَالْفِضَّةِ فِي الشُّرْبِ وَغَيْرِهِ عَلَى الرِّجَالِ وَالنِّسَاءِ"
        },
        "volume_id": "38e6e1bc-4366-4699-8a31-734dad119ffc",
        "volume_name": "",
        "volume_transliteration": {
			"en": "",
			"ms": "KITĀB AL-LIBĀS WA AL-ZĪNAH"
        },
        "volume_title": {
			"en": "",
			"ms": "KITAB PAKAIAN DAN PERHIASAN",
			"ar": "كتاب اللِّبَاسِ وَالزِّينَةِ"
        },
        "book_id": "240360e4-50b4-47a9-9506-9850b0e3bfd7",
        "book_name": "sahih_muslim",
        "book_title": {
          "en": "",
          "ms": "Sahih Muslim",
          "ar": ""
        }
    }
  ]